iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define System_Control_Space_NVIC (*(volatile struct System_Control_Space_NVIC_tag *) 0xe000e100)

struct System_Control_Space_SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

};

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct System_Control_Space_Memory_Protection_Unit_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CTRL;

  uint8_t MPU_RNR;
  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
      uint64_t ADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:4;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RBAR_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RASR_A3;

};

#define System_Control_Space_Memory_Protection_Unit (*(volatile struct System_Control_Space_Memory_Protection_Unit_tag *) 0xe000ed90)

struct ADC1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t STRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) STR;

  uint8_t res0[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MS:2;
      uint64_t reservedSpace0:2;
      uint64_t ACCSEL:2;
      uint64_t CLREN:1;
      uint64_t DFMT:1;
      uint64_t AVCNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSCHSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CR1;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TRGSELA:2;
      uint64_t reservedSpace0:5;
      uint64_t TRGENA:1;
      uint64_t TRGSELB:2;
      uint64_t reservedSpace1:5;
      uint64_t TRGENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVCHSEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVCHSELR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EXCHSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EXCHSELR;

  uint8_t res2[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SHSST:8;
      uint64_t SHSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SHCR;

  uint8_t res3[4];

  uint8_t SSTR0;
  uint8_t SSTR1;
  uint8_t SSTR2;
  uint8_t SSTR3;
  uint8_t SSTR4;
  uint8_t SSTR5;
  uint8_t SSTR6;
  uint8_t SSTR7;
  uint8_t SSTR8;
  uint8_t SSTR9;
  uint8_t SSTR10;
  uint8_t SSTR11;
  uint8_t SSTR12;
  uint8_t SSTR13;
  uint8_t SSTR14;
  uint8_t SSTR15;
  uint8_t SSTRL;
  uint8_t res4[7];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH00MUX:4;
      uint64_t CH01MUX:4;
      uint64_t CH02MUX:4;
      uint64_t CH03MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH04MUX:4;
      uint64_t CH05MUX:4;
      uint64_t CH06MUX:4;
      uint64_t CH07MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH08MUX:4;
      uint64_t CH09MUX:4;
      uint64_t CH10MUX:4;
      uint64_t CH11MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH12MUX:4;
      uint64_t CH13MUX:4;
      uint64_t CH14MUX:4;
      uint64_t CH15MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR3;

