iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res5[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOCAF:1;
      uint64_t EOCBF:1;
      uint64_t reservedSpace0:2;
      uint64_t SASTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOCAIEN:1;
      uint64_t EOCBIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ICR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLREOCAF:1;
      uint64_t CLREOCBF:1;
      uint64_t reservedSpace0:2;
      uint64_t CLRSASTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISCLRR;

  uint8_t res6[5];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SYNCEN:1;
      uint64_t reservedSpace0:3;
      uint64_t SYNCMD:3;
      uint64_t reservedSpace1:1;
      uint64_t SYNCDLY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SYNCCR;

  uint8_t res7[2];

  uint16_t DR0;
  uint16_t DR1;
  uint16_t DR2;
  uint16_t DR3;
  uint16_t DR4;
  uint16_t DR5;
  uint16_t DR6;
  uint16_t DR7;
  uint16_t DR8;
  uint16_t DR9;
  uint16_t DR10;
  uint16_t DR11;
  uint16_t DR12;
  uint16_t DR13;
  uint16_t DR14;
  uint16_t DR15;
  uint8_t res8[48];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AWD0EN:1;
      uint64_t AWD0IEN:1;
      uint64_t AWD0MD:1;
      uint64_t reservedSpace0:1;
      uint64_t AWD1EN:1;
      uint64_t AWD1IEN:1;
      uint64_t AWD1MD:1;
      uint64_t reservedSpace1:1;
      uint64_t AWDCM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) AWDCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWD0F:1;
      uint64_t AWD1F:1;
      uint64_t reservedSpace0:2;
      uint64_t AWDCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWDSR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLRAWD0F:1;
      uint64_t CLRAWD1F:1;
      uint64_t reservedSpace0:2;
      uint64_t CLRAWDCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWDSCLRR;

  uint16_t AWD0DR0;
  uint16_t AWD0DR1;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWD0CHSR;

  uint8_t res9[3];

  uint16_t AWD1DR0;
  uint16_t AWD1DR1;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWD1CHSR;

  uint8_t res10[15];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PGACTL:4;
      uint64_t PGAGAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PGACR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PGACTL:4;
      uint64_t PGAGAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PGACR2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PGACTL:4;
      uint64_t PGAGAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PGACR3;

  uint8_t res11[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PGAVSSEN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PGAVSSENR;

};

#define ADC1 (*(volatile struct ADC1_tag *) 0x40040000)

struct ADC2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t STRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) STR;

  uint8_t res0[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MS:2;
      uint64_t reservedSpace0:2;
      uint64_t ACCSEL:2;
      uint64_t CLREN:1;
      uint64_t DFMT:1;
      uint64_t AVCNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSCHSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CR1;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TRGSELA:2;
      uint64_t reservedSpace0:5;
      uint64_t TRGENA:1;
      uint64_t TRGSELB:2;
      uint64_t reservedSpace1:5;
      uint64_t TRGENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVCHSEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVCHSELR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EXCHSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EXCHSELR;

  uint8_t res2[7];

  uint8_t SSTR0;
  uint8_t SSTR1;
  uint8_t SSTR2;
  uint8_t SSTR3;
  uint8_t SSTR4;
  uint8_t SSTR5;
  uint8_t SSTR6;
  uint8_t SSTR7;
  uint8_t SSTR8;
  uint8_t SSTR9;
  uint8_t SSTR10;
  uint8_t SSTR11;
  uint8_t SSTR12;
  uint8_t SSTR13;
  uint8_t SSTR14;
  uint8_t SSTR15;
  uint8_t SSTRL;
  uint8_t res3[7];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH00MUX:4;
      uint64_t CH01MUX:4;
      uint64_t CH02MUX:4;
      uint64_t CH03MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH04MUX:4;
      uint64_t CH05MUX:4;
      uint64_t CH06MUX:4;
      uint64_t CH07MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH08MUX:4;
      uint64_t CH09MUX:4;
      uint64_t CH10MUX:4;
      uint64_t CH11MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH12MUX:4;
      uint64_t CH13MUX:4;
      uint64_t CH14MUX:4;
      uint64_t CH15MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR3;

  uint8_t res4[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOCAF:1;
      uint64_t EOCBF:1;
      uint64_t reservedSpace0:2;
      uint64_t SASTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOCAIEN:1;
      uint64_t EOCBIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ICR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLREOCAF:1;
      uint64_t CLREOCBF:1;
      uint64_t reservedSpace0:2;
      uint64_t CLRSASTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISCLRR;

  uint8_t res5[9];

  uint16_t DR0;
  uint16_t DR1;
  uint16_t DR2;
  uint16_t DR3;
  uint16_t DR4;
  uint16_t DR5;
  uint16_t DR6;
  uint16_t DR7;
  uint16_t DR8;
  uint16_t DR9;
  uint16_t DR10;
  uint16_t DR11;
  uint16_t DR12;
  uint16_t DR13;
  uint16_t DR14;
  uint16_t DR15;
  uint8_t res6[48];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AWD0EN:1;
      uint64_t AWD0IEN:1;
      uint64_t AWD0MD:1;
      uint64_t reservedSpace0:1;
      uint64_t AWD1EN:1;
      uint64_t AWD1IEN:1;
      uint64_t AWD1MD:1;
      uint64_t reservedSpace1:1;
      uint64_t AWDCM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) AWDCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWD0F:1;
      uint64_t AWD1F:1;
      uint64_t reservedSpace0:2;
      uint64_t AWDCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWDSR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLRAWD0F:1;
      uint64_t CLRAWD1F:1;
      uint64_t reservedSpace0:2;
      uint64_t CLRAWDCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWDSCLRR;

  uint16_t AWD0DR0;
  uint16_t AWD0DR1;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWD0CHSR;

  uint8_t res7[3];

  uint16_t AWD1DR0;
  uint16_t AWD1DR1;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWD1CHSR;

  uint8_t res8[15];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PGACTL:4;
      uint64_t PGAGAIN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PGACR1;

