iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PGAVSSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PGAVSSENR;

};

#define ADC2 (*(volatile struct ADC2_tag *) 0x40040400)

struct ADC3_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t STRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) STR;

  uint8_t res0[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MS:2;
      uint64_t reservedSpace0:2;
      uint64_t ACCSEL:2;
      uint64_t CLREN:1;
      uint64_t DFMT:1;
      uint64_t AVCNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSCHSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CR1;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TRGSELA:2;
      uint64_t reservedSpace0:5;
      uint64_t TRGENA:1;
      uint64_t TRGSELB:2;
      uint64_t reservedSpace1:5;
      uint64_t TRGENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELA:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELB:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVCHSEL:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVCHSELR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EXCHSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EXCHSELR;

  uint8_t res2[7];

  uint8_t SSTR0;
  uint8_t SSTR1;
  uint8_t SSTR2;
  uint8_t SSTR3;
  uint8_t SSTR4;
  uint8_t SSTR5;
  uint8_t SSTR6;
  uint8_t SSTR7;
  uint8_t SSTR8;
  uint8_t SSTR9;
  uint8_t SSTR10;
  uint8_t SSTR11;
  uint8_t SSTR12;
  uint8_t SSTR13;
  uint8_t SSTR14;
  uint8_t SSTR15;
  uint8_t SSTRL;
  uint8_t res3[7];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH00MUX:4;
      uint64_t CH01MUX:4;
      uint64_t CH02MUX:4;
      uint64_t CH03MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH04MUX:4;
      uint64_t CH05MUX:4;
      uint64_t CH06MUX:4;
      uint64_t CH07MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH08MUX:4;
      uint64_t CH09MUX:4;
      uint64_t CH10MUX:4;
      uint64_t CH11MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CH12MUX:4;
      uint64_t CH13MUX:4;
      uint64_t CH14MUX:4;
      uint64_t CH15MUX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHMUXR3;

  uint8_t res4[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOCAF:1;
      uint64_t EOCBF:1;
      uint64_t reservedSpace0:2;
      uint64_t SASTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOCAIEN:1;
      uint64_t EOCBIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ICR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLREOCAF:1;
      uint64_t CLREOCBF:1;
      uint64_t reservedSpace0:2;
      uint64_t CLRSASTPDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISCLRR;

  uint8_t res5[9];

  uint16_t DR0;
  uint16_t DR1;
  uint16_t DR2;
  uint16_t DR3;
  uint16_t DR4;
  uint16_t DR5;
  uint16_t DR6;
  uint16_t DR7;
  uint16_t DR8;
  uint16_t DR9;
  uint16_t DR10;
  uint16_t DR11;
  uint16_t DR12;
  uint16_t DR13;
  uint16_t DR14;
  uint16_t DR15;
  uint16_t DR16;
  uint16_t DR17;
  uint16_t DR18;
  uint16_t DR19;
  uint8_t res6[40];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AWD0EN:1;
      uint64_t AWD0IEN:1;
      uint64_t AWD0MD:1;
      uint64_t reservedSpace0:1;
      uint64_t AWD1EN:1;
      uint64_t AWD1IEN:1;
      uint64_t AWD1MD:1;
      uint64_t reservedSpace1:1;
      uint64_t AWDCM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) AWDCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWD0F:1;
      uint64_t AWD1F:1;
      uint64_t reservedSpace0:2;
      uint64_t AWDCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWDSR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLRAWD0F:1;
      uint64_t CLRAWD1F:1;
      uint64_t reservedSpace0:2;
      uint64_t CLRAWDCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWDSCLRR;

  uint16_t AWD0DR0;
  uint16_t AWD0DR1;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWD0CHSR;

  uint8_t res7[3];

  uint16_t AWD1DR0;
  uint16_t AWD1DR1;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) AWD1CHSR;

};

#define ADC3 (*(volatile struct ADC3_tag *) 0x40040800)

struct AES_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t KEYSIZE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint8_t res0[12];

  uint32_t DR0;
  uint32_t DR1;
  uint32_t DR2;
  uint32_t DR3;
  uint32_t KR0;
  uint32_t KR1;
  uint32_t KR2;
  uint32_t KR3;
  uint32_t KR4;
  uint32_t KR5;
  uint32_t KR6;
  uint32_t KR7;
};

#define AES (*(volatile struct AES_tag *) 0x40008000)

struct AOS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSFTTRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCU_TRGSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCU_TRGSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCU_TRGSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCU_TRGSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1_TRGSEL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2_TRGSEL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TRGSELRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR6_HTSSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR6_HTSSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR6_HTSSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR6_HTSSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTTRGSR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTTRGSR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR0_HTSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR2_HTSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_ITRGSELA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_ITRGSELB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMRA_HTSSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMRA_HTSSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMRA_HTSSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMRA_HTSSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTS_TRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_ITRGSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_ITRGSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC2_ITRGSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC2_ITRGSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC3_ITRGSELR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:9;
      uint64_t reservedSpace0:21;
      uint64_t COMTRG_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC3_ITRGSELR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMTRG:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMTRG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMTRG:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMTRG2;

  uint8_t res0[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTDIRR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTODR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTORR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTOSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTRISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTFAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTDIRR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTODR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTORR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTOSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTRISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTFAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTDIRR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTODR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTORR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTOSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTRISR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTFAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTDIRR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTIDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTODR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTORR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTOSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTRISR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTFAL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFEN1:1;
      uint64_t DIVS1:2;
      uint64_t reservedSpace0:5;
      uint64_t NFEN2:1;
      uint64_t DIVS2:2;
      uint64_t reservedSpace1:5;
      uint64_t NFEN3:1;
      uint64_t DIVS3:2;
      uint64_t reservedSpace2:5;
      uint64_t NFEN4:1;
      uint64_t DIVS4:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEVNTNFCR;

