iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define AOS (*(volatile struct AOS_tag *) 0x40010800)

struct CAN1_tag
{
  uint32_t RBUF;
  uint8_t res0[76];

  uint32_t TBUF;
  uint8_t res1[76];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BUSOFF:1;
      uint64_t TACTIVE:1;
      uint64_t RACTIVE:1;
      uint64_t TSSS:1;
      uint64_t TPSS:1;
      uint64_t LBMI:1;
      uint64_t LBME:1;
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG_STAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TSA:1;
      uint64_t TSALL:1;
      uint64_t TSONE:1;
      uint64_t TPA:1;
      uint64_t TPE:1;
      uint64_t reservedSpace0:1;
      uint64_t LOM:1;
      uint64_t TBSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TCMD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TSSTAT:2;
      uint64_t reservedSpace0:2;
      uint64_t TTTBM:1;
      uint64_t TSMODE:1;
      uint64_t TSNEXT:1;
      uint64_t FD_ISO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RSTAT:2;
      uint64_t reservedSpace0:1;
      uint64_t RBALL:1;
      uint64_t RREL:1;
      uint64_t ROV:1;
      uint64_t ROM:1;
      uint64_t SACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TSFF:1;
      uint64_t EIE:1;
      uint64_t TSIE:1;
      uint64_t TPIE:1;
      uint64_t RAFIE:1;
      uint64_t RFIE:1;
      uint64_t ROIE:1;
      uint64_t RIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTIE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AIF:1;
      uint64_t EIF:1;
      uint64_t TSIF:1;
      uint64_t TPIF:1;
      uint64_t RAFIF:1;
      uint64_t RFIF:1;
      uint64_t ROIF:1;
      uint64_t RIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTIF;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BEIF:1;
      uint64_t BEIE:1;
      uint64_t ALIF:1;
      uint64_t ALIE:1;
      uint64_t EPIF:1;
      uint64_t EPIE:1;
      uint64_t EPASS:1;
      uint64_t EWARN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ERRINT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EWL:4;
      uint64_t AFWL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LIMIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_SEG_1:8;
      uint64_t S_SEG_2:7;
      uint64_t reservedSpace0:1;
      uint64_t S_SJW:7;
      uint64_t reservedSpace1:1;
      uint64_t S_PRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_SEG_1:5;
      uint64_t reservedSpace0:3;
      uint64_t F_SEG_2:4;
      uint64_t reservedSpace1:4;
      uint64_t F_SJW:4;
      uint64_t reservedSpace2:4;
      uint64_t F_PRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALC:5;
      uint64_t KOER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EALCAP;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSPOFF:7;
      uint64_t TDCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TDC;

  uint8_t RECNT;
  uint8_t TECNT;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACFADR:4;
      uint64_t reservedSpace0:1;
      uint64_t SELMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ACFCTRL;

  uint8_t res2[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AE_1:1;
      uint64_t AE_2:1;
      uint64_t AE_3:1;
      uint64_t AE_4:1;
      uint64_t AE_5:1;
      uint64_t AE_6:1;
      uint64_t AE_7:1;
      uint64_t AE_8:1;
      uint64_t AE_9:1;
      uint64_t AE_10:1;
      uint64_t AE_11:1;
      uint64_t AE_12:1;
      uint64_t AE_13:1;
      uint64_t AE_14:1;
      uint64_t AE_15:1;
      uint64_t AE_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ACFEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACODEORAMASK:29;
      uint64_t AIDE:1;
      uint64_t AIDEE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACF;

  uint8_t res3[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TBPTR:6;
      uint64_t TBF:1;
      uint64_t TBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TBSLOT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TTEN:1;
      uint64_t T_PRESC:2;
      uint64_t TTIF:1;
      uint64_t TTIE:1;
      uint64_t TEIF:1;
      uint64_t WTIF:1;
      uint64_t WTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_ID:29;
      uint64_t reservedSpace0:2;
      uint64_t REF_IDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REF_MSG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TTPTR:6;
      uint64_t reservedSpace0:2;
      uint64_t TTYPE:3;
      uint64_t reservedSpace1:1;
      uint64_t TEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRG_CFG;

  uint16_t TT_TRIG;
  uint16_t TT_WTRIG;
};

#define CAN1 (*(volatile struct CAN1_tag *) 0x40009000)

struct CAN2_tag
{
  uint32_t RBUF;
  uint8_t res0[76];

  uint32_t TBUF;
  uint8_t res1[76];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BUSOFF:1;
      uint64_t TACTIVE:1;
      uint64_t RACTIVE:1;
      uint64_t TSSS:1;
      uint64_t TPSS:1;
      uint64_t LBMI:1;
      uint64_t LBME:1;
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CFG_STAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TSA:1;
      uint64_t TSALL:1;
      uint64_t TSONE:1;
      uint64_t TPA:1;
      uint64_t TPE:1;
      uint64_t reservedSpace0:1;
      uint64_t LOM:1;
      uint64_t TBSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TCMD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TSSTAT:2;
      uint64_t reservedSpace0:2;
      uint64_t TTTBM:1;
      uint64_t TSMODE:1;
      uint64_t TSNEXT:1;
      uint64_t FD_ISO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RSTAT:2;
      uint64_t reservedSpace0:1;
      uint64_t RBALL:1;
      uint64_t RREL:1;
      uint64_t ROV:1;
      uint64_t ROM:1;
      uint64_t SACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TSFF:1;
      uint64_t EIE:1;
      uint64_t TSIE:1;
      uint64_t TPIE:1;
      uint64_t RAFIE:1;
      uint64_t RFIE:1;
      uint64_t ROIE:1;
      uint64_t RIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTIE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AIF:1;
      uint64_t EIF:1;
      uint64_t TSIF:1;
      uint64_t TPIF:1;
      uint64_t RAFIF:1;
      uint64_t RFIF:1;
      uint64_t ROIF:1;
      uint64_t RIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTIF;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BEIF:1;
      uint64_t BEIE:1;
      uint64_t ALIF:1;
      uint64_t ALIE:1;
      uint64_t EPIF:1;
      uint64_t EPIE:1;
      uint64_t EPASS:1;
      uint64_t EWARN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ERRINT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EWL:4;
      uint64_t AFWL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LIMIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_SEG_1:8;
      uint64_t S_SEG_2:7;
      uint64_t reservedSpace0:1;
      uint64_t S_SJW:7;
      uint64_t reservedSpace1:1;
      uint64_t S_PRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_SEG_1:5;
      uint64_t reservedSpace0:3;
      uint64_t F_SEG_2:4;
      uint64_t reservedSpace1:4;
      uint64_t F_SJW:4;
      uint64_t reservedSpace2:4;
      uint64_t F_PRESC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALC:5;
      uint64_t KOER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EALCAP;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSPOFF:7;
      uint64_t TDCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TDC;

  uint8_t RECNT;
  uint8_t TECNT;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACFADR:4;
      uint64_t reservedSpace0:1;
      uint64_t SELMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ACFCTRL;

  uint8_t res2[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AE_1:1;
      uint64_t AE_2:1;
      uint64_t AE_3:1;
      uint64_t AE_4:1;
      uint64_t AE_5:1;
      uint64_t AE_6:1;
      uint64_t AE_7:1;
      uint64_t AE_8:1;
      uint64_t AE_9:1;
      uint64_t AE_10:1;
      uint64_t AE_11:1;
      uint64_t AE_12:1;
      uint64_t AE_13:1;
      uint64_t AE_14:1;
      uint64_t AE_15:1;
      uint64_t AE_16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ACFEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACODEORAMASK:29;
      uint64_t AIDE:1;
      uint64_t AIDEE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACF;

  uint8_t res3[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TBPTR:6;
      uint64_t TBF:1;
      uint64_t TBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TBSLOT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TTEN:1;
      uint64_t T_PRESC:2;
      uint64_t TTIF:1;
      uint64_t TTIE:1;
      uint64_t TEIF:1;
      uint64_t WTIF:1;
      uint64_t WTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_ID:29;
      uint64_t reservedSpace0:2;
      uint64_t REF_IDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REF_MSG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TTPTR:6;
      uint64_t reservedSpace0:2;
      uint64_t TTYPE:3;
      uint64_t reservedSpace1:1;
      uint64_t TEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRG_CFG;

  uint16_t TT_TRIG;
  uint16_t TT_WTRIG;
};

#define CAN2 (*(volatile struct CAN2_tag *) 0x40078000)

