iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
struct CMP1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CENB:1;
      uint64_t CWDE:1;
      uint64_t reservedSpace0:5;
      uint64_t CMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FCKS:2;
      uint64_t reservedSpace0:2;
      uint64_t EDGS:2;
      uint64_t CIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FIR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COEN:1;
      uint64_t COPS:1;
      uint64_t CPOE:1;
      uint64_t TWOE:1;
      uint64_t TWOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RVSL:4;
      uint64_t CVSL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWS0:1;
      uint64_t CTWS1:1;
      uint64_t CTWS2:1;
      uint64_t CTWS3:1;
      uint64_t CTWS4:1;
      uint64_t CTWS5:1;
      uint64_t CTWS6:1;
      uint64_t CTWS7:1;
      uint64_t CTWS8:1;
      uint64_t CTWS9:1;
      uint64_t CTWS10:1;
      uint64_t CTWS11:1;
      uint64_t CTWS12:1;
      uint64_t CTWS13:1;
      uint64_t CTWS14:1;
      uint64_t CTWS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWP0:1;
      uint64_t CTWP1:1;
      uint64_t CTWP2:1;
      uint64_t CTWP3:1;
      uint64_t CTWP4:1;
      uint64_t CTWP5:1;
      uint64_t CTWP6:1;
      uint64_t CTWP7:1;
      uint64_t CTWP8:1;
      uint64_t CTWP9:1;
      uint64_t CTWP10:1;
      uint64_t CTWP11:1;
      uint64_t CTWP12:1;
      uint64_t CTWP13:1;
      uint64_t CTWP14:1;
      uint64_t CTWP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWPR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2SL:3;
      uint64_t reservedSpace0:1;
      uint64_t P3SL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VISR;

};

#define CMP1 (*(volatile struct CMP1_tag *) 0x4004a000)

struct CMP2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CENB:1;
      uint64_t CWDE:1;
      uint64_t reservedSpace0:5;
      uint64_t CMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FCKS:2;
      uint64_t reservedSpace0:2;
      uint64_t EDGS:2;
      uint64_t CIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FIR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COEN:1;
      uint64_t COPS:1;
      uint64_t CPOE:1;
      uint64_t TWOE:1;
      uint64_t TWOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RVSL:4;
      uint64_t CVSL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWS0:1;
      uint64_t CTWS1:1;
      uint64_t CTWS2:1;
      uint64_t CTWS3:1;
      uint64_t CTWS4:1;
      uint64_t CTWS5:1;
      uint64_t CTWS6:1;
      uint64_t CTWS7:1;
      uint64_t CTWS8:1;
      uint64_t CTWS9:1;
      uint64_t CTWS10:1;
      uint64_t CTWS11:1;
      uint64_t CTWS12:1;
      uint64_t CTWS13:1;
      uint64_t CTWS14:1;
      uint64_t CTWS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWP0:1;
      uint64_t CTWP1:1;
      uint64_t CTWP2:1;
      uint64_t CTWP3:1;
      uint64_t CTWP4:1;
      uint64_t CTWP5:1;
      uint64_t CTWP6:1;
      uint64_t CTWP7:1;
      uint64_t CTWP8:1;
      uint64_t CTWP9:1;
      uint64_t CTWP10:1;
      uint64_t CTWP11:1;
      uint64_t CTWP12:1;
      uint64_t CTWP13:1;
      uint64_t CTWP14:1;
      uint64_t CTWP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWPR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2SL:3;
      uint64_t reservedSpace0:1;
      uint64_t P3SL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VISR;

};

#define CMP2 (*(volatile struct CMP2_tag *) 0x4004a010)

struct CMP3_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CENB:1;
      uint64_t CWDE:1;
      uint64_t reservedSpace0:5;
      uint64_t CMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FCKS:2;
      uint64_t reservedSpace0:2;
      uint64_t EDGS:2;
      uint64_t CIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FIR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COEN:1;
      uint64_t COPS:1;
      uint64_t CPOE:1;
      uint64_t TWOE:1;
      uint64_t TWOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RVSL:4;
      uint64_t CVSL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWS0:1;
      uint64_t CTWS1:1;
      uint64_t CTWS2:1;
      uint64_t CTWS3:1;
      uint64_t CTWS4:1;
      uint64_t CTWS5:1;
      uint64_t CTWS6:1;
      uint64_t CTWS7:1;
      uint64_t CTWS8:1;
      uint64_t CTWS9:1;
      uint64_t CTWS10:1;
      uint64_t CTWS11:1;
      uint64_t CTWS12:1;
      uint64_t CTWS13:1;
      uint64_t CTWS14:1;
      uint64_t CTWS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWP0:1;
      uint64_t CTWP1:1;
      uint64_t CTWP2:1;
      uint64_t CTWP3:1;
      uint64_t CTWP4:1;
      uint64_t CTWP5:1;
      uint64_t CTWP6:1;
      uint64_t CTWP7:1;
      uint64_t CTWP8:1;
      uint64_t CTWP9:1;
      uint64_t CTWP10:1;
      uint64_t CTWP11:1;
      uint64_t CTWP12:1;
      uint64_t CTWP13:1;
      uint64_t CTWP14:1;
      uint64_t CTWP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWPR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2SL:3;
      uint64_t reservedSpace0:1;
      uint64_t P3SL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VISR;

