iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define CMP3 (*(volatile struct CMP3_tag *) 0x4004a400)

struct CMP4_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CENB:1;
      uint64_t CWDE:1;
      uint64_t reservedSpace0:5;
      uint64_t CMON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FCKS:2;
      uint64_t reservedSpace0:2;
      uint64_t EDGS:2;
      uint64_t CIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FIR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COEN:1;
      uint64_t COPS:1;
      uint64_t CPOE:1;
      uint64_t TWOE:1;
      uint64_t TWOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RVSL:4;
      uint64_t CVSL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWS0:1;
      uint64_t CTWS1:1;
      uint64_t CTWS2:1;
      uint64_t CTWS3:1;
      uint64_t CTWS4:1;
      uint64_t CTWS5:1;
      uint64_t CTWS6:1;
      uint64_t CTWS7:1;
      uint64_t CTWS8:1;
      uint64_t CTWS9:1;
      uint64_t CTWS10:1;
      uint64_t CTWS11:1;
      uint64_t CTWS12:1;
      uint64_t CTWS13:1;
      uint64_t CTWS14:1;
      uint64_t CTWS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTWP0:1;
      uint64_t CTWP1:1;
      uint64_t CTWP2:1;
      uint64_t CTWP3:1;
      uint64_t CTWP4:1;
      uint64_t CTWP5:1;
      uint64_t CTWP6:1;
      uint64_t CTWP7:1;
      uint64_t CTWP8:1;
      uint64_t CTWP9:1;
      uint64_t CTWP10:1;
      uint64_t CTWP11:1;
      uint64_t CTWP12:1;
      uint64_t CTWP13:1;
      uint64_t CTWP14:1;
      uint64_t CTWP15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TWPR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2SL:3;
      uint64_t reservedSpace0:1;
      uint64_t P3SL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VISR;

};

#define CMP4 (*(volatile struct CMP4_tag *) 0x4004a410)

struct CMU_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTAL32STP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTAL32CR;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTAL32DRV:3;
      uint64_t XTAL32IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTAL32CFGR;

  uint8_t res1[15];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTAL32NF:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTAL32NFR;

  uint8_t res2[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LRCSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LRCCR;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RTCLRCSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RTCLRCCR;

  uint8_t res4[3];

  uint8_t LRCTRM;
  uint8_t res5[7];

  uint8_t RTCLRCTRM;
  uint8_t res6[2123];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t XTALDRV:2;
      uint64_t XTALMS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTALCFGR;

  uint8_t res7[29591];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PERICKSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PERICKSEL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t I2S1CKSEL:4;
      uint64_t I2S2CKSEL:4;
      uint64_t I2S3CKSEL:4;
      uint64_t I2S4CKSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2SCKSEL;

  uint8_t res8[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CAN1CKS:4;
      uint64_t CAN2CKS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CANCKCFGR;

  uint8_t res9[7];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCLK0S:3;
      uint64_t reservedSpace0:1;
      uint64_t PCLK1S:3;
      uint64_t reservedSpace1:1;
      uint64_t PCLK2S:3;
      uint64_t reservedSpace2:1;
      uint64_t PCLK3S:3;
      uint64_t reservedSpace3:1;
      uint64_t PCLK4S:3;
      uint64_t reservedSpace4:1;
      uint64_t EXCKS:3;
      uint64_t reservedSpace5:1;
      uint64_t HCLKS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCFGR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t USBCKS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USBCKCFGR;

  uint8_t res10[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CKSW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CKSWR;

  uint8_t res11[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLLHOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PLLHCR;

  uint8_t res12[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLLAOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PLLACR;

  uint8_t res13[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTALSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTALCR;

  uint8_t res14[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HRCSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HRCCR;

  uint8_t res15[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MRCSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MRCCR;

  uint8_t res16[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HRCSTBF:1;
      uint64_t reservedSpace0:2;
      uint64_t XTALSTBF:1;
      uint64_t reservedSpace1:1;
      uint64_t PLLHSTBF:1;
      uint64_t PLLASTBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCSTBSR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCOSEL:4;
      uint64_t MCODIV:3;
      uint64_t MCOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCOCFGR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCOSEL:4;
      uint64_t MCODIV:3;
      uint64_t MCOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCOCFGR2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TPIUCKS:2;
      uint64_t reservedSpace0:5;
      uint64_t TPIUCKOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TPIUCKCFGR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTALSTDIE:1;
      uint64_t XTALSTDRE:1;
      uint64_t XTALSTDRIS:1;
      uint64_t reservedSpace0:4;
      uint64_t XTALSTDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTALSTDCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTALSTDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTALSTDSR;

  uint8_t res17[31];

