iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t MRCTRM;
  uint8_t HRCTRM;
  uint8_t res18[63];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t XTALSTB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) XTALSTBCR;

  uint8_t res19[93];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLHM:2;
      uint64_t reservedSpace0:5;
      uint64_t PLLSRC:1;
      uint64_t PLLHN:8;
      uint64_t reservedSpace1:4;
      uint64_t PLLHR:4;
      uint64_t PLLHQ:4;
      uint64_t PLLHP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLHCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLAM:5;
      uint64_t reservedSpace0:3;
      uint64_t PLLAN:9;
      uint64_t reservedSpace1:3;
      uint64_t PLLAR:4;
      uint64_t PLLAQ:4;
      uint64_t PLLAP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLACFGR;

};

#define CMU (*(volatile struct CMU_tag *) 0x4004c400)

struct CRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:1;
      uint64_t FLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint32_t RESLT;
  uint8_t res0[120];

  uint32_t DAT0;
  uint32_t DAT1;
  uint32_t DAT2;
  uint32_t DAT3;
  uint32_t DAT4;
  uint32_t DAT5;
  uint32_t DAT6;
  uint32_t DAT7;
  uint32_t DAT8;
  uint32_t DAT9;
  uint32_t DAT10;
  uint32_t DAT11;
  uint32_t DAT12;
  uint32_t DAT13;
  uint32_t DAT14;
  uint32_t DAT15;
  uint32_t DAT16;
  uint32_t DAT17;
  uint32_t DAT18;
  uint32_t DAT19;
  uint32_t DAT20;
  uint32_t DAT21;
  uint32_t DAT22;
  uint32_t DAT23;
  uint32_t DAT24;
  uint32_t DAT25;
  uint32_t DAT26;
  uint32_t DAT27;
  uint32_t DAT28;
  uint32_t DAT29;
  uint32_t DAT30;
  uint32_t DAT31;
};

#define CRC (*(volatile struct CRC_tag *) 0x40008c00)

struct CTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFPSC:3;
      uint64_t reservedSpace0:1;
      uint64_t REFCKS:2;
      uint64_t ERRIE:1;
      uint64_t CTCEN:1;
      uint64_t reservedSpace1:8;
      uint64_t TRMVAL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFSVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t RLDVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMOK:1;
      uint64_t TRMOVF:1;
      uint64_t TRMUDF:1;
      uint64_t CTCBSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

};

#define CTC (*(volatile struct CTC_tag *) 0x40049c00)

struct DAC1_tag
{
  uint16_t DADR1;
  uint16_t DADR2;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DAE:1;
      uint64_t DA1E:1;
      uint64_t DA2E:1;
      uint64_t reservedSpace0:5;
      uint64_t DPSEL:1;
      uint64_t DAAMP1:1;
      uint64_t DAAMP2:1;
      uint64_t EXTDSL1:1;
      uint64_t EXTDSL2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DACR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADCSL1:1;
      uint64_t ADCSL2:1;
      uint64_t ADCSL3:1;
      uint64_t reservedSpace0:5;
      uint64_t DA1SF:1;
      uint64_t DA2SF:1;
      uint64_t reservedSpace1:5;
      uint64_t ADPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DAADPCR;

  uint8_t res0[20];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t DAODIS1:1;
      uint64_t DAODIS2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DAOCR;

};

#define DAC1 (*(volatile struct DAC1_tag *) 0x40041000)

struct DAC2_tag
{
  uint16_t DADR1;
  uint16_t DADR2;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DAE:1;
      uint64_t DA1E:1;
      uint64_t DA2E:1;
      uint64_t reservedSpace0:5;
      uint64_t DPSEL:1;
      uint64_t DAAMP1:1;
      uint64_t DAAMP2:1;
      uint64_t EXTDSL1:1;
      uint64_t EXTDSL2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DACR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADCSL1:1;
      uint64_t ADCSL2:1;
      uint64_t ADCSL3:1;
      uint64_t reservedSpace0:5;
      uint64_t DA1SF:1;
      uint64_t DA2SF:1;
      uint64_t reservedSpace1:5;
      uint64_t ADPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DAADPCR;

  uint8_t res0[20];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t DAODIS1:1;
      uint64_t DAODIS2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DAOCR;

};

#define DAC2 (*(volatile struct DAC2_tag *) 0x40041400)

struct DBGC_tag
{
  uint32_t AUTHID0;
  uint32_t AUTHID1;
  uint32_t AUTHID2;
  uint32_t RESV0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTH:1;
      uint64_t REMVLOCK:1;
      uint64_t SAFTYLOCK1:1;
      uint64_t SAFTYLOCK2:1;
      uint64_t reservedSpace0:4;
      uint64_t CPUSTOP:1;
      uint64_t CPUSLEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDBGRQ:1;
      uint64_t RESTART:1;
      uint64_t reservedSpace0:6;
      uint64_t DIRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASEREQ:1;
      uint64_t ERASEACK:1;
      uint64_t ERASEERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMCCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDBGPWRUPREQ:1;
      uint64_t CDBGPWRUPACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUDBGCSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWDTSTP:1;
      uint64_t WDTSTP:1;
      uint64_t RTCSTP:1;
      uint64_t PVD0STP:1;
      uint64_t PVD1STP:1;
      uint64_t PVD2STP:1;
      uint64_t M06STP:1;
      uint64_t M07STP:1;
      uint64_t M08STP:1;
      uint64_t M09STP:1;
      uint64_t M10STP:1;
      uint64_t M11STP:1;
      uint64_t M12STP:1;
      uint64_t M13STP:1;
      uint64_t M14STP:1;
      uint64_t M15STP:1;
      uint64_t M16STP:1;
      uint64_t M17STP:1;
      uint64_t M18STP:1;
      uint64_t M19STP:1;
      uint64_t M20STP:1;
      uint64_t M21STP:1;
      uint64_t M22STP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUSTPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRACEMODE:2;
      uint64_t TRACEIOEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUTRACECTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M32STP:1;
      uint64_t M33STP:1;
      uint64_t M34STP:1;
      uint64_t M35STP:1;
      uint64_t M36STP:1;
      uint64_t M37STP:1;
      uint64_t M38STP:1;
      uint64_t M39STP:1;
      uint64_t M40STP:1;
      uint64_t M41STP:1;
      uint64_t M42STP:1;
      uint64_t M43STP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUSTPCTL2;

