iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define DBGC (*(volatile struct DBGC_tag *) 0xe0042000)

struct DCU1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t FLAG_RLD:1;
      uint64_t FLAG_BTM:1;
      uint64_t FLAG_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_RLD:1;
      uint64_t CLR_BTM:1;
      uint64_t CLR_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
      uint64_t SEL_RLD:1;
      uint64_t SEL_BTM:1;
      uint64_t SEL_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU1 (*(volatile struct DCU1_tag *) 0x40056000)

struct DCU2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t FLAG_RLD:1;
      uint64_t FLAG_BTM:1;
      uint64_t FLAG_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_RLD:1;
      uint64_t CLR_BTM:1;
      uint64_t CLR_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
      uint64_t SEL_RLD:1;
      uint64_t SEL_BTM:1;
      uint64_t SEL_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU2 (*(volatile struct DCU2_tag *) 0x40056400)

struct DCU3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t FLAG_RLD:1;
      uint64_t FLAG_BTM:1;
      uint64_t FLAG_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_RLD:1;
      uint64_t CLR_BTM:1;
      uint64_t CLR_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
      uint64_t SEL_RLD:1;
      uint64_t SEL_BTM:1;
      uint64_t SEL_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU3 (*(volatile struct DCU3_tag *) 0x40056800)

struct DCU4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t FLAG_RLD:1;
      uint64_t FLAG_BTM:1;
      uint64_t FLAG_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
      uint64_t reservedSpace0:2;
      uint64_t CLR_RLD:1;
      uint64_t CLR_BTM:1;
      uint64_t CLR_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
      uint64_t SEL_RLD:1;
      uint64_t SEL_BTM:1;
      uint64_t SEL_TOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

