iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define DCU4 (*(volatile struct DCU4_tag *) 0x40056c00)

struct DCU5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU5 (*(volatile struct DCU5_tag *) 0x40057000)

struct DCU6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU6 (*(volatile struct DCU6_tag *) 0x40057400)

struct DCU7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU7 (*(volatile struct DCU7_tag *) 0x40057800)

struct DCU8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:4;
      uint64_t DATASIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t COMP_TRG:1;
      uint64_t reservedSpace1:22;
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLAG_OP:1;
      uint64_t FLAG_LS2:1;
      uint64_t FLAG_EQ2:1;
      uint64_t FLAG_GT2:1;
      uint64_t FLAG_LS1:1;
      uint64_t FLAG_EQ1:1;
      uint64_t FLAG_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAG;

  uint32_t DATA0;
  uint32_t DATA1;
  uint32_t DATA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_OP:1;
      uint64_t CLR_LS2:1;
      uint64_t CLR_EQ2:1;
      uint64_t CLR_GT2:1;
      uint64_t CLR_LS1:1;
      uint64_t CLR_EQ1:1;
      uint64_t CLR_GT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLAGCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_OP:1;
      uint64_t SEL_LS2:1;
      uint64_t SEL_EQ2:1;
      uint64_t SEL_GT2:1;
      uint64_t SEL_LS1:1;
      uint64_t SEL_EQ1:1;
      uint64_t SEL_GT1:1;
      uint64_t SEL_WIN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEVTSEL;

};

#define DCU8 (*(volatile struct DCU8_tag *) 0x40057c00)

struct DMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:2;
      uint64_t MEMW:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STCTL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDADD:14;
      uint64_t reservedSpace0:2;
      uint64_t CMDBA:2;
      uint64_t CMD:2;
      uint64_t CMDCHIP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COLBS:3;
      uint64_t reservedSpace0:1;
      uint64_t ROWBS:3;
      uint64_t APBS:1;
      uint64_t CKEDIS:1;
      uint64_t CKSTOP:1;
      uint64_t CKEDISPRD:6;
      uint64_t BURST:3;
      uint64_t reservedSpace1:5;
      uint64_t ACTCP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFPRD:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_CASL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_CASL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_DQSS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_DQSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_MRD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_MRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RAS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_RAS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_RC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RCD_B:3;
      uint64_t reservedSpace0:1;
      uint64_t T_RCD_P:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_RCD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RFC_B:5;
      uint64_t reservedSpace0:3;
      uint64_t T_RFC_P:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_RFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RP_B:3;
      uint64_t reservedSpace0:1;
      uint64_t T_RP_P:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_RP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RRD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_RRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_WR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_WR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_WTR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_WTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_XP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_XP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_XSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_XSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_ESR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR_T_ESR;

  uint8_t res0[436];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
      uint64_t BRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
      uint64_t BRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
      uint64_t BRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
      uint64_t BRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR3;

  uint8_t res1[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMCMW:2;
      uint64_t reservedSpace0:12;
      uint64_t CKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BACR;

