iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define DMC (*(volatile struct DMC_tag *) 0x88000400)

struct DVP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPEN:1;
      uint64_t CAPMD:1;
      uint64_t CROPEN:1;
      uint64_t JPEGEN:1;
      uint64_t SWSYNC:1;
      uint64_t PIXCKSEL:1;
      uint64_t HSYNCSEL:1;
      uint64_t VSYNCSEL:1;
      uint64_t CAPFRC:2;
      uint64_t BITSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t DVPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  uint32_t DTR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSF:1;
      uint64_t LSF:1;
      uint64_t LEF:1;
      uint64_t FEF:1;
      uint64_t SQUERF:1;
      uint64_t FIFOERF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSIEN:1;
      uint64_t LSIEN:1;
      uint64_t LEIEN:1;
      uint64_t FEIEN:1;
      uint64_t SQUERIEN:1;
      uint64_t FIFOERIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  uint32_t DMR;
  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSDAT:8;
      uint64_t LSDAT:8;
      uint64_t LEDAT:8;
      uint64_t FEDAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSYNDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSMSK:8;
      uint64_t LSMSK:8;
      uint64_t LEMSK:8;
      uint64_t FEMSK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSYNMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSHIFT:14;
      uint64_t reservedSpace0:2;
      uint64_t CSHIFT:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSFTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSIZE:14;
      uint64_t reservedSpace0:2;
      uint64_t CSIZE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSZER;

};

#define DVP (*(volatile struct DVP_tag *) 0x40055800)

struct EFM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAPRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FAPRT;

  uint32_t KEY1;
  uint32_t KEY2;
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0STP:1;
      uint64_t F1STP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSTP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLWT:4;
      uint64_t reservedSpace0:4;
      uint64_t LVM:1;
      uint64_t reservedSpace1:7;
      uint64_t ICACHE:1;
      uint64_t DCACHE:1;
      uint64_t PREFETE:1;
      uint64_t CRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEMOD:3;
      uint64_t reservedSpace0:5;
      uint64_t BUSHLDCTL:1;
      uint64_t reservedSpace1:7;
      uint64_t KEY1LOCK:1;
      uint64_t KEY2LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPWERR0:1;
      uint64_t PRTWERR0:1;
      uint64_t PGSZERR0:1;
      uint64_t MISMTCH0:1;
      uint64_t OPTEND0:1;
      uint64_t COLERR0:1;
      uint64_t reservedSpace0:2;
      uint64_t RDY0:1;
      uint64_t reservedSpace1:8;
      uint64_t PRTWERR1:1;
      uint64_t PGSZERR1:1;
      uint64_t MISMTCH1:1;
      uint64_t OPTEND1:1;
      uint64_t COLERR1:1;
      uint64_t reservedSpace2:2;
      uint64_t RDY1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPWERRCLR0:1;
      uint64_t PRTWERRCLR0:1;
      uint64_t PGSZERRCLR0:1;
      uint64_t MISMTCHCLR0:1;
      uint64_t OPTENDCLR0:1;
      uint64_t COLERRCLR0:1;
      uint64_t reservedSpace0:11;
      uint64_t PRTWERRCLR1:1;
      uint64_t PGSZERRCLR1:1;
      uint64_t MISMTCHCLR1:1;
      uint64_t OPTENDCLR1:1;
      uint64_t COLERRCLR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEERRITE:1;
      uint64_t OPTENDITE:1;
      uint64_t COLERRITE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FITE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSWP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSWP;

  uint8_t res1[16];

  uint32_t CHIPID;
  uint8_t res2[12];

  uint32_t UQID0;
  uint32_t UQID1;
  uint32_t UQID2;
  uint8_t res3[164];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MMF_REMPRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMF_REMPRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMSIZE:5;
      uint64_t reservedSpace0:7;
      uint64_t RMTADDR:17;
      uint64_t reservedSpace1:2;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMF_REMCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RMSIZE:5;
      uint64_t reservedSpace0:7;
      uint64_t RMTADDR:17;
      uint64_t reservedSpace1:2;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMF_REMCR1;

  uint8_t res4[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLOCK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WLOCK;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0NWPRT0:1;
      uint64_t F0NWPRT1:1;
      uint64_t F0NWPRT2:1;
      uint64_t F0NWPRT3:1;
      uint64_t F0NWPRT4:1;
      uint64_t F0NWPRT5:1;
      uint64_t F0NWPRT6:1;
      uint64_t F0NWPRT7:1;
      uint64_t F0NWPRT8:1;
      uint64_t F0NWPRT9:1;
      uint64_t F0NWPRT10:1;
      uint64_t F0NWPRT11:1;
      uint64_t F0NWPRT12:1;
      uint64_t F0NWPRT13:1;
      uint64_t F0NWPRT14:1;
      uint64_t F0NWPRT15:1;
      uint64_t F0NWPRT16:1;
      uint64_t F0NWPRT17:1;
      uint64_t F0NWPRT18:1;
      uint64_t F0NWPRT19:1;
      uint64_t F0NWPRT20:1;
      uint64_t F0NWPRT21:1;
      uint64_t F0NWPRT22:1;
      uint64_t F0NWPRT23:1;
      uint64_t F0NWPRT24:1;
      uint64_t F0NWPRT25:1;
      uint64_t F0NWPRT26:1;
      uint64_t F0NWPRT27:1;
      uint64_t F0NWPRT28:1;
      uint64_t F0NWPRT29:1;
      uint64_t F0NWPRT30:1;
      uint64_t F0NWPRT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0NWPRT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0NWPRT32:1;
      uint64_t F0NWPRT33:1;
      uint64_t F0NWPRT34:1;
      uint64_t F0NWPRT35:1;
      uint64_t F0NWPRT36:1;
      uint64_t F0NWPRT37:1;
      uint64_t F0NWPRT38:1;
      uint64_t F0NWPRT39:1;
      uint64_t F0NWPRT40:1;
      uint64_t F0NWPRT41:1;
      uint64_t F0NWPRT42:1;
      uint64_t F0NWPRT43:1;
      uint64_t F0NWPRT44:1;
      uint64_t F0NWPRT45:1;
      uint64_t F0NWPRT46:1;
      uint64_t F0NWPRT47:1;
      uint64_t F0NWPRT48:1;
      uint64_t F0NWPRT49:1;
      uint64_t F0NWPRT50:1;
      uint64_t F0NWPRT51:1;
      uint64_t F0NWPRT52:1;
      uint64_t F0NWPRT53:1;
      uint64_t F0NWPRT54:1;
      uint64_t F0NWPRT55:1;
      uint64_t F0NWPRT56:1;
      uint64_t F0NWPRT57:1;
      uint64_t F0NWPRT58:1;
      uint64_t F0NWPRT59:1;
      uint64_t F0NWPRT60:1;
      uint64_t F0NWPRT61:1;
      uint64_t F0NWPRT62:1;
      uint64_t F0NWPRT63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0NWPRT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0NWPRT64:1;
      uint64_t F0NWPRT65:1;
      uint64_t F0NWPRT66:1;
      uint64_t F0NWPRT67:1;
      uint64_t F0NWPRT68:1;
      uint64_t F0NWPRT69:1;
      uint64_t F0NWPRT70:1;
      uint64_t F0NWPRT71:1;
      uint64_t F0NWPRT72:1;
      uint64_t F0NWPRT73:1;
      uint64_t F0NWPRT74:1;
      uint64_t F0NWPRT75:1;
      uint64_t F0NWPRT76:1;
      uint64_t F0NWPRT77:1;
      uint64_t F0NWPRT78:1;
      uint64_t F0NWPRT79:1;
      uint64_t F0NWPRT80:1;
      uint64_t F0NWPRT81:1;
      uint64_t F0NWPRT82:1;
      uint64_t F0NWPRT83:1;
      uint64_t F0NWPRT84:1;
      uint64_t F0NWPRT85:1;
      uint64_t F0NWPRT86:1;
      uint64_t F0NWPRT87:1;
      uint64_t F0NWPRT88:1;
      uint64_t F0NWPRT89:1;
      uint64_t F0NWPRT90:1;
      uint64_t F0NWPRT91:1;
      uint64_t F0NWPRT92:1;
      uint64_t F0NWPRT93:1;
      uint64_t F0NWPRT94:1;
      uint64_t F0NWPRT95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0NWPRT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0NWPRT96:1;
      uint64_t F0NWPRT97:1;
      uint64_t F0NWPRT98:1;
      uint64_t F0NWPRT99:1;
      uint64_t F0NWPRT100:1;
      uint64_t F0NWPRT101:1;
      uint64_t F0NWPRT102:1;
      uint64_t F0NWPRT103:1;
      uint64_t F0NWPRT104:1;
      uint64_t F0NWPRT105:1;
      uint64_t F0NWPRT106:1;
      uint64_t F0NWPRT107:1;
      uint64_t F0NWPRT108:1;
      uint64_t F0NWPRT109:1;
      uint64_t F0NWPRT110:1;
      uint64_t F0NWPRT111:1;
      uint64_t F0NWPRT112:1;
      uint64_t F0NWPRT113:1;
      uint64_t F0NWPRT114:1;
      uint64_t F0NWPRT115:1;
      uint64_t F0NWPRT116:1;
      uint64_t F0NWPRT117:1;
      uint64_t F0NWPRT118:1;
      uint64_t F0NWPRT119:1;
      uint64_t F0NWPRT120:1;
      uint64_t F0NWPRT121:1;
      uint64_t F0NWPRT122:1;
      uint64_t F0NWPRT123:1;
      uint64_t F0NWPRT124:1;
      uint64_t F0NWPRT125:1;
      uint64_t F0NWPRT126:1;
      uint64_t F0NWPRT127:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F0NWPRT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1NWPRT0:1;
      uint64_t F1NWPRT1:1;
      uint64_t F1NWPRT2:1;
      uint64_t F1NWPRT3:1;
      uint64_t F1NWPRT4:1;
      uint64_t F1NWPRT5:1;
      uint64_t F1NWPRT6:1;
      uint64_t F1NWPRT7:1;
      uint64_t F1NWPRT8:1;
      uint64_t F1NWPRT9:1;
      uint64_t F1NWPRT10:1;
      uint64_t F1NWPRT11:1;
      uint64_t F1NWPRT12:1;
      uint64_t F1NWPRT13:1;
      uint64_t F1NWPRT14:1;
      uint64_t F1NWPRT15:1;
      uint64_t F1NWPRT16:1;
      uint64_t F1NWPRT17:1;
      uint64_t F1NWPRT18:1;
      uint64_t F1NWPRT19:1;
      uint64_t F1NWPRT20:1;
      uint64_t F1NWPRT21:1;
      uint64_t F1NWPRT22:1;
      uint64_t F1NWPRT23:1;
      uint64_t F1NWPRT24:1;
      uint64_t F1NWPRT25:1;
      uint64_t F1NWPRT26:1;
      uint64_t F1NWPRT27:1;
      uint64_t F1NWPRT28:1;
      uint64_t F1NWPRT29:1;
      uint64_t F1NWPRT30:1;
      uint64_t F1NWPRT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1NWPRT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1NWPRT32:1;
      uint64_t F1NWPRT33:1;
      uint64_t F1NWPRT34:1;
      uint64_t F1NWPRT35:1;
      uint64_t F1NWPRT36:1;
      uint64_t F1NWPRT37:1;
      uint64_t F1NWPRT38:1;
      uint64_t F1NWPRT39:1;
      uint64_t F1NWPRT40:1;
      uint64_t F1NWPRT41:1;
      uint64_t F1NWPRT42:1;
      uint64_t F1NWPRT43:1;
      uint64_t F1NWPRT44:1;
      uint64_t F1NWPRT45:1;
      uint64_t F1NWPRT46:1;
      uint64_t F1NWPRT47:1;
      uint64_t F1NWPRT48:1;
      uint64_t F1NWPRT49:1;
      uint64_t F1NWPRT50:1;
      uint64_t F1NWPRT51:1;
      uint64_t F1NWPRT52:1;
      uint64_t F1NWPRT53:1;
      uint64_t F1NWPRT54:1;
      uint64_t F1NWPRT55:1;
      uint64_t F1NWPRT56:1;
      uint64_t F1NWPRT57:1;
      uint64_t F1NWPRT58:1;
      uint64_t F1NWPRT59:1;
      uint64_t F1NWPRT60:1;
      uint64_t F1NWPRT61:1;
      uint64_t F1NWPRT62:1;
      uint64_t F1NWPRT63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1NWPRT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1NWPRT64:1;
      uint64_t F1NWPRT65:1;
      uint64_t F1NWPRT66:1;
      uint64_t F1NWPRT67:1;
      uint64_t F1NWPRT68:1;
      uint64_t F1NWPRT69:1;
      uint64_t F1NWPRT70:1;
      uint64_t F1NWPRT71:1;
      uint64_t F1NWPRT72:1;
      uint64_t F1NWPRT73:1;
      uint64_t F1NWPRT74:1;
      uint64_t F1NWPRT75:1;
      uint64_t F1NWPRT76:1;
      uint64_t F1NWPRT77:1;
      uint64_t F1NWPRT78:1;
      uint64_t F1NWPRT79:1;
      uint64_t F1NWPRT80:1;
      uint64_t F1NWPRT81:1;
      uint64_t F1NWPRT82:1;
      uint64_t F1NWPRT83:1;
      uint64_t F1NWPRT84:1;
      uint64_t F1NWPRT85:1;
      uint64_t F1NWPRT86:1;
      uint64_t F1NWPRT87:1;
      uint64_t F1NWPRT88:1;
      uint64_t F1NWPRT89:1;
      uint64_t F1NWPRT90:1;
      uint64_t F1NWPRT91:1;
      uint64_t F1NWPRT92:1;
      uint64_t F1NWPRT93:1;
      uint64_t F1NWPRT94:1;
      uint64_t F1NWPRT95:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1NWPRT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F1NWPRT96:1;
      uint64_t F1NWPRT97:1;
      uint64_t F1NWPRT98:1;
      uint64_t F1NWPRT99:1;
      uint64_t F1NWPRT100:1;
      uint64_t F1NWPRT101:1;
      uint64_t F1NWPRT102:1;
      uint64_t F1NWPRT103:1;
      uint64_t F1NWPRT104:1;
      uint64_t F1NWPRT105:1;
      uint64_t F1NWPRT106:1;
      uint64_t F1NWPRT107:1;
      uint64_t F1NWPRT108:1;
      uint64_t F1NWPRT109:1;
      uint64_t F1NWPRT110:1;
      uint64_t F1NWPRT111:1;
      uint64_t F1NWPRT112:1;
      uint64_t F1NWPRT113:1;
      uint64_t F1NWPRT114:1;
      uint64_t F1NWPRT115:1;
      uint64_t F1NWPRT116:1;
      uint64_t F1NWPRT117:1;
      uint64_t F1NWPRT118:1;
      uint64_t F1NWPRT119:1;
      uint64_t F1NWPRT120:1;
      uint64_t F1NWPRT121:1;
      uint64_t F1NWPRT122:1;
      uint64_t F1NWPRT123:1;
      uint64_t F1NWPRT124:1;
      uint64_t F1NWPRT125:1;
      uint64_t F1NWPRT126:1;
      uint64_t F1NWPRT127:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) F1NWPRT3;

