iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define EMB3 (*(volatile struct EMB3_tag *) 0x40017c60)

struct EMB4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:4;
      uint64_t OSCSTPEN:1;
      uint64_t PWMSEN:3;
      uint64_t reservedSpace0:8;
      uint64_t PORTINEN1:1;
      uint64_t PORTINEN2:1;
      uint64_t PORTINEN3:1;
      uint64_t PORTINEN4:1;
      uint64_t reservedSpace1:2;
      uint64_t INVSEL1:1;
      uint64_t INVSEL2:1;
      uint64_t INVSEL3:1;
      uint64_t INVSEL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMLV:3;
      uint64_t reservedSpace0:13;
      uint64_t NFSEL1:2;
      uint64_t NFEN1:1;
      uint64_t NFSEL2:2;
      uint64_t NFEN2:1;
      uint64_t NFSEL3:2;
      uint64_t NFEN3:1;
      uint64_t NFSEL4:2;
      uint64_t NFEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSF:1;
      uint64_t CMPF:1;
      uint64_t OSF:1;
      uint64_t reservedSpace1:1;
      uint64_t PWMST:1;
      uint64_t CMPST:1;
      uint64_t OSST:1;
      uint64_t PORTINF1:1;
      uint64_t PORTINF2:1;
      uint64_t PORTINF3:1;
      uint64_t PORTINF4:1;
      uint64_t reservedSpace2:2;
      uint64_t PORTINST1:1;
      uint64_t PORTINST2:1;
      uint64_t PORTINST3:1;
      uint64_t PORTINST4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSFCLR:1;
      uint64_t CMPFCLR:1;
      uint64_t OSFCLR:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINFCLR1:1;
      uint64_t PORTINFCLR2:1;
      uint64_t PORTINFCLR3:1;
      uint64_t PORTINFCLR4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSINTEN:1;
      uint64_t CMPINTEN:1;
      uint64_t OSINTEN:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINTEN1:1;
      uint64_t PORTINTEN2:1;
      uint64_t PORTINTEN3:1;
      uint64_t PORTINTEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMRSEL:1;
      uint64_t CMPRSEL:1;
      uint64_t OSRSEL:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINRSEL1:1;
      uint64_t PORTINRSEL2:1;
      uint64_t PORTINRSEL3:1;
      uint64_t PORTINRSEL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLSSEL;

};

#define EMB4 (*(volatile struct EMB4_tag *) 0x40017c80)

struct EMB5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:4;
      uint64_t OSCSTPEN:1;
      uint64_t PWMSEN:3;
      uint64_t reservedSpace0:8;
      uint64_t PORTINEN1:1;
      uint64_t PORTINEN2:1;
      uint64_t PORTINEN3:1;
      uint64_t PORTINEN4:1;
      uint64_t reservedSpace1:2;
      uint64_t INVSEL1:1;
      uint64_t INVSEL2:1;
      uint64_t INVSEL3:1;
      uint64_t INVSEL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMLV:3;
      uint64_t reservedSpace0:13;
      uint64_t NFSEL1:2;
      uint64_t NFEN1:1;
      uint64_t NFSEL2:2;
      uint64_t NFEN2:1;
      uint64_t NFSEL3:2;
      uint64_t NFEN3:1;
      uint64_t NFSEL4:2;
      uint64_t NFEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSF:1;
      uint64_t CMPF:1;
      uint64_t OSF:1;
      uint64_t reservedSpace1:1;
      uint64_t PWMST:1;
      uint64_t CMPST:1;
      uint64_t OSST:1;
      uint64_t PORTINF1:1;
      uint64_t PORTINF2:1;
      uint64_t PORTINF3:1;
      uint64_t PORTINF4:1;
      uint64_t reservedSpace2:2;
      uint64_t PORTINST1:1;
      uint64_t PORTINST2:1;
      uint64_t PORTINST3:1;
      uint64_t PORTINST4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSFCLR:1;
      uint64_t CMPFCLR:1;
      uint64_t OSFCLR:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINFCLR1:1;
      uint64_t PORTINFCLR2:1;
      uint64_t PORTINFCLR3:1;
      uint64_t PORTINFCLR4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSINTEN:1;
      uint64_t CMPINTEN:1;
      uint64_t OSINTEN:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINTEN1:1;
      uint64_t PORTINTEN2:1;
      uint64_t PORTINTEN3:1;
      uint64_t PORTINTEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMRSEL:1;
      uint64_t CMPRSEL:1;
      uint64_t OSRSEL:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINRSEL1:1;
      uint64_t PORTINRSEL2:1;
      uint64_t PORTINRSEL3:1;
      uint64_t PORTINRSEL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLSSEL;

};

#define EMB5 (*(volatile struct EMB5_tag *) 0x40017ca0)

struct EMB6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPEN:4;
      uint64_t OSCSTPEN:1;
      uint64_t PWMSEN:3;
      uint64_t reservedSpace0:8;
      uint64_t PORTINEN1:1;
      uint64_t PORTINEN2:1;
      uint64_t PORTINEN3:1;
      uint64_t PORTINEN4:1;
      uint64_t reservedSpace1:2;
      uint64_t INVSEL1:1;
      uint64_t INVSEL2:1;
      uint64_t INVSEL3:1;
      uint64_t INVSEL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMLV:3;
      uint64_t reservedSpace0:13;
      uint64_t NFSEL1:2;
      uint64_t NFEN1:1;
      uint64_t NFSEL2:2;
      uint64_t NFEN2:1;
      uint64_t NFSEL3:2;
      uint64_t NFEN3:1;
      uint64_t NFSEL4:2;
      uint64_t NFEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSF:1;
      uint64_t CMPF:1;
      uint64_t OSF:1;
      uint64_t reservedSpace1:1;
      uint64_t PWMST:1;
      uint64_t CMPST:1;
      uint64_t OSST:1;
      uint64_t PORTINF1:1;
      uint64_t PORTINF2:1;
      uint64_t PORTINF3:1;
      uint64_t PORTINF4:1;
      uint64_t reservedSpace2:2;
      uint64_t PORTINST1:1;
      uint64_t PORTINST2:1;
      uint64_t PORTINST3:1;
      uint64_t PORTINST4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSFCLR:1;
      uint64_t CMPFCLR:1;
      uint64_t OSFCLR:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINFCLR1:1;
      uint64_t PORTINFCLR2:1;
      uint64_t PORTINFCLR3:1;
      uint64_t PORTINFCLR4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMSINTEN:1;
      uint64_t CMPINTEN:1;
      uint64_t OSINTEN:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINTEN1:1;
      uint64_t PORTINTEN2:1;
      uint64_t PORTINTEN3:1;
      uint64_t PORTINTEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PWMRSEL:1;
      uint64_t CMPRSEL:1;
      uint64_t OSRSEL:1;
      uint64_t reservedSpace1:4;
      uint64_t PORTINRSEL1:1;
      uint64_t PORTINRSEL2:1;
      uint64_t PORTINRSEL3:1;
      uint64_t PORTINRSEL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLSSEL;

