iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define EMB6 (*(volatile struct EMB6_tag *) 0x40017cc0)

struct ETH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFSEL:1;
      uint64_t reservedSpace0:3;
      uint64_t RCKINV:1;
      uint64_t TCKINV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_IFCONFR;

  uint8_t res0[44012];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t DC:1;
      uint64_t BL:2;
      uint64_t ACS:1;
      uint64_t reservedSpace1:1;
      uint64_t DRTY:1;
      uint64_t IPCO:1;
      uint64_t DM:1;
      uint64_t LM:1;
      uint64_t DO:1;
      uint64_t FES:1;
      uint64_t reservedSpace2:1;
      uint64_t DCRS:1;
      uint64_t IFG:3;
      uint64_t reservedSpace3:2;
      uint64_t MJB:1;
      uint64_t MWD:1;
      uint64_t reservedSpace4:1;
      uint64_t CST:1;
      uint64_t reservedSpace5:2;
      uint64_t SAIRC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_CONFIGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:1;
      uint64_t HUC:1;
      uint64_t HMC:1;
      uint64_t DAIF:1;
      uint64_t PMF:1;
      uint64_t DBF:1;
      uint64_t PCF:2;
      uint64_t SAIF:1;
      uint64_t SAF:1;
      uint64_t HPF:1;
      uint64_t reservedSpace0:5;
      uint64_t VTFE:1;
      uint64_t reservedSpace1:3;
      uint64_t IPFE:1;
      uint64_t DNTU:1;
      uint64_t reservedSpace2:9;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FLTCTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HASHTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_HASHTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMIB:1;
      uint64_t SMIW:1;
      uint64_t SMIC:4;
      uint64_t SMIR:5;
      uint64_t SMIA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SMIADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_SMIDATR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCA_BPA:1;
      uint64_t TFE:1;
      uint64_t RFE:1;
      uint64_t UNP:1;
      uint64_t PLT:2;
      uint64_t reservedSpace0:1;
      uint64_t DZPQ:1;
      uint64_t reservedSpace1:8;
      uint64_t PAUSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FLOCTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLFLT:16;
      uint64_t VTAL:1;
      uint64_t VTIM:1;
      uint64_t reservedSpace0:1;
      uint64_t VTHM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VTAFLTR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MREA:1;
      uint64_t MRS:2;
      uint64_t reservedSpace0:1;
      uint64_t RFWA:1;
      uint64_t RFRS:2;
      uint64_t reservedSpace1:1;
      uint64_t RFFL:2;
      uint64_t reservedSpace2:6;
      uint64_t MTEA:1;
      uint64_t MTS:2;
      uint64_t MTP:1;
      uint64_t TFRS:2;
      uint64_t TFWA:1;
      uint64_t reservedSpace3:1;
      uint64_t TFNE:1;
      uint64_t TFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPFRMFT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_RTWKFFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t MPEN:1;
      uint64_t WKEN:1;
      uint64_t reservedSpace0:2;
      uint64_t MPFR:1;
      uint64_t WKFR:1;
      uint64_t reservedSpace1:2;
      uint64_t GLUB:1;
      uint64_t RTWKTR:1;
      uint64_t reservedSpace2:13;
      uint64_t RTWKPT:3;
      uint64_t reservedSpace3:4;
      uint64_t RTWKFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_PMTCTLR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTIS:1;
      uint64_t MMCIS:1;
      uint64_t MMCRXIS:1;
      uint64_t MMCTXIS:1;
      uint64_t reservedSpace1:2;
      uint64_t TSPIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TSPIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_INTMSKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRH0:16;
      uint64_t reservedSpace0:15;
      uint64_t AE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADHR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRL0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRH1:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC1:6;
      uint64_t SA1:1;
      uint64_t AE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADHR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRL1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRH2:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC2:6;
      uint64_t SA2:1;
      uint64_t AE2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADHR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRL2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRH3:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC3:6;
      uint64_t SA3:1;
      uint64_t AE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADHR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRL3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADLR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRH4:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC4:6;
      uint64_t SA4:1;
      uint64_t AE4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADHR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRL4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_MACADLR4;

