iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res3[152];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRST:1;
      uint64_t COS:1;
      uint64_t ROR:1;
      uint64_t MCF:1;
      uint64_t MCPSET:1;
      uint64_t MCPSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_MMCCTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t RXBGIS:1;
      uint64_t RXMGIS:1;
      uint64_t RXCEIS:1;
      uint64_t RXAEIS:1;
      uint64_t RXREIS:1;
      uint64_t reservedSpace1:9;
      uint64_t RXUGIS:1;
      uint64_t RXLEIS:1;
      uint64_t RXOEIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_REVSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TXBGIS:1;
      uint64_t TXMGIS:1;
      uint64_t reservedSpace1:12;
      uint64_t TXDEEIS:1;
      uint64_t TXLCEIS:1;
      uint64_t TXECEIS:1;
      uint64_t TXCAEIS:1;
      uint64_t reservedSpace2:1;
      uint64_t TXUGIS:1;
      uint64_t TXEDEIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TRSSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t RXBGIM:1;
      uint64_t RXMGIM:1;
      uint64_t RXCEIM:1;
      uint64_t RXAEIM:1;
      uint64_t RXREIM:1;
      uint64_t reservedSpace1:9;
      uint64_t RXUGIM:1;
      uint64_t RXLEIM:1;
      uint64_t RXOEIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RITCTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TXBGIM:1;
      uint64_t TXMGIM:1;
      uint64_t reservedSpace1:12;
      uint64_t TXDEEIM:1;
      uint64_t TXLCEIM:1;
      uint64_t TXECEIM:1;
      uint64_t TXCAEIM:1;
      uint64_t reservedSpace2:1;
      uint64_t TXUGIM:1;
      uint64_t TXEDEIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TITCTLR;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBRGCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXBRGFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMUGCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXMUGFR;

  uint8_t res5[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDEECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXDEEFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLCECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXLCEFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXECECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXECEFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCAECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXCAEFR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNGCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXUNGFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXEDECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TXEDEFR;

  uint8_t res7[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBRGCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXBRGFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMUGCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXMUGFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCRECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXCREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXALECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXALEFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRUECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXRUEFR;

  uint8_t res8[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUNGCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXUNGFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLEECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXLEEFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXORECNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RXOREFR;

  uint8_t res9[560];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3PEN:1;
      uint64_t reservedSpace0:1;
      uint64_t L3SAM:1;
      uint64_t L3SAIM:1;
      uint64_t L3DAM:1;
      uint64_t L3DAIM:1;
      uint64_t L3HSBM:5;
      uint64_t L3HDBM:5;
      uint64_t L4PEN:1;
      uint64_t reservedSpace1:1;
      uint64_t L4SPM:1;
      uint64_t L4SPIM:1;
      uint64_t L4DPM:1;
      uint64_t L4DPIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_L34CTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L4SPVAL:16;
      uint64_t L4DPVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_L4PORTR;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3ADDR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_L3ADDRR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3ADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_L3ADDRR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3ADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_L3ADDRR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t L3ADDR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_L3ADDRR3;

  uint8_t res11[356];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLANV:16;
      uint64_t VLANC:2;
      uint64_t VLANS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VTACTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLHT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_VLAHTBR;

