iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res12[372];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPEN:1;
      uint64_t TSPUPSEL:1;
      uint64_t TSPINI:1;
      uint64_t TSPUP:1;
      uint64_t TSPINT:1;
      uint64_t TSPADUP:1;
      uint64_t reservedSpace0:2;
      uint64_t TSPEALL:1;
      uint64_t TSPSSR:1;
      uint64_t TSPVER:1;
      uint64_t TSPOVETH:1;
      uint64_t TSPOVIPV6:1;
      uint64_t TSPOVIPV4:1;
      uint64_t TSPMTSEL:4;
      uint64_t TSPADF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSPCTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPNSEADD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSPNSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPSYSSEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMSSECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPSYSNSEC:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMSNSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPUPSEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMUSECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPUPNSEC:31;
      uint64_t TSPUPNS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMUNSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSPADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPTAGSEC0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMTSECR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPTAGNSEC0:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMTNSER0;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSOVF:1;
      uint64_t TSTAR0:1;
      uint64_t reservedSpace0:1;
      uint64_t TSERR0:1;
      uint64_t TSTAR1:1;
      uint64_t TSERR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TSPSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPSFRE0:4;
      uint64_t PPSOMD:1;
      uint64_t TT0SEL:2;
      uint64_t reservedSpace0:1;
      uint64_t PPSFRE1:3;
      uint64_t reservedSpace1:2;
      uint64_t TT1SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_PPSCTLR;

  uint8_t res14[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPTAGSEC1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMTSECR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPTAGNSEC1:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTP_TMTNSER1;

  uint8_t res15[2168];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t DMAA:1;
      uint64_t DSL:5;
      uint64_t DSEN:1;
      uint64_t TPBL:6;
      uint64_t PRAT:2;
      uint64_t FBST:1;
      uint64_t RPBL:6;
      uint64_t SPBL:1;
      uint64_t M8PBL:1;
      uint64_t AAL:1;
      uint64_t MBST:1;
      uint64_t TXPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_BUSMODR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPOLL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TXPOLLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPOLL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_RXPOLLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDLAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_RXDLADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDLAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_TXDLADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIS:1;
      uint64_t TSS:1;
      uint64_t TUS:1;
      uint64_t TJS:1;
      uint64_t OVS:1;
      uint64_t UNS:1;
      uint64_t RIS:1;
      uint64_t RUS:1;
      uint64_t RSS:1;
      uint64_t RWS:1;
      uint64_t ETS:1;
      uint64_t reservedSpace0:2;
      uint64_t FBS:1;
      uint64_t ERS:1;
      uint64_t AIS:1;
      uint64_t NIS:1;
      uint64_t RSTS:3;
      uint64_t TSTS:3;
      uint64_t EBUS:3;
      uint64_t reservedSpace1:1;
      uint64_t MMCS:1;
      uint64_t PMTS:1;
      uint64_t PTPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_DMASTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t STR:1;
      uint64_t OSF:1;
      uint64_t RTC_bitfield:2;
      uint64_t DGF:1;
      uint64_t FUF:1;
      uint64_t FEF:1;
      uint64_t reservedSpace1:5;
      uint64_t STT:1;
      uint64_t TTC:3;
      uint64_t reservedSpace2:3;
      uint64_t FTF:1;
      uint64_t TSF:1;
      uint64_t reservedSpace3:2;
      uint64_t DFRF:1;
      uint64_t RSF:1;
      uint64_t DTCOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_OPRMODR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TSE:1;
      uint64_t TUE:1;
      uint64_t TJE:1;
      uint64_t OVE:1;
      uint64_t UNE:1;
      uint64_t RIE:1;
      uint64_t RUE:1;
      uint64_t RSE:1;
      uint64_t RWE:1;
      uint64_t ETE:1;
      uint64_t reservedSpace0:2;
      uint64_t FBE:1;
      uint64_t ERE:1;
      uint64_t AIE:1;
      uint64_t NIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_INTENAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNACNT:16;
      uint64_t UNAOVF:1;
      uint64_t OVFCNT:11;
      uint64_t OVFOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_RFRCNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_REVWDTR;

  uint8_t res16[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHTXDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHTXDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHRXDE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHRXDER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHTXBF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHTXBFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHRXBF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA_CHRXBFR;

