iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define ETH (*(volatile struct ETH_tag *) 0x40055410)

struct FCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UVR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDIVS:2;
      uint64_t reservedSpace0:2;
      uint64_t MCKS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDIVS:2;
      uint64_t reservedSpace0:1;
      uint64_t RCKS:4;
      uint64_t INEXS:1;
      uint64_t DNFS:2;
      uint64_t reservedSpace1:2;
      uint64_t EDGES:2;
      uint64_t reservedSpace2:1;
      uint64_t EXREFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIE:1;
      uint64_t MENDIE:1;
      uint64_t OVFIE:1;
      uint64_t reservedSpace0:1;
      uint64_t ERRINTRS:1;
      uint64_t reservedSpace1:2;
      uint64_t ERRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRF:1;
      uint64_t MENDF:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRFCLR:1;
      uint64_t MENDFCLR:1;
      uint64_t OVFCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

};

#define FCM (*(volatile struct FCM_tag *) 0x40048400)

struct FMAC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAGE_NUM:5;
      uint64_t reservedSpace0:3;
      uint64_t SHIFT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTR;

  uint32_t RTR0;
  uint32_t RTR1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR16;

};

#define FMAC1 (*(volatile struct FMAC1_tag *) 0x40058000)

struct FMAC2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAGE_NUM:5;
      uint64_t reservedSpace0:3;
      uint64_t SHIFT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTR;

  uint32_t RTR0;
  uint32_t RTR1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

