iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR16;

};

#define FMAC2 (*(volatile struct FMAC2_tag *) 0x40058400)

struct FMAC3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAGE_NUM:5;
      uint64_t reservedSpace0:3;
      uint64_t SHIFT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTR;

  uint32_t RTR0;
  uint32_t RTR1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR16;

};

#define FMAC3 (*(volatile struct FMAC3_tag *) 0x40058800)

struct FMAC4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAGE_NUM:5;
      uint64_t reservedSpace0:3;
      uint64_t SHIFT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTR;

  uint32_t RTR0;
  uint32_t RTR1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

