iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COR16;

};

#define FMAC4 (*(volatile struct FMAC4_tag *) 0x40058c00)

struct GPIO_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRA;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRA;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRB;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRB;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRC;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRC;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRD;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRD;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERD;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRD;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRD;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRD;

  uint8_t res7[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRE;

  uint8_t res8[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRE;

  uint8_t res9[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRF;

  uint8_t res10[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRF;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERF;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRF;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRF;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRF;

  uint8_t res11[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRG;

  uint8_t res12[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRG;

