iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRG;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
      uint64_t PIN14:1;
      uint64_t PIN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRH;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
      uint64_t POUT14:1;
      uint64_t POUT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
      uint64_t POUTE14:1;
      uint64_t POUTE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
      uint64_t POS14:1;
      uint64_t POS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
      uint64_t POR14:1;
      uint64_t POR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
      uint64_t POT14:1;
      uint64_t POT15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRH;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PIN00:1;
      uint64_t PIN01:1;
      uint64_t PIN02:1;
      uint64_t PIN03:1;
      uint64_t PIN04:1;
      uint64_t PIN05:1;
      uint64_t PIN06:1;
      uint64_t PIN07:1;
      uint64_t PIN08:1;
      uint64_t PIN09:1;
      uint64_t PIN10:1;
      uint64_t PIN11:1;
      uint64_t PIN12:1;
      uint64_t PIN13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PIDRI;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT00:1;
      uint64_t POUT01:1;
      uint64_t POUT02:1;
      uint64_t POUT03:1;
      uint64_t POUT04:1;
      uint64_t POUT05:1;
      uint64_t POUT06:1;
      uint64_t POUT07:1;
      uint64_t POUT08:1;
      uint64_t POUT09:1;
      uint64_t POUT10:1;
      uint64_t POUT11:1;
      uint64_t POUT12:1;
      uint64_t POUT13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PODRI;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUTE00:1;
      uint64_t POUTE01:1;
      uint64_t POUTE02:1;
      uint64_t POUTE03:1;
      uint64_t POUTE04:1;
      uint64_t POUTE05:1;
      uint64_t POUTE06:1;
      uint64_t POUTE07:1;
      uint64_t POUTE08:1;
      uint64_t POUTE09:1;
      uint64_t POUTE10:1;
      uint64_t POUTE11:1;
      uint64_t POUTE12:1;
      uint64_t POUTE13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POERI;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POS00:1;
      uint64_t POS01:1;
      uint64_t POS02:1;
      uint64_t POS03:1;
      uint64_t POS04:1;
      uint64_t POS05:1;
      uint64_t POS06:1;
      uint64_t POS07:1;
      uint64_t POS08:1;
      uint64_t POS09:1;
      uint64_t POS10:1;
      uint64_t POS11:1;
      uint64_t POS12:1;
      uint64_t POS13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POSRI;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POR00:1;
      uint64_t POR01:1;
      uint64_t POR02:1;
      uint64_t POR03:1;
      uint64_t POR04:1;
      uint64_t POR05:1;
      uint64_t POR06:1;
      uint64_t POR07:1;
      uint64_t POR08:1;
      uint64_t POR09:1;
      uint64_t POR10:1;
      uint64_t POR11:1;
      uint64_t POR12:1;
      uint64_t POR13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PORRI;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POT00:1;
      uint64_t POT01:1;
      uint64_t POT02:1;
      uint64_t POT03:1;
      uint64_t POT04:1;
      uint64_t POT05:1;
      uint64_t POT06:1;
      uint64_t POT07:1;
      uint64_t POT08:1;
      uint64_t POT09:1;
      uint64_t POT10:1;
      uint64_t POT11:1;
      uint64_t POT12:1;
      uint64_t POT13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POTRI;

