iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res17[870];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPFE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PSPCR;

  uint8_t res18[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BFSEL:6;
      uint64_t reservedSpace0:6;
      uint64_t RDWT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCCR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PINAE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PINAER;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WE:1;
      uint64_t reservedSpace0:7;
      uint64_t WP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWPR;

  uint8_t res19[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRA15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRA15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRB15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRB15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC0;

