iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRC15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRC15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRD15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRD15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRE0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRE0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRE1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRE1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRE2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRE2;

