iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRG15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRG15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRH15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRH15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI6;

