iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t POUT:1;
      uint64_t POUTE:1;
      uint64_t NOD:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV:2;
      uint64_t PUU:1;
      uint64_t reservedSpace1:1;
      uint64_t PIN:1;
      uint64_t INVE:1;
      uint64_t CINSEL:1;
      uint64_t reservedSpace2:1;
      uint64_t INTE:1;
      uint64_t reservedSpace3:1;
      uint64_t LTE:1;
      uint64_t DDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCRI13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSEL:6;
      uint64_t reservedSpace0:2;
      uint64_t BFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PFSRI13;

};

#define GPIO (*(volatile struct GPIO_tag *) 0x40053800)

struct HASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t FST_GRP:1;
      uint64_t KMSG_END:1;
      uint64_t reservedSpace0:1;
      uint64_t MODE:2;
      uint64_t LKEY:1;
      uint64_t reservedSpace1:1;
      uint64_t BUSY:1;
      uint64_t CYC_END:1;
      uint64_t HMAC_END:1;
      uint64_t reservedSpace2:3;
      uint64_t HCIE:1;
      uint64_t HEIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  uint8_t res0[12];

  uint32_t HR7;
  uint32_t HR6;
  uint32_t HR5;
  uint32_t HR4;
  uint32_t HR3;
  uint32_t HR2;
  uint32_t HR1;
  uint32_t HR0;
  uint8_t res1[16];

  uint32_t DR15;
  uint32_t DR14;
  uint32_t DR13;
  uint32_t DR12;
  uint32_t DR11;
  uint32_t DR10;
  uint32_t DR9;
  uint32_t DR8;
  uint32_t DR7;
  uint32_t DR6;
  uint32_t DR5;
  uint32_t DR4;
  uint32_t DR3;
  uint32_t DR2;
  uint32_t DR1;
  uint32_t DR0;
};

#define HASH (*(volatile struct HASH_tag *) 0x40008400)

struct HRPWM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSEL:8;
      uint64_t PSEL:8;
      uint64_t reservedSpace0:13;
      uint64_t NE:1;
      uint64_t PE:1;
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR16;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALCODE:8;
      uint64_t reservedSpace0:4;
      uint64_t ENDF:1;
      uint64_t reservedSpace1:2;
      uint64_t CALEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALCODE:8;
      uint64_t reservedSpace0:4;
      uint64_t ENDF:1;
      uint64_t reservedSpace1:2;
      uint64_t CALEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALCR1;

