iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define I2C2 (*(volatile struct I2C2_tag *) 0x4004e400)

struct I2C3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t SMBUS:1;
      uint64_t SMBALRTEN:1;
      uint64_t SMBDEFAULTEN:1;
      uint64_t SMBHOSTEN:1;
      uint64_t reservedSpace0:1;
      uint64_t GCEN:1;
      uint64_t RESTART:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:4;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTIE:1;
      uint64_t SLADDR0IE:1;
      uint64_t SLADDR1IE:1;
      uint64_t TENDIE:1;
      uint64_t STOPIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RFULLIE:1;
      uint64_t TEMPTYIE:1;
      uint64_t reservedSpace1:1;
      uint64_t ARLOIE:1;
      uint64_t reservedSpace2:2;
      uint64_t NACKIE:1;
      uint64_t reservedSpace3:1;
      uint64_t TMOUTIE:1;
      uint64_t reservedSpace4:5;
      uint64_t GENCALLIE:1;
      uint64_t SMBDEFAULTIE:1;
      uint64_t SMBHOSTIE:1;
      uint64_t SMBALRTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMOUTEN:1;
      uint64_t LTMOUT:1;
      uint64_t HTMOUT:1;
      uint64_t reservedSpace0:4;
      uint64_t FACKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t BUSWAIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLADDR0:10;
      uint64_t reservedSpace0:2;
      uint64_t SLADDR0EN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADDRMOD0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLADDR1:10;
      uint64_t reservedSpace0:2;
      uint64_t SLADDR1EN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADDRMOD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUTLOW:16;
      uint64_t TOUTHIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTF:1;
      uint64_t SLADDR0F:1;
      uint64_t SLADDR1F:1;
      uint64_t TENDF:1;
      uint64_t STOPF:1;
      uint64_t reservedSpace0:1;
      uint64_t RFULLF:1;
      uint64_t TEMPTYF:1;
      uint64_t reservedSpace1:1;
      uint64_t ARLOF:1;
      uint64_t ACKRF:1;
      uint64_t reservedSpace2:1;
      uint64_t NACKF:1;
      uint64_t reservedSpace3:1;
      uint64_t TMOUTF:1;
      uint64_t reservedSpace4:1;
      uint64_t MSL:1;
      uint64_t BUSY:1;
      uint64_t TRA:1;
      uint64_t reservedSpace5:1;
      uint64_t GENCALLF:1;
      uint64_t SMBDEFAULTF:1;
      uint64_t SMBHOSTF:1;
      uint64_t SMBALRTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTFCLR:1;
      uint64_t SLADDR0FCLR:1;
      uint64_t SLADDR1FCLR:1;
      uint64_t TENDFCLR:1;
      uint64_t STOPFCLR:1;
      uint64_t reservedSpace0:1;
      uint64_t RFULLFCLR:1;
      uint64_t TEMPTYFCLR:1;
      uint64_t reservedSpace1:1;
      uint64_t ARLOFCLR:1;
      uint64_t reservedSpace2:2;
      uint64_t NACKFCLR:1;
      uint64_t reservedSpace3:1;
      uint64_t TMOUTFCLR:1;
      uint64_t reservedSpace4:5;
      uint64_t GENCALLFCLR:1;
      uint64_t SMBDEFAULTFCLR:1;
      uint64_t SMBHOSTFCLR:1;
      uint64_t SMBALRTFCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DTR;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DRR;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOWW:5;
      uint64_t reservedSpace0:3;
      uint64_t SHIGHW:5;
      uint64_t reservedSpace1:3;
      uint64_t FREQ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNF:2;
      uint64_t reservedSpace0:2;
      uint64_t DNFEN:1;
      uint64_t ANFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLTR;

};

#define I2C3 (*(volatile struct I2C3_tag *) 0x4004e800)

struct I2C4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t SMBUS:1;
      uint64_t SMBALRTEN:1;
      uint64_t SMBDEFAULTEN:1;
      uint64_t SMBHOSTEN:1;
      uint64_t reservedSpace0:1;
      uint64_t GCEN:1;
      uint64_t RESTART:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACK:1;
      uint64_t reservedSpace1:4;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTIE:1;
      uint64_t SLADDR0IE:1;
      uint64_t SLADDR1IE:1;
      uint64_t TENDIE:1;
      uint64_t STOPIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RFULLIE:1;
      uint64_t TEMPTYIE:1;
      uint64_t reservedSpace1:1;
      uint64_t ARLOIE:1;
      uint64_t reservedSpace2:2;
      uint64_t NACKIE:1;
      uint64_t reservedSpace3:1;
      uint64_t TMOUTIE:1;
      uint64_t reservedSpace4:5;
      uint64_t GENCALLIE:1;
      uint64_t SMBDEFAULTIE:1;
      uint64_t SMBHOSTIE:1;
      uint64_t SMBALRTIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMOUTEN:1;
      uint64_t LTMOUT:1;
      uint64_t HTMOUT:1;
      uint64_t reservedSpace0:4;
      uint64_t FACKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t BUSWAIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLADDR0:10;
      uint64_t reservedSpace0:2;
      uint64_t SLADDR0EN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADDRMOD0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLADDR1:10;
      uint64_t reservedSpace0:2;
      uint64_t SLADDR1EN:1;
      uint64_t reservedSpace1:2;
      uint64_t ADDRMOD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOUTLOW:16;
      uint64_t TOUTHIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTF:1;
      uint64_t SLADDR0F:1;
      uint64_t SLADDR1F:1;
      uint64_t TENDF:1;
      uint64_t STOPF:1;
      uint64_t reservedSpace0:1;
      uint64_t RFULLF:1;
      uint64_t TEMPTYF:1;
      uint64_t reservedSpace1:1;
      uint64_t ARLOF:1;
      uint64_t ACKRF:1;
      uint64_t reservedSpace2:1;
      uint64_t NACKF:1;
      uint64_t reservedSpace3:1;
      uint64_t TMOUTF:1;
      uint64_t reservedSpace4:1;
      uint64_t MSL:1;
      uint64_t BUSY:1;
      uint64_t TRA:1;
      uint64_t reservedSpace5:1;
      uint64_t GENCALLF:1;
      uint64_t SMBDEFAULTF:1;
      uint64_t SMBHOSTF:1;
      uint64_t SMBALRTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTFCLR:1;
      uint64_t SLADDR0FCLR:1;
      uint64_t SLADDR1FCLR:1;
      uint64_t TENDFCLR:1;
      uint64_t STOPFCLR:1;
      uint64_t reservedSpace0:1;
      uint64_t RFULLFCLR:1;
      uint64_t TEMPTYFCLR:1;
      uint64_t reservedSpace1:1;
      uint64_t ARLOFCLR:1;
      uint64_t reservedSpace2:2;
      uint64_t NACKFCLR:1;
      uint64_t reservedSpace3:1;
      uint64_t TMOUTFCLR:1;
      uint64_t reservedSpace4:5;
      uint64_t GENCALLFCLR:1;
      uint64_t SMBDEFAULTFCLR:1;
      uint64_t SMBHOSTFCLR:1;
      uint64_t SMBALRTFCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DTR;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DRR;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOWW:5;
      uint64_t reservedSpace0:3;
      uint64_t SHIGHW:5;
      uint64_t reservedSpace1:3;
      uint64_t FREQ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DNF:2;
      uint64_t reservedSpace0:2;
      uint64_t DNFEN:1;
      uint64_t ANFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLTR;

