iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define I2C6 (*(volatile struct I2C6_tag *) 0x4004f400)

struct I2S1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXE:1;
      uint64_t TXIE:1;
      uint64_t RXE:1;
      uint64_t RXIE:1;
      uint64_t EIE:1;
      uint64_t WMS:1;
      uint64_t ODD:1;
      uint64_t MCKOE:1;
      uint64_t TXBIRQWL:3;
      uint64_t reservedSpace0:1;
      uint64_t RXBIRQWL:3;
      uint64_t reservedSpace1:1;
      uint64_t FIFOR:1;
      uint64_t CODECRC:1;
      uint64_t I2SPLLSEL:1;
      uint64_t SDOE:1;
      uint64_t LRCKOE:1;
      uint64_t CKOE:1;
      uint64_t DUPLEX:1;
      uint64_t CLKSEL:1;
      uint64_t SRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBA:1;
      uint64_t RXBA:1;
      uint64_t TXBE:1;
      uint64_t TXBF:1;
      uint64_t RXBE:1;
      uint64_t RXBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SSTD:2;
      uint64_t DATLEN:2;
      uint64_t CHLEN:1;
      uint64_t PCMSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  uint32_t TXBUF;
  uint32_t RXBUF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define I2S1 (*(volatile struct I2S1_tag *) 0x4001e000)

struct I2S2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXE:1;
      uint64_t TXIE:1;
      uint64_t RXE:1;
      uint64_t RXIE:1;
      uint64_t EIE:1;
      uint64_t WMS:1;
      uint64_t ODD:1;
      uint64_t MCKOE:1;
      uint64_t TXBIRQWL:3;
      uint64_t reservedSpace0:1;
      uint64_t RXBIRQWL:3;
      uint64_t reservedSpace1:1;
      uint64_t FIFOR:1;
      uint64_t CODECRC:1;
      uint64_t I2SPLLSEL:1;
      uint64_t SDOE:1;
      uint64_t LRCKOE:1;
      uint64_t CKOE:1;
      uint64_t DUPLEX:1;
      uint64_t CLKSEL:1;
      uint64_t SRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBA:1;
      uint64_t RXBA:1;
      uint64_t TXBE:1;
      uint64_t TXBF:1;
      uint64_t RXBE:1;
      uint64_t RXBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SSTD:2;
      uint64_t DATLEN:2;
      uint64_t CHLEN:1;
      uint64_t PCMSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  uint32_t TXBUF;
  uint32_t RXBUF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define I2S2 (*(volatile struct I2S2_tag *) 0x4001e400)

struct I2S3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXE:1;
      uint64_t TXIE:1;
      uint64_t RXE:1;
      uint64_t RXIE:1;
      uint64_t EIE:1;
      uint64_t WMS:1;
      uint64_t ODD:1;
      uint64_t MCKOE:1;
      uint64_t TXBIRQWL:3;
      uint64_t reservedSpace0:1;
      uint64_t RXBIRQWL:3;
      uint64_t reservedSpace1:1;
      uint64_t FIFOR:1;
      uint64_t CODECRC:1;
      uint64_t I2SPLLSEL:1;
      uint64_t SDOE:1;
      uint64_t LRCKOE:1;
      uint64_t CKOE:1;
      uint64_t DUPLEX:1;
      uint64_t CLKSEL:1;
      uint64_t SRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBA:1;
      uint64_t RXBA:1;
      uint64_t TXBE:1;
      uint64_t TXBF:1;
      uint64_t RXBE:1;
      uint64_t RXBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SSTD:2;
      uint64_t DATLEN:2;
      uint64_t CHLEN:1;
      uint64_t PCMSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  uint32_t TXBUF;
  uint32_t RXBUF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define I2S3 (*(volatile struct I2S3_tag *) 0x40022000)

struct I2S4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXE:1;
      uint64_t TXIE:1;
      uint64_t RXE:1;
      uint64_t RXIE:1;
      uint64_t EIE:1;
      uint64_t WMS:1;
      uint64_t ODD:1;
      uint64_t MCKOE:1;
      uint64_t TXBIRQWL:3;
      uint64_t reservedSpace0:1;
      uint64_t RXBIRQWL:3;
      uint64_t reservedSpace1:1;
      uint64_t FIFOR:1;
      uint64_t CODECRC:1;
      uint64_t I2SPLLSEL:1;
      uint64_t SDOE:1;
      uint64_t LRCKOE:1;
      uint64_t CKOE:1;
      uint64_t DUPLEX:1;
      uint64_t CLKSEL:1;
      uint64_t SRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBA:1;
      uint64_t RXBA:1;
      uint64_t TXBE:1;
      uint64_t TXBF:1;
      uint64_t RXBE:1;
      uint64_t RXBF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERR:1;
      uint64_t RXERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SSTD:2;
      uint64_t DATLEN:2;
      uint64_t CHLEN:1;
      uint64_t PCMSYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  uint32_t TXBUF;
  uint32_t RXBUF;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2SDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

