iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define I2S4 (*(volatile struct I2S4_tag *) 0x40022400)

struct ICG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWDTAUTS:1;
      uint64_t SWDTITS:1;
      uint64_t SWDTPERI:2;
      uint64_t SWDTCKS:4;
      uint64_t SWDTWDPT:4;
      uint64_t SWDTSLPOFF:1;
      uint64_t reservedSpace0:3;
      uint64_t WDTAUTS:1;
      uint64_t WDTITS:1;
      uint64_t WDTPERI:2;
      uint64_t WDTCKS:4;
      uint64_t WDTWDPT:4;
      uint64_t WDTSLPOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRCFREQSEL:1;
      uint64_t reservedSpace0:7;
      uint64_t HRCSTOP:1;
      uint64_t reservedSpace1:7;
      uint64_t BOR_LEV:2;
      uint64_t BORDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICG1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBUSPRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICG3;

};

#define ICG (*(volatile struct ICG_tag *) 0x400)

struct INTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t NOCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SWDTENR:1;
      uint64_t PVD1ENR:1;
      uint64_t PVD2ENR:1;
      uint64_t reservedSpace1:1;
      uint64_t XTALSTPENR:1;
      uint64_t reservedSpace2:2;
      uint64_t REPENR:1;
      uint64_t RECCENR:1;
      uint64_t BUSMENR:1;
      uint64_t WDTENR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SWDTFR:1;
      uint64_t PVD1FR:1;
      uint64_t PVD2FR:1;
      uint64_t reservedSpace1:1;
      uint64_t XTALSTPFR:1;
      uint64_t reservedSpace2:2;
      uint64_t REPFR:1;
      uint64_t RECCFR:1;
      uint64_t BUSMFR:1;
      uint64_t WDTFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SWDTCFR:1;
      uint64_t PVD1CFR:1;
      uint64_t PVD2CFR:1;
      uint64_t reservedSpace1:1;
      uint64_t XTALSTPCFR:1;
      uint64_t reservedSpace2:2;
      uint64_t REPCFR:1;
      uint64_t RECCCFR:1;
      uint64_t BUSMCFR:1;
      uint64_t WDTCFR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMICFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQTRG:2;
      uint64_t reservedSpace0:2;
      uint64_t EISMPCLK:2;
      uint64_t reservedSpace1:1;
      uint64_t EFEN:1;
      uint64_t reservedSpace2:7;
      uint64_t NOCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQWUEN:16;
      uint64_t SWDTWUEN:1;
      uint64_t PVD1WUEN:1;
      uint64_t PVD2WUEN:1;
      uint64_t CMPWUEN:1;
      uint64_t WKTMWUEN:1;
      uint64_t RTCALMWUEN:1;
      uint64_t RTCPRDWUEN:1;
      uint64_t TMR0GCMWUEN:1;
      uint64_t TMR2GCMWUEN:1;
      uint64_t TMR2OVFWUEN:1;
      uint64_t RXWUEN:1;
      uint64_t USHWUEN:1;
      uint64_t USFWUEN:1;
      uint64_t ETHWUEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUPEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQFR0:1;
      uint64_t EIRQFR1:1;
      uint64_t EIRQFR2:1;
      uint64_t EIRQFR3:1;
      uint64_t EIRQFR4:1;
      uint64_t EIRQFR5:1;
      uint64_t EIRQFR6:1;
      uint64_t EIRQFR7:1;
      uint64_t EIRQFR8:1;
      uint64_t EIRQFR9:1;
      uint64_t EIRQFR10:1;
      uint64_t EIRQFR11:1;
      uint64_t EIRQFR12:1;
      uint64_t EIRQFR13:1;
      uint64_t EIRQFR14:1;
      uint64_t EIRQFR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRQCFR0:1;
      uint64_t EIRQCFR1:1;
      uint64_t EIRQCFR2:1;
      uint64_t EIRQCFR3:1;
      uint64_t EIRQCFR4:1;
      uint64_t EIRQCFR5:1;
      uint64_t EIRQCFR6:1;
      uint64_t EIRQCFR7:1;
      uint64_t EIRQCFR8:1;
      uint64_t EIRQCFR9:1;
      uint64_t EIRQCFR10:1;
      uint64_t EIRQCFR11:1;
      uint64_t EIRQCFR12:1;
      uint64_t EIRQCFR13:1;
      uint64_t EIRQCFR14:1;
      uint64_t EIRQCFR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRQCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL102;

