iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEL127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL132;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL133;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL134;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL135;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL136;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL137;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL138;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL139;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL140;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL141;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL142;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSEL0:1;
      uint64_t VSEL1:1;
      uint64_t VSEL2:1;
      uint64_t VSEL3:1;
      uint64_t VSEL4:1;
      uint64_t VSEL5:1;
      uint64_t VSEL6:1;
      uint64_t VSEL7:1;
      uint64_t VSEL8:1;
      uint64_t VSEL9:1;
      uint64_t VSEL10:1;
      uint64_t VSEL11:1;
      uint64_t VSEL12:1;
      uint64_t VSEL13:1;
      uint64_t VSEL14:1;
      uint64_t VSEL15:1;
      uint64_t VSEL16:1;
      uint64_t VSEL17:1;
      uint64_t VSEL18:1;
      uint64_t VSEL19:1;
      uint64_t VSEL20:1;
      uint64_t VSEL21:1;
      uint64_t VSEL22:1;
      uint64_t VSEL23:1;
      uint64_t VSEL24:1;
      uint64_t VSEL25:1;
      uint64_t VSEL26:1;
      uint64_t VSEL27:1;
      uint64_t VSEL28:1;
      uint64_t VSEL29:1;
      uint64_t VSEL30:1;
      uint64_t VSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VSSEL143;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWIE0:1;
      uint64_t SWIE1:1;
      uint64_t SWIE2:1;
      uint64_t SWIE3:1;
      uint64_t SWIE4:1;
      uint64_t SWIE5:1;
      uint64_t SWIE6:1;
      uint64_t SWIE7:1;
      uint64_t SWIE8:1;
      uint64_t SWIE9:1;
      uint64_t SWIE10:1;
      uint64_t SWIE11:1;
      uint64_t SWIE12:1;
      uint64_t SWIE13:1;
      uint64_t SWIE14:1;
      uint64_t SWIE15:1;
      uint64_t SWIE16:1;
      uint64_t SWIE17:1;
      uint64_t SWIE18:1;
      uint64_t SWIE19:1;
      uint64_t SWIE20:1;
      uint64_t SWIE21:1;
      uint64_t SWIE22:1;
      uint64_t SWIE23:1;
      uint64_t SWIE24:1;
      uint64_t SWIE25:1;
      uint64_t SWIE26:1;
      uint64_t SWIE27:1;
      uint64_t SWIE28:1;
      uint64_t SWIE29:1;
      uint64_t SWIE30:1;
      uint64_t SWIE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVTE0:1;
      uint64_t EVTE1:1;
      uint64_t EVTE2:1;
      uint64_t EVTE3:1;
      uint64_t EVTE4:1;
      uint64_t EVTE5:1;
      uint64_t EVTE6:1;
      uint64_t EVTE7:1;
      uint64_t EVTE8:1;
      uint64_t EVTE9:1;
      uint64_t EVTE10:1;
      uint64_t EVTE11:1;
      uint64_t EVTE12:1;
      uint64_t EVTE13:1;
      uint64_t EVTE14:1;
      uint64_t EVTE15:1;
      uint64_t EVTE16:1;
      uint64_t EVTE17:1;
      uint64_t EVTE18:1;
      uint64_t EVTE19:1;
      uint64_t EVTE20:1;
      uint64_t EVTE21:1;
      uint64_t EVTE22:1;
      uint64_t EVTE23:1;
      uint64_t EVTE24:1;
      uint64_t EVTE25:1;
      uint64_t EVTE26:1;
      uint64_t EVTE27:1;
      uint64_t EVTE28:1;
      uint64_t EVTE29:1;
      uint64_t EVTE30:1;
      uint64_t EVTE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IER0:1;
      uint64_t IER1:1;
      uint64_t IER2:1;
      uint64_t IER3:1;
      uint64_t IER4:1;
      uint64_t IER5:1;
      uint64_t IER6:1;
      uint64_t IER7:1;
      uint64_t IER8:1;
      uint64_t IER9:1;
      uint64_t IER10:1;
      uint64_t IER11:1;
      uint64_t IER12:1;
      uint64_t IER13:1;
      uint64_t IER14:1;
      uint64_t IER15:1;
      uint64_t IER16:1;
      uint64_t IER17:1;
      uint64_t IER18:1;
      uint64_t IER19:1;
      uint64_t IER20:1;
      uint64_t IER21:1;
      uint64_t IER22:1;
      uint64_t IER23:1;
      uint64_t IER24:1;
      uint64_t IER25:1;
      uint64_t IER26:1;
      uint64_t IER27:1;
      uint64_t IER28:1;
      uint64_t IER29:1;
      uint64_t IER30:1;
      uint64_t IER31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

