iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define INTC (*(volatile struct INTC_tag *) 0x40051000)

struct KEYSCAN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYINSEL:16;
      uint64_t KEYOUTSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t CKSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t T_LLEVEL:5;
      uint64_t T_HIZ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSR;

};

#define KEYSCAN (*(volatile struct KEYSCAN_tag *) 0x40050c00)

struct MAU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t INTEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace1:4;
      uint64_t SHIFT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint32_t DTR0;
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQRT_DOUT:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIN_DIN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIN_DOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTR1;

};

#define MAU (*(volatile struct MAU_tag *) 0x40055000)

struct MPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPURGSIZE:5;
      uint64_t MPURGADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RGD15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPU1EAF:1;
      uint64_t SMPU2EAF:1;
      uint64_t FMPUEAF:1;
      uint64_t HMPUEAF:1;
      uint64_t EMPUEAF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPU1ECLR:1;
      uint64_t SMPU2ECLR:1;
      uint64_t FMPUECLR:1;
      uint64_t HMPUECLR:1;
      uint64_t EMPUECLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPUWE:1;
      uint64_t WKEY:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESRDP:1;
      uint64_t AESWRP:1;
      uint64_t HASHRDP:1;
      uint64_t HASHWRP:1;
      uint64_t TRNGRDP:1;
      uint64_t TRNGWRP:1;
      uint64_t CRCRDP:1;
      uint64_t CRCWRP:1;
      uint64_t FMCRDP:1;
      uint64_t FMCWRP:1;
      uint64_t reservedSpace0:2;
      uint64_t WDTRDP:1;
      uint64_t WDTWRP:1;
      uint64_t SWDTRDP:1;
      uint64_t SWDTWRP:1;
      uint64_t BKSRAMRDP:1;
      uint64_t BKSRAMWRP:1;
      uint64_t RTCRDP:1;
      uint64_t RTCWRP:1;
      uint64_t DMPURDP:1;
      uint64_t DMPUWRP:1;
      uint64_t SRAMCRDP:1;
      uint64_t SRAMCWRP:1;
      uint64_t INTCRDP:1;
      uint64_t INTCWRP:1;
      uint64_t SYSCRDP:1;
      uint64_t SYSCWRP:1;
      uint64_t MSTPRDP:1;
      uint64_t MSPTWRP:1;
      uint64_t reservedSpace1:1;
      uint64_t BUSERRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1RG0E:1;
      uint64_t S1RG1E:1;
      uint64_t S1RG2E:1;
      uint64_t S1RG3E:1;
      uint64_t S1RG4E:1;
      uint64_t S1RG5E:1;
      uint64_t S1RG6E:1;
      uint64_t S1RG7E:1;
      uint64_t S1RG8E:1;
      uint64_t S1RG9E:1;
      uint64_t S1RG10E:1;
      uint64_t S1RG11E:1;
      uint64_t S1RG12E:1;
      uint64_t S1RG13E:1;
      uint64_t S1RG14E:1;
      uint64_t S1RG15E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S1RGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1RG0WP:1;
      uint64_t S1RG1WP:1;
      uint64_t S1RG2WP:1;
      uint64_t S1RG3WP:1;
      uint64_t S1RG4WP:1;
      uint64_t S1RG5WP:1;
      uint64_t S1RG6WP:1;
      uint64_t S1RG7WP:1;
      uint64_t S1RG8WP:1;
      uint64_t S1RG9WP:1;
      uint64_t S1RG10WP:1;
      uint64_t S1RG11WP:1;
      uint64_t S1RG12WP:1;
      uint64_t S1RG13WP:1;
      uint64_t S1RG14WP:1;
      uint64_t S1RG15WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S1RGWP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1RG0RP:1;
      uint64_t S1RG1RP:1;
      uint64_t S1RG2RP:1;
      uint64_t S1RG3RP:1;
      uint64_t S1RG4RP:1;
      uint64_t S1RG5RP:1;
      uint64_t S1RG6RP:1;
      uint64_t S1RG7RP:1;
      uint64_t S1RG8RP:1;
      uint64_t S1RG9RP:1;
      uint64_t S1RG10RP:1;
      uint64_t S1RG11RP:1;
      uint64_t S1RG12RP:1;
      uint64_t S1RG13RP:1;
      uint64_t S1RG14RP:1;
      uint64_t S1RG15RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S1RGRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPU1BRP:1;
      uint64_t SMPU1BWP:1;
      uint64_t SMPU1ACT:2;
      uint64_t reservedSpace0:3;
      uint64_t SMPU1E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S2RG0E:1;
      uint64_t S2RG1E:1;
      uint64_t S2RG2E:1;
      uint64_t S2RG3E:1;
      uint64_t S2RG4E:1;
      uint64_t S2RG5E:1;
      uint64_t S2RG6E:1;
      uint64_t S2RG7E:1;
      uint64_t S2RG8E:1;
      uint64_t S2RG9E:1;
      uint64_t S2RG10E:1;
      uint64_t S2RG11E:1;
      uint64_t S2RG12E:1;
      uint64_t S2RG13E:1;
      uint64_t S2RG14E:1;
      uint64_t S2RG15E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S2RGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S2RG0WP:1;
      uint64_t S2RG1WP:1;
      uint64_t S2RG2WP:1;
      uint64_t S2RG3WP:1;
      uint64_t S2RG4WP:1;
      uint64_t S2RG5WP:1;
      uint64_t S2RG6WP:1;
      uint64_t S2RG7WP:1;
      uint64_t S2RG8WP:1;
      uint64_t S2RG9WP:1;
      uint64_t S2RG10WP:1;
      uint64_t S2RG11WP:1;
      uint64_t S2RG12WP:1;
      uint64_t S2RG13WP:1;
      uint64_t S2RG14WP:1;
      uint64_t S2RG15WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S2RGWP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S2RG0RP:1;
      uint64_t S2RG1RP:1;
      uint64_t S2RG2RP:1;
      uint64_t S2RG3RP:1;
      uint64_t S2RG4RP:1;
      uint64_t S2RG5RP:1;
      uint64_t S2RG6RP:1;
      uint64_t S2RG7RP:1;
      uint64_t S2RG8RP:1;
      uint64_t S2RG9RP:1;
      uint64_t S2RG10RP:1;
      uint64_t S2RG11RP:1;
      uint64_t S2RG12RP:1;
      uint64_t S2RG13RP:1;
      uint64_t S2RG14RP:1;
      uint64_t S2RG15RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S2RGRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPU2BRP:1;
      uint64_t SMPU2BWP:1;
      uint64_t SMPU2ACT:2;
      uint64_t reservedSpace0:3;
      uint64_t SMPU2E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) S2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRG0E:1;
      uint64_t FRG1E:1;
      uint64_t FRG2E:1;
      uint64_t FRG3E:1;
      uint64_t FRG4E:1;
      uint64_t FRG5E:1;
      uint64_t FRG6E:1;
      uint64_t FRG7E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRG0WP:1;
      uint64_t FRG1WP:1;
      uint64_t FRG2WP:1;
      uint64_t FRG3WP:1;
      uint64_t FRG4WP:1;
      uint64_t FRG5WP:1;
      uint64_t FRG6WP:1;
      uint64_t FRG7WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGWP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRG0RP:1;
      uint64_t FRG1RP:1;
      uint64_t FRG2RP:1;
      uint64_t FRG3RP:1;
      uint64_t FRG4RP:1;
      uint64_t FRG5RP:1;
      uint64_t FRG6RP:1;
      uint64_t FRG7RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRGRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMPUBRP:1;
      uint64_t FMPUBWP:1;
      uint64_t FMPUACT:2;
      uint64_t reservedSpace0:3;
      uint64_t FMPUE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRG0E:1;
      uint64_t HRG1E:1;
      uint64_t HRG2E:1;
      uint64_t HRG3E:1;
      uint64_t HRG4E:1;
      uint64_t HRG5E:1;
      uint64_t HRG6E:1;
      uint64_t HRG7E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRG0WP:1;
      uint64_t HRG1WP:1;
      uint64_t HRG2WP:1;
      uint64_t HRG3WP:1;
      uint64_t HRG4WP:1;
      uint64_t HRG5WP:1;
      uint64_t HRG6WP:1;
      uint64_t HRG7WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRGWP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRG0RP:1;
      uint64_t HRG1RP:1;
      uint64_t HRG2RP:1;
      uint64_t HRG3RP:1;
      uint64_t HRG4RP:1;
      uint64_t HRG5RP:1;
      uint64_t HRG6RP:1;
      uint64_t HRG7RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRGRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HMPUBRP:1;
      uint64_t HMPUBWP:1;
      uint64_t HMPUACT:2;
      uint64_t reservedSpace0:3;
      uint64_t HMPUE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERG0E:1;
      uint64_t ERG1E:1;
      uint64_t ERG2E:1;
      uint64_t ERG3E:1;
      uint64_t ERG4E:1;
      uint64_t ERG5E:1;
      uint64_t ERG6E:1;
      uint64_t ERG7E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERG0WP:1;
      uint64_t ERG1WP:1;
      uint64_t ERG2WP:1;
      uint64_t ERG3WP:1;
      uint64_t ERG4WP:1;
      uint64_t ERG5WP:1;
      uint64_t ERG6WP:1;
      uint64_t ERG7WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERGWP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERG0RP:1;
      uint64_t ERG1RP:1;
      uint64_t ERG2RP:1;
      uint64_t ERG3RP:1;
      uint64_t ERG4RP:1;
      uint64_t ERG5RP:1;
      uint64_t ERG6RP:1;
      uint64_t ERG7RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERGRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMPUBRP:1;
      uint64_t EMPUBWP:1;
      uint64_t EMPUACT:2;
      uint64_t reservedSpace0:3;
      uint64_t EMPUE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECR;

