iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define MPU (*(volatile struct MPU_tag *) 0x40050000)

struct NFC_tag
{
  uint32_t DATR_BASE;
  uint8_t res0[32764];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:8;
      uint64_t ARG:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDR;

  uint32_t IDXR0;
  uint8_t res1[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCEUEN:1;
      uint64_t ECCECEN:1;
      uint64_t reservedSpace0:2;
      uint64_t ECCCEN:1;
      uint64_t reservedSpace1:1;
      uint64_t ECCEEN:1;
      uint64_t ECCDIS:1;
      uint64_t RBEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCEUST:1;
      uint64_t ECCECST:1;
      uint64_t reservedSpace0:2;
      uint64_t ECCCST:1;
      uint64_t reservedSpace1:1;
      uint64_t ECCEST:1;
      uint64_t reservedSpace2:1;
      uint64_t RBST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCEURS:1;
      uint64_t ECCECRS:1;
      uint64_t reservedSpace0:2;
      uint64_t ECCCRS:1;
      uint64_t reservedSpace1:1;
      uint64_t ECCERS:1;
      uint64_t reservedSpace2:1;
      uint64_t RBRS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRSR;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDX1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDXR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:8;
      uint64_t TWP:8;
      uint64_t TRP:8;
      uint64_t TH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWH:8;
      uint64_t TRH:8;
      uint64_t TRR:8;
      uint64_t TWB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIZE:3;
      uint64_t B16BIT:1;
      uint64_t reservedSpace0:2;
      uint64_t BANK:2;
      uint64_t PAGE:2;
      uint64_t WP:1;
      uint64_t ECCM:2;
      uint64_t RAC:1;
      uint64_t reservedSpace1:2;
      uint64_t SCS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BACR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCCS:8;
      uint64_t TWTR:8;
      uint64_t TRTW:8;
      uint64_t TADL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRLOC:12;
      uint64_t SE:1;
      uint64_t ME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRSEC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND3_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND3_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND4_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND4_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND4_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND4_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND5_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND5_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND5_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND5_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND6_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
      uint64_t reservedSpace1:2;
      uint64_t RESV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND6_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND6_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND6_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND7_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND7_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND7_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND7_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND8_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND8_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND8_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND8_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND9_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND9_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND9_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND9_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND10_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND10_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND10_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND10_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND11_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND11_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND11_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND11_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND12_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND12_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND12_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND12_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND13_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND13_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND13_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND13_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND14_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND14_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND14_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND14_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S1:13;
      uint64_t reservedSpace0:3;
      uint64_t S2:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND15_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S3:13;
      uint64_t reservedSpace0:3;
      uint64_t S4:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND15_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S5:13;
      uint64_t reservedSpace0:3;
      uint64_t S6:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND15_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S7:13;
      uint64_t reservedSpace0:3;
      uint64_t S8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_SYND15_3;

