iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define NFC (*(volatile struct NFC_tag *) 0x88100000)

struct OTS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPD1:16;
      uint64_t TSPD2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDR1;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPD1:16;
      uint64_t TSPD2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSPD1:16;
      uint64_t TSPD2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDR3;

  uint8_t res1[237828];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OTSST:1;
      uint64_t OTSCK:1;
      uint64_t OTSIE:1;
      uint64_t TSSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTL;

  uint16_t DR1;
  uint16_t DR2;
  uint16_t ECR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSOFS:8;
      uint64_t TSSLP:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPR;

};

#define OTS (*(volatile struct OTS_tag *) 0x400106e0)

struct PWC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAMH:1;
      uint64_t reservedSpace0:3;
      uint64_t SRAM1:1;
      uint64_t SRAM2:1;
      uint64_t SRAM3:1;
      uint64_t SRAM4:1;
      uint64_t reservedSpace1:2;
      uint64_t SRAMB:1;
      uint64_t reservedSpace2:2;
      uint64_t KEY:1;
      uint64_t DMA1:1;
      uint64_t DMA2:1;
      uint64_t FCM_bitfield:1;
      uint64_t AOS_bitfield:1;
      uint64_t CTC_bitfield:1;
      uint64_t MAU_bitfield:1;
      uint64_t AES_bitfield:1;
      uint64_t HASH_bitfield:1;
      uint64_t TRNG_bitfield:1;
      uint64_t CRC_bitfield:1;
      uint64_t DCU1_bitfield:1;
      uint64_t DCU2_bitfield:1;
      uint64_t DCU3_bitfield:1;
      uint64_t DCU4_bitfield:1;
      uint64_t DCU5_bitfield:1;
      uint64_t DCU6_bitfield:1;
      uint64_t DCU7_bitfield:1;
      uint64_t DCU8_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAN1_bitfield:1;
      uint64_t CAN2_bitfield:1;
      uint64_t ETHMAC:1;
      uint64_t QSPI_bitfield:1;
      uint64_t I2C1_bitfield:1;
      uint64_t I2C2_bitfield:1;
      uint64_t I2C3_bitfield:1;
      uint64_t I2C4_bitfield:1;
      uint64_t I2C5_bitfield:1;
      uint64_t I2C6_bitfield:1;
      uint64_t SDIOC1_bitfield:1;
      uint64_t SDIOC2_bitfield:1;
      uint64_t I2S1_bitfield:1;
      uint64_t I2S2_bitfield:1;
      uint64_t I2S3_bitfield:1;
      uint64_t I2S4_bitfield:1;
      uint64_t SPI1_bitfield:1;
      uint64_t SPI2_bitfield:1;
      uint64_t SPI3_bitfield:1;
      uint64_t SPI4_bitfield:1;
      uint64_t SPI5_bitfield:1;
      uint64_t SPI6_bitfield:1;
      uint64_t USBFS_bitfield:1;
      uint64_t USBHS_bitfield:1;
      uint64_t FMAC1_bitfield:1;
      uint64_t FMAC2_bitfield:1;
      uint64_t FMAC3_bitfield:1;
      uint64_t FMAC4_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR6_1:1;
      uint64_t TMR6_2:1;
      uint64_t TMR6_3:1;
      uint64_t TMR6_4:1;
      uint64_t TMR6_5:1;
      uint64_t TMR6_6:1;
      uint64_t TMR6_7:1;
      uint64_t TMR6_8:1;
      uint64_t TMR4_1:1;
      uint64_t TMR4_2:1;
      uint64_t TMR4_3:1;
      uint64_t HRPWM_bitfield:1;
      uint64_t TMR0_1:1;
      uint64_t TMR0_2:1;
      uint64_t reservedSpace0:1;
      uint64_t EMB:1;
      uint64_t TMR2_1:1;
      uint64_t TMR2_2:1;
      uint64_t TMR2_3:1;
      uint64_t TMR2_4:1;
      uint64_t TMRA_1:1;
      uint64_t TMRA_2:1;
      uint64_t TMRA_3:1;
      uint64_t TMRA_4:1;
      uint64_t TMRA_5:1;
      uint64_t TMRA_6:1;
      uint64_t TMRA_7:1;
      uint64_t TMRA_8:1;
      uint64_t TMRA_9:1;
      uint64_t TMRA_10:1;
      uint64_t TMRA_11:1;
      uint64_t TMRA_12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC1_bitfield:1;
      uint64_t ADC2_bitfield:1;
      uint64_t ADC3_bitfield:1;
      uint64_t CMBIAS:1;
      uint64_t DAC1_bitfield:1;
      uint64_t DAC2_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t CMP1_bitfield:1;
      uint64_t CMP2_bitfield:1;
      uint64_t reservedSpace1:2;
      uint64_t OTS_bitfield:1;
      uint64_t reservedSpace2:2;
      uint64_t DVP_bitfield:1;
      uint64_t SMC_bitfield:1;
      uint64_t DMC_bitfield:1;
      uint64_t NFC_bitfield:1;
      uint64_t reservedSpace3:1;
      uint64_t USART1_bitfield:1;
      uint64_t USART2_bitfield:1;
      uint64_t USART3_bitfield:1;
      uint64_t USART4_bitfield:1;
      uint64_t USART5_bitfield:1;
      uint64_t USART6_bitfield:1;
      uint64_t USART7_bitfield:1;
      uint64_t USART8_bitfield:1;
      uint64_t USART9_bitfield:1;
      uint64_t USART10_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRT0:1;
      uint64_t reservedSpace0:15;
      uint64_t FCG0PCWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCG0PC;

  uint8_t res0[17436];

  uint8_t VBATRSTR;
  uint8_t res1[15];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VBTRSD:1;
      uint64_t RAMVALID:1;
      uint64_t RAMPDF:1;
      uint64_t VBATDIVMONE:1;
      uint64_t reservedSpace0:3;
      uint64_t CSDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBATCR;

  uint8_t res2[15];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WKTMCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WKTC0;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WKTMCMP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WKTC1;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t WKOVF:1;
      uint64_t WKCKS:2;
      uint64_t WKTCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WKTC2;

