iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res5[423];

  uint8_t BKR0;
  uint8_t res6[3];

  uint8_t BKR1;
  uint8_t res7[3];

  uint8_t BKR2;
  uint8_t res8[3];

  uint8_t BKR3;
  uint8_t res9[3];

  uint8_t BKR4;
  uint8_t res10[3];

  uint8_t BKR5;
  uint8_t res11[3];

  uint8_t BKR6;
  uint8_t res12[3];

  uint8_t BKR7;
  uint8_t res13[3];

  uint8_t BKR8;
  uint8_t res14[3];

  uint8_t BKR9;
  uint8_t res15[3];

  uint8_t BKR10;
  uint8_t res16[3];

  uint8_t BKR11;
  uint8_t res17[3];

  uint8_t BKR12;
  uint8_t res18[3];

  uint8_t BKR13;
  uint8_t res19[3];

  uint8_t BKR14;
  uint8_t res20[3];

  uint8_t BKR15;
  uint8_t res21[3];

  uint8_t BKR16;
  uint8_t res22[3];

  uint8_t BKR17;
  uint8_t res23[3];

  uint8_t BKR18;
  uint8_t res24[3];

  uint8_t BKR19;
  uint8_t res25[3];

  uint8_t BKR20;
  uint8_t res26[3];

  uint8_t BKR21;
  uint8_t res27[3];

  uint8_t BKR22;
  uint8_t res28[3];

  uint8_t BKR23;
  uint8_t res29[3];

  uint8_t BKR24;
  uint8_t res30[3];

  uint8_t BKR25;
  uint8_t res31[3];

  uint8_t BKR26;
  uint8_t res32[3];

  uint8_t BKR27;
  uint8_t res33[3];

  uint8_t BKR28;
  uint8_t res34[3];

  uint8_t BKR29;
  uint8_t res35[3];

  uint8_t BKR30;
  uint8_t res36[3];

  uint8_t BKR31;
  uint8_t res37[3];

  uint8_t BKR32;
  uint8_t res38[3];

  uint8_t BKR33;
  uint8_t res39[3];

  uint8_t BKR34;
  uint8_t res40[3];

  uint8_t BKR35;
  uint8_t res41[3];

  uint8_t BKR36;
  uint8_t res42[3];

  uint8_t BKR37;
  uint8_t res43[3];

  uint8_t BKR38;
  uint8_t res44[3];

  uint8_t BKR39;
  uint8_t res45[3];

  uint8_t BKR40;
  uint8_t res46[3];

  uint8_t BKR41;
  uint8_t res47[3];

  uint8_t BKR42;
  uint8_t res48[3];

  uint8_t BKR43;
  uint8_t res49[3];

  uint8_t BKR44;
  uint8_t res50[3];

  uint8_t BKR45;
  uint8_t res51[3];

  uint8_t BKR46;
  uint8_t res52[3];

  uint8_t BKR47;
  uint8_t res53[3];

  uint8_t BKR48;
  uint8_t res54[3];

  uint8_t BKR49;
  uint8_t res55[3];

  uint8_t BKR50;
  uint8_t res56[3];

  uint8_t BKR51;
  uint8_t res57[3];

  uint8_t BKR52;
  uint8_t res58[3];

  uint8_t BKR53;
  uint8_t res59[3];

  uint8_t BKR54;
  uint8_t res60[3];

  uint8_t BKR55;
  uint8_t res61[3];

  uint8_t BKR56;
  uint8_t res62[3];

  uint8_t BKR57;
  uint8_t res63[3];

  uint8_t BKR58;
  uint8_t res64[3];

  uint8_t BKR59;
  uint8_t res65[3];

  uint8_t BKR60;
  uint8_t res66[3];

  uint8_t BKR61;
  uint8_t res67[3];

  uint8_t BKR62;
  uint8_t res68[3];

  uint8_t BKR63;
  uint8_t res69[3];

  uint8_t BKR64;
  uint8_t res70[3];

  uint8_t BKR65;
  uint8_t res71[3];

  uint8_t BKR66;
  uint8_t res72[3];

  uint8_t BKR67;
  uint8_t res73[3];

  uint8_t BKR68;
  uint8_t res74[3];

  uint8_t BKR69;
  uint8_t res75[3];

  uint8_t BKR70;
  uint8_t res76[3];

  uint8_t BKR71;
  uint8_t res77[3];

  uint8_t BKR72;
  uint8_t res78[3];

  uint8_t BKR73;
  uint8_t res79[3];

  uint8_t BKR74;
  uint8_t res80[3];

  uint8_t BKR75;
  uint8_t res81[3];

  uint8_t BKR76;
  uint8_t res82[3];

  uint8_t BKR77;
  uint8_t res83[3];

  uint8_t BKR78;
  uint8_t res84[3];

  uint8_t BKR79;
  uint8_t res85[3];

  uint8_t BKR80;
  uint8_t res86[3];

  uint8_t BKR81;
  uint8_t res87[3];

  uint8_t BKR82;
  uint8_t res88[3];

  uint8_t BKR83;
  uint8_t res89[3];

  uint8_t BKR84;
  uint8_t res90[3];

  uint8_t BKR85;
  uint8_t res91[3];

  uint8_t BKR86;
  uint8_t res92[3];

  uint8_t BKR87;
  uint8_t res93[3];

  uint8_t BKR88;
  uint8_t res94[3];

  uint8_t BKR89;
  uint8_t res95[3];

  uint8_t BKR90;
  uint8_t res96[3];

  uint8_t BKR91;
  uint8_t res97[3];

  uint8_t BKR92;
  uint8_t res98[3];

  uint8_t BKR93;
  uint8_t res99[3];

  uint8_t BKR94;
  uint8_t res100[3];

  uint8_t BKR95;
  uint8_t res101[3];

  uint8_t BKR96;
  uint8_t res102[3];

  uint8_t BKR97;
  uint8_t res103[3];

  uint8_t BKR98;
  uint8_t res104[3];

  uint8_t BKR99;
  uint8_t res105[3];

  uint8_t BKR100;
  uint8_t res106[3];

  uint8_t BKR101;
  uint8_t res107[3];

  uint8_t BKR102;
  uint8_t res108[3];

  uint8_t BKR103;
  uint8_t res109[3];

  uint8_t BKR104;
  uint8_t res110[3];

  uint8_t BKR105;
  uint8_t res111[3];

  uint8_t BKR106;
  uint8_t res112[3];

  uint8_t BKR107;
  uint8_t res113[3];

  uint8_t BKR108;
  uint8_t res114[3];

  uint8_t BKR109;
  uint8_t res115[3];

  uint8_t BKR110;
  uint8_t res116[3];

  uint8_t BKR111;
  uint8_t res117[3];

  uint8_t BKR112;
  uint8_t res118[3];

  uint8_t BKR113;
  uint8_t res119[3];

  uint8_t BKR114;
  uint8_t res120[3];

  uint8_t BKR115;
  uint8_t res121[3];

  uint8_t BKR116;
  uint8_t res122[3];

  uint8_t BKR117;
  uint8_t res123[3];

  uint8_t BKR118;
  uint8_t res124[3];

  uint8_t BKR119;
  uint8_t res125[3];

  uint8_t BKR120;
  uint8_t res126[3];

  uint8_t BKR121;
  uint8_t res127[3];

  uint8_t BKR122;
  uint8_t res128[3];

  uint8_t BKR123;
  uint8_t res129[3];

  uint8_t BKR124;
  uint8_t res130[3];

  uint8_t BKR125;
  uint8_t res131[3];

  uint8_t BKR126;
  uint8_t res132[3];

  uint8_t BKR127;
  uint8_t res133[1027];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDMDS:2;
      uint64_t reservedSpace0:2;
      uint64_t IORTN:2;
      uint64_t reservedSpace1:1;
      uint64_t PWDN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PWRC0;

  uint8_t res134[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VPLLSD:2;
      uint64_t VHRCSD:1;
      uint64_t PDTS:1;
      uint64_t reservedSpace0:2;
      uint64_t STPDAS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PWRC1;

  uint8_t res135[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DDAS:4;
      uint64_t DVS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PWRC2;

  uint8_t res136[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DDAS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PWRC3;

  uint8_t res137[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VBATREFSEL:1;
      uint64_t VBATME:1;
      uint64_t reservedSpace0:2;
      uint64_t VBATMON:1;
      uint64_t reservedSpace1:1;
      uint64_t ADBUFS:1;
      uint64_t ADBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PWRC4;

