iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res138[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EXVCCINEN:1;
      uint64_t reservedSpace0:4;
      uint64_t PVD1EN:1;
      uint64_t PVD2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PVDCR0;

  uint8_t res139[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PVD1IRE:1;
      uint64_t PVD1IRS:1;
      uint64_t PVD1CMPOE:1;
      uint64_t reservedSpace0:1;
      uint64_t PVD2IRE:1;
      uint64_t PVD2IRS:1;
      uint64_t PVD2CMPOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PVDCR1;

  uint8_t res140[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PVD1NFDIS:1;
      uint64_t PVD1NFCKS:2;
      uint64_t reservedSpace0:1;
      uint64_t PVD2NFDIS:1;
      uint64_t PVD2NFCKS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PVDFCR;

  uint8_t res141[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PVD1LVL:3;
      uint64_t reservedSpace0:1;
      uint64_t PVD2LVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PVDLCR;

  uint8_t res142[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WKE00:1;
      uint64_t WKE01:1;
      uint64_t WKE02:1;
      uint64_t WKE03:1;
      uint64_t WKE10:1;
      uint64_t WKE11:1;
      uint64_t WKE12:1;
      uint64_t WKE13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PDWKE0;

  uint8_t res143[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WKE20:1;
      uint64_t WKE21:1;
      uint64_t WKE22:1;
      uint64_t WKE23:1;
      uint64_t WKE30:1;
      uint64_t WKE31:1;
      uint64_t WKE32:1;
      uint64_t WKE33:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PDWKE1;

  uint8_t res144[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VD1WKE:1;
      uint64_t VD2WKE:1;
      uint64_t reservedSpace0:2;
      uint64_t RTCPRDWKE:1;
      uint64_t RTCALMWKE:1;
      uint64_t reservedSpace1:1;
      uint64_t WKTMWKE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PDWKE2;

  uint8_t res145[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WK0EGS:1;
      uint64_t WK1EGS:1;
      uint64_t WK2EGS:1;
      uint64_t WK3EGS:1;
      uint64_t VD1EGS:1;
      uint64_t VD2EGS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PDWKES;

  uint8_t res146[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PTWK0F:1;
      uint64_t PTWK1F:1;
      uint64_t PTWK2F:1;
      uint64_t PTWK3F:1;
      uint64_t VD1WKF:1;
      uint64_t VD2WKF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PDWKF0;

  uint8_t res147[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t RXD0WKF:1;
      uint64_t RTCPRDWKF:1;
      uint64_t RTCALMWKF:1;
      uint64_t reservedSpace1:1;
      uint64_t WKTMWKF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PDWKF1;

  uint8_t res148[163];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPDC0:1;
      uint64_t RAMPDC1:1;
      uint64_t RAMPDC2:1;
      uint64_t RAMPDC3:1;
      uint64_t RAMPDC4:1;
      uint64_t RAMPDC5:1;
      uint64_t RAMPDC6:1;
      uint64_t RAMPDC7:1;
      uint64_t RAMPDC8:1;
      uint64_t RAMPDC9:1;
      uint64_t RAMPDC10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMPC0;

  uint16_t RAMOPM;
  uint8_t res149[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRAMPDC0:1;
      uint64_t PRAMPDC1:1;
      uint64_t PRAMPDC2:1;
      uint64_t PRAMPDC3:1;
      uint64_t PRAMPDC4:1;
      uint64_t PRAMPDC5:1;
      uint64_t PRAMPDC6:1;
      uint64_t PRAMPDC7:1;
      uint64_t PRAMPDC8:1;
      uint64_t PRAMPDC9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRAMLPC;

  uint8_t res150[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PVD1NMIS:1;
      uint64_t PVD1EDGS:2;
      uint64_t reservedSpace0:1;
      uint64_t PVD2NMIS:1;
      uint64_t PVD2EDGS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PVDICR;

  uint8_t res151[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PVD1MON:1;
      uint64_t PVD1DETFLG:1;
      uint64_t reservedSpace0:2;
      uint64_t PVD2MON:1;
      uint64_t PVD2DETFLG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PVDDSR;

  uint8_t res152[29463];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FLNWT:1;
      uint64_t CKSMRC:1;
      uint64_t reservedSpace0:12;
      uint64_t EXBUSOE:1;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) STPMCR;

  uint8_t res153[1008];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FPRCB0:1;
      uint64_t FPRCB1:1;
      uint64_t FPRCB2:1;
      uint64_t FPRCB3:1;
      uint64_t reservedSpace0:4;
      uint64_t FPRCWE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FPRC;

};

#define PWC (*(volatile struct PWC_tag *) 0x40048000)

struct QSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDSEL:3;
      uint64_t PFE:1;
      uint64_t PFSAE:1;
      uint64_t DCOME:1;
      uint64_t XIPE:1;
      uint64_t SPIMD3:1;
      uint64_t IPRSL:2;
      uint64_t APRSL:2;
      uint64_t DPRSL:2;
      uint64_t reservedSpace0:2;
      uint64_t DIV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSHW:4;
      uint64_t SSNW:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWSL:2;
      uint64_t FOUR_BIC:1;
      uint64_t reservedSpace0:1;
      uint64_t SSNHD:1;
      uint64_t SSNLD:1;
      uint64_t WPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t DMCYCN:4;
      uint64_t reservedSpace2:3;
      uint64_t DUTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t reservedSpace0:5;
      uint64_t XIPF:1;
      uint64_t RAER:1;
      uint64_t PFNUM:5;
      uint64_t reservedSpace1:1;
      uint64_t PFFUL:1;
      uint64_t PFAN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCOM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCOM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XIPMC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XCMD;

