iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t RAERCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR2;

  uint8_t res1[2012];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:26;
      uint64_t EXADR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXAR;

};

#define QSPI (*(volatile struct QSPI_tag *) 0x9c000000)

struct RMU_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t LKUPREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PRSTCR0;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORF:1;
      uint64_t PINRF:1;
      uint64_t BORF:1;
      uint64_t PVD1RF:1;
      uint64_t PVD2RF:1;
      uint64_t WDRF:1;
      uint64_t SWDRF:1;
      uint64_t PDRF:1;
      uint64_t SWRF:1;
      uint64_t MPUERF:1;
      uint64_t RAPERF:1;
      uint64_t RAECRF:1;
      uint64_t CKFERF:1;
      uint64_t XTALERF:1;
      uint64_t LKUPRF:1;
      uint64_t reservedSpace0:15;
      uint64_t MULTIRF:1;
      uint64_t CLRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTF0;

};

#define RMU (*(volatile struct RMU_tag *) 0x4004ccf8)

struct RTC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR0;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRDS:3;
      uint64_t AMPM:1;
      uint64_t reservedSpace0:1;
      uint64_t ONEHZOE:1;
      uint64_t ONEHZSEL:1;
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR1;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RWREQ:1;
      uint64_t RWEN:1;
      uint64_t PRDF:1;
      uint64_t ALMF:1;
      uint64_t reservedSpace0:1;
      uint64_t PRDIE:1;
      uint64_t ALMIE:1;
      uint64_t ALME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR2;

  uint8_t res2[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LRCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t RCKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CR3;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SECU:4;
      uint64_t SECD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SEC;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MINU:4;
      uint64_t MIND:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MIN;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HOURU:4;
      uint64_t HOURD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HOUR;

  uint8_t res6[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WEEK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WEEK;

  uint8_t res7[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAYU:4;
      uint64_t DAYD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAY;

  uint8_t res8[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MON:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MON;

  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t YEARU:4;
      uint64_t YEARD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) YEAR;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALMMINU:4;
      uint64_t ALMMIND:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALMMIN;

  uint8_t res11[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALMHOURU:4;
      uint64_t ALMHOURD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALMHOUR;

  uint8_t res12[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ALMWEEK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALMWEEK;

  uint8_t res13[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMP8:1;
      uint64_t reservedSpace0:6;
      uint64_t COMPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ERRCRH;

  uint8_t res14[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ERRCRL;

  uint8_t res15[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TPCT0:2;
      uint64_t TPNF0:2;
      uint64_t TPRSTE0:1;
      uint64_t TPIE0:1;
      uint64_t TSTPE0:1;
      uint64_t TPEN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TPCR0;

  uint8_t res16[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TPCT1:2;
      uint64_t TPNF1:2;
      uint64_t TPRSTE1:1;
      uint64_t TPIE1:1;
      uint64_t TSTPE1:1;
      uint64_t TPEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TPCR1;

  uint8_t res17[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TPF0:1;
      uint64_t TPF1:1;
      uint64_t TPOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TPSR;

  uint8_t res18[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SECTPU:4;
      uint64_t SECTPD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SECTP;

  uint8_t res19[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MINTPU:4;
      uint64_t MINTPD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MINTP;

  uint8_t res20[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HOURTPU:4;
      uint64_t HOURTPD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HOURTP;

  uint8_t res21[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAYTPU:4;
      uint64_t DAYTPD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAYTP;

