iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint16_t RESP0;
  uint16_t RESP1;
  uint16_t RESP2;
  uint16_t RESP3;
  uint16_t RESP4;
  uint16_t RESP5;
  uint16_t RESP6;
  uint16_t RESP7;
  uint16_t BUF0;
  uint16_t BUF1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIC:1;
      uint64_t CID:1;
      uint64_t DA:1;
      uint64_t reservedSpace0:5;
      uint64_t WTA:1;
      uint64_t RTA:1;
      uint64_t BWE:1;
      uint64_t BRE:1;
      uint64_t reservedSpace1:4;
      uint64_t CIN:1;
      uint64_t CSS:1;
      uint64_t CDL:1;
      uint64_t WPL:1;
      uint64_t DATL:4;
      uint64_t CMDL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSTAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DW:1;
      uint64_t HSEN:1;
      uint64_t reservedSpace1:2;
      uint64_t EXDW:1;
      uint64_t CDTL:1;
      uint64_t CDSS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HOSTCON;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PWON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PWRCON;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SABGR:1;
      uint64_t CR:1;
      uint64_t RWC:1;
      uint64_t IABG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BLKGPCON;

  uint8_t res0[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ICE:1;
      uint64_t reservedSpace0:1;
      uint64_t CE:1;
      uint64_t reservedSpace1:5;
      uint64_t FS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLKCON;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DTO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TOUTCON;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RSTA:1;
      uint64_t RSTC:1;
      uint64_t RSTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SFTRST;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CC:1;
      uint64_t TC:1;
      uint64_t BGE:1;
      uint64_t reservedSpace0:1;
      uint64_t BWR:1;
      uint64_t BRR:1;
      uint64_t CIST:1;
      uint64_t CRM:1;
      uint64_t CINT:1;
      uint64_t reservedSpace1:6;
      uint64_t EI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NORINTST;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTOE:1;
      uint64_t CCE:1;
      uint64_t CEBE:1;
      uint64_t CIE:1;
      uint64_t DTOE:1;
      uint64_t DCE:1;
      uint64_t DEBE:1;
      uint64_t reservedSpace0:1;
      uint64_t ACE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ERRINTST;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CCEN:1;
      uint64_t TCEN:1;
      uint64_t BGEEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BWREN:1;
      uint64_t BRREN:1;
      uint64_t CISTEN:1;
      uint64_t CRMEN:1;
      uint64_t CINTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NORINTSTEN;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTOEEN:1;
      uint64_t CCEEN:1;
      uint64_t CEBEEN:1;
      uint64_t CIEEN:1;
      uint64_t DTOEEN:1;
      uint64_t DCEEN:1;
      uint64_t DEBEEN:1;
      uint64_t reservedSpace0:1;
      uint64_t ACEEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ERRINTSTEN;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CCSEN:1;
      uint64_t TCSEN:1;
      uint64_t BGESEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BWRSEN:1;
      uint64_t BRRSEN:1;
      uint64_t CISTSEN:1;
      uint64_t CRMSEN:1;
      uint64_t CINTSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NORINTSGEN;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTOESEN:1;
      uint64_t CCESEN:1;
      uint64_t CEBESEN:1;
      uint64_t CIESEN:1;
      uint64_t DTOESEN:1;
      uint64_t DCESEN:1;
      uint64_t DEBESEN:1;
      uint64_t reservedSpace0:1;
      uint64_t ACESEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ERRINTSGEN;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NE:1;
      uint64_t TOE:1;
      uint64_t CE:1;
      uint64_t EBE:1;
      uint64_t IE:1;
      uint64_t reservedSpace0:2;
      uint64_t CMDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ATCERRST;

  uint8_t res1[18];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FNE:1;
      uint64_t FTOE:1;
      uint64_t FCE:1;
      uint64_t FEBE:1;
      uint64_t FIE:1;
      uint64_t reservedSpace0:2;
      uint64_t FCMDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FEA;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FCTOE:1;
      uint64_t FCCE:1;
      uint64_t FCEBE:1;
      uint64_t FCIE:1;
      uint64_t FDTOE:1;
      uint64_t FDCE:1;
      uint64_t FDEBE:1;
      uint64_t reservedSpace0:1;
      uint64_t FACE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FEE;

};

#define SDIOC2 (*(volatile struct SDIOC2_tag *) 0x40078404)

struct SMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LPWIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LPWOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDADD:20;
      uint64_t CRES:1;
      uint64_t CMD:2;
      uint64_t CMDCHIP:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RC:4;
      uint64_t T_WC:4;
      uint64_t T_CEOE:3;
      uint64_t reservedSpace0:1;
      uint64_t T_WP:3;
      uint64_t reservedSpace1:1;
      uint64_t T_PC:3;
      uint64_t reservedSpace2:1;
      uint64_t T_TR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSYN:1;
      uint64_t RBL:3;
      uint64_t WSYN:1;
      uint64_t WBL:3;
      uint64_t MW:2;
      uint64_t BAAS:1;
      uint64_t ADVS:1;
      uint64_t BLSS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCR;

