iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFPRD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFTR;

  uint8_t res2[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RC:4;
      uint64_t T_WC:4;
      uint64_t T_CEOE:3;
      uint64_t reservedSpace0:1;
      uint64_t T_WP:3;
      uint64_t reservedSpace1:1;
      uint64_t T_PC:3;
      uint64_t reservedSpace2:1;
      uint64_t T_TR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSYN:1;
      uint64_t RBL:3;
      uint64_t WSYN:1;
      uint64_t WBL:3;
      uint64_t MW:2;
      uint64_t BAAS:1;
      uint64_t ADVS:1;
      uint64_t BLSS:1;
      uint64_t reservedSpace0:3;
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR0;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RC:4;
      uint64_t T_WC:4;
      uint64_t T_CEOE:3;
      uint64_t reservedSpace0:1;
      uint64_t T_WP:3;
      uint64_t reservedSpace1:1;
      uint64_t T_PC:3;
      uint64_t reservedSpace2:1;
      uint64_t T_TR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSYN:1;
      uint64_t RBL:3;
      uint64_t WSYN:1;
      uint64_t WBL:3;
      uint64_t MW:2;
      uint64_t BAAS:1;
      uint64_t ADVS:1;
      uint64_t BLSS:1;
      uint64_t reservedSpace0:3;
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR1;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RC:4;
      uint64_t T_WC:4;
      uint64_t T_CEOE:3;
      uint64_t reservedSpace0:1;
      uint64_t T_WP:3;
      uint64_t reservedSpace1:1;
      uint64_t T_PC:3;
      uint64_t reservedSpace2:1;
      uint64_t T_TR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSYN:1;
      uint64_t RBL:3;
      uint64_t WSYN:1;
      uint64_t WBL:3;
      uint64_t MW:2;
      uint64_t BAAS:1;
      uint64_t ADVS:1;
      uint64_t BLSS:1;
      uint64_t reservedSpace0:3;
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR2;

  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_RC:4;
      uint64_t T_WC:4;
      uint64_t T_CEOE:3;
      uint64_t reservedSpace0:1;
      uint64_t T_WP:3;
      uint64_t reservedSpace1:1;
      uint64_t T_PC:3;
      uint64_t reservedSpace2:1;
      uint64_t T_TR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSYN:1;
      uint64_t RBL:3;
      uint64_t WSYN:1;
      uint64_t WBL:3;
      uint64_t MW:2;
      uint64_t BAAS:1;
      uint64_t ADVS:1;
      uint64_t BLSS:1;
      uint64_t reservedSpace0:3;
      uint64_t ADDMSK:8;
      uint64_t ADDMAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR3;

  uint8_t res6[152];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MUXMD:1;
      uint64_t reservedSpace1:9;
      uint64_t CKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BACR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDMSK0:8;
      uint64_t ADDMSK1:8;
      uint64_t ADDMSK2:8;
      uint64_t ADDMSK3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDMAT0:8;
      uint64_t ADDMAT1:8;
      uint64_t ADDMAT2:8;
      uint64_t ADDMAT3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSCR1;

};

#define SMC (*(volatile struct SMC_tag *) 0x88000000)

struct SPI1_tag
{
  uint32_t DR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIMDS:1;
      uint64_t TXMDS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTR:1;
      uint64_t SPLPBK:1;
      uint64_t SPLPBK2:1;
      uint64_t SPE:1;
      uint64_t CSUSPE:1;
      uint64_t EIE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t IDIE:1;
      uint64_t MODFE:1;
      uint64_t PATE:1;
      uint64_t PAOE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTHLV:2;
      uint64_t reservedSpace0:4;
      uint64_t SPRDTD:1;
      uint64_t reservedSpace1:1;
      uint64_t SS0PV:1;
      uint64_t SS1PV:1;
      uint64_t SS2PV:1;
      uint64_t SS3PV:1;
      uint64_t reservedSpace2:8;
      uint64_t MSSI:3;
      uint64_t reservedSpace3:1;
      uint64_t MSSDL:3;
      uint64_t reservedSpace4:1;
      uint64_t MIDI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRERF:1;
      uint64_t IDLNF:1;
      uint64_t MODFERF:1;
      uint64_t PERF:1;
      uint64_t UDRERF:1;
      uint64_t TDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MBR:3;
      uint64_t SSA:3;
      uint64_t DSIZE:4;
      uint64_t LSBF:1;
      uint64_t MIDIE:1;
      uint64_t MSSDLE:1;
      uint64_t MSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

};

#define SPI1 (*(volatile struct SPI1_tag *) 0x4001c000)

struct SPI2_tag
{
  uint32_t DR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIMDS:1;
      uint64_t TXMDS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTR:1;
      uint64_t SPLPBK:1;
      uint64_t SPLPBK2:1;
      uint64_t SPE:1;
      uint64_t CSUSPE:1;
      uint64_t EIE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t IDIE:1;
      uint64_t MODFE:1;
      uint64_t PATE:1;
      uint64_t PAOE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

