iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTHLV:2;
      uint64_t reservedSpace0:4;
      uint64_t SPRDTD:1;
      uint64_t reservedSpace1:1;
      uint64_t SS0PV:1;
      uint64_t SS1PV:1;
      uint64_t SS2PV:1;
      uint64_t SS3PV:1;
      uint64_t reservedSpace2:8;
      uint64_t MSSI:3;
      uint64_t reservedSpace3:1;
      uint64_t MSSDL:3;
      uint64_t reservedSpace4:1;
      uint64_t MIDI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRERF:1;
      uint64_t IDLNF:1;
      uint64_t MODFERF:1;
      uint64_t PERF:1;
      uint64_t UDRERF:1;
      uint64_t TDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MBR:3;
      uint64_t SSA:3;
      uint64_t DSIZE:4;
      uint64_t LSBF:1;
      uint64_t MIDIE:1;
      uint64_t MSSDLE:1;
      uint64_t MSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

};

#define SPI2 (*(volatile struct SPI2_tag *) 0x4001c400)

struct SPI3_tag
{
  uint32_t DR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIMDS:1;
      uint64_t TXMDS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTR:1;
      uint64_t SPLPBK:1;
      uint64_t SPLPBK2:1;
      uint64_t SPE:1;
      uint64_t CSUSPE:1;
      uint64_t EIE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t IDIE:1;
      uint64_t MODFE:1;
      uint64_t PATE:1;
      uint64_t PAOE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTHLV:2;
      uint64_t reservedSpace0:4;
      uint64_t SPRDTD:1;
      uint64_t reservedSpace1:1;
      uint64_t SS0PV:1;
      uint64_t SS1PV:1;
      uint64_t SS2PV:1;
      uint64_t SS3PV:1;
      uint64_t reservedSpace2:8;
      uint64_t MSSI:3;
      uint64_t reservedSpace3:1;
      uint64_t MSSDL:3;
      uint64_t reservedSpace4:1;
      uint64_t MIDI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRERF:1;
      uint64_t IDLNF:1;
      uint64_t MODFERF:1;
      uint64_t PERF:1;
      uint64_t UDRERF:1;
      uint64_t TDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MBR:3;
      uint64_t SSA:3;
      uint64_t DSIZE:4;
      uint64_t LSBF:1;
      uint64_t MIDIE:1;
      uint64_t MSSDLE:1;
      uint64_t MSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

};

#define SPI3 (*(volatile struct SPI3_tag *) 0x4001c800)

struct SPI4_tag
{
  uint32_t DR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIMDS:1;
      uint64_t TXMDS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTR:1;
      uint64_t SPLPBK:1;
      uint64_t SPLPBK2:1;
      uint64_t SPE:1;
      uint64_t CSUSPE:1;
      uint64_t EIE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t IDIE:1;
      uint64_t MODFE:1;
      uint64_t PATE:1;
      uint64_t PAOE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTHLV:2;
      uint64_t reservedSpace0:4;
      uint64_t SPRDTD:1;
      uint64_t reservedSpace1:1;
      uint64_t SS0PV:1;
      uint64_t SS1PV:1;
      uint64_t SS2PV:1;
      uint64_t SS3PV:1;
      uint64_t reservedSpace2:8;
      uint64_t MSSI:3;
      uint64_t reservedSpace3:1;
      uint64_t MSSDL:3;
      uint64_t reservedSpace4:1;
      uint64_t MIDI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRERF:1;
      uint64_t IDLNF:1;
      uint64_t MODFERF:1;
      uint64_t PERF:1;
      uint64_t UDRERF:1;
      uint64_t TDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MBR:3;
      uint64_t SSA:3;
      uint64_t DSIZE:4;
      uint64_t LSBF:1;
      uint64_t MIDIE:1;
      uint64_t MSSDLE:1;
      uint64_t MSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

};

#define SPI4 (*(volatile struct SPI4_tag *) 0x40020000)

struct SPI5_tag
{
  uint32_t DR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIMDS:1;
      uint64_t TXMDS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTR:1;
      uint64_t SPLPBK:1;
      uint64_t SPLPBK2:1;
      uint64_t SPE:1;
      uint64_t CSUSPE:1;
      uint64_t EIE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t IDIE:1;
      uint64_t MODFE:1;
      uint64_t PATE:1;
      uint64_t PAOE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTHLV:2;
      uint64_t reservedSpace0:4;
      uint64_t SPRDTD:1;
      uint64_t reservedSpace1:1;
      uint64_t SS0PV:1;
      uint64_t SS1PV:1;
      uint64_t SS2PV:1;
      uint64_t SS3PV:1;
      uint64_t reservedSpace2:8;
      uint64_t MSSI:3;
      uint64_t reservedSpace3:1;
      uint64_t MSSDL:3;
      uint64_t reservedSpace4:1;
      uint64_t MIDI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRERF:1;
      uint64_t IDLNF:1;
      uint64_t MODFERF:1;
      uint64_t PERF:1;
      uint64_t UDRERF:1;
      uint64_t TDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MBR:3;
      uint64_t SSA:3;
      uint64_t DSIZE:4;
      uint64_t LSBF:1;
      uint64_t MIDIE:1;
      uint64_t MSSDLE:1;
      uint64_t MSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

