iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define SPI5 (*(volatile struct SPI5_tag *) 0x40020400)

struct SPI6_tag
{
  uint32_t DR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPIMDS:1;
      uint64_t TXMDS:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTR:1;
      uint64_t SPLPBK:1;
      uint64_t SPLPBK2:1;
      uint64_t SPE:1;
      uint64_t CSUSPE:1;
      uint64_t EIE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t IDIE:1;
      uint64_t MODFE:1;
      uint64_t PATE:1;
      uint64_t PAOE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTHLV:2;
      uint64_t reservedSpace0:4;
      uint64_t SPRDTD:1;
      uint64_t reservedSpace1:1;
      uint64_t SS0PV:1;
      uint64_t SS1PV:1;
      uint64_t SS2PV:1;
      uint64_t SS3PV:1;
      uint64_t reservedSpace2:8;
      uint64_t MSSI:3;
      uint64_t reservedSpace3:1;
      uint64_t MSSDL:3;
      uint64_t reservedSpace4:1;
      uint64_t MIDI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRERF:1;
      uint64_t IDLNF:1;
      uint64_t MODFERF:1;
      uint64_t PERF:1;
      uint64_t UDRERF:1;
      uint64_t TDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t RDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t MBR:3;
      uint64_t SSA:3;
      uint64_t DSIZE:4;
      uint64_t LSBF:1;
      uint64_t MIDIE:1;
      uint64_t MSSDLE:1;
      uint64_t MSSIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG2;

};

#define SPI6 (*(volatile struct SPI6_tag *) 0x40020800)

struct SRAMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM123RWT:3;
      uint64_t reservedSpace0:1;
      uint64_t SRAM123WWT:3;
      uint64_t reservedSpace1:1;
      uint64_t SRAM4RWT:3;
      uint64_t reservedSpace2:1;
      uint64_t SRAM4WWT:3;
      uint64_t reservedSpace3:1;
      uint64_t SRAMHRWT:3;
      uint64_t reservedSpace4:1;
      uint64_t SRAMHWWT:3;
      uint64_t reservedSpace5:1;
      uint64_t SRAMBRWT:3;
      uint64_t reservedSpace6:1;
      uint64_t SRAMBWWT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTPRC:1;
      uint64_t WTPRKW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PYOAD:1;
      uint64_t reservedSpace0:15;
      uint64_t ECCOAD:1;
      uint64_t BECCOAD:1;
      uint64_t reservedSpace1:6;
      uint64_t ECCMOD:2;
      uint64_t BECCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKPRC:1;
      uint64_t CKPRKW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM1_PYERR:1;
      uint64_t SRAM2_PYERR:1;
      uint64_t SRAM3_PYERR:1;
      uint64_t SRAMH_PYERR:1;
      uint64_t SRAM4_1ERR:1;
      uint64_t SRAM4_2ERR:1;
      uint64_t SRAMB_1ERR:1;
      uint64_t SRAMB_2ERR:1;
      uint64_t CACHE_PYERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKSR;

};

#define SRAMC (*(volatile struct SRAMC_tag *) 0x40050800)

struct SWDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERI:2;
      uint64_t reservedSpace0:2;
      uint64_t CKS:4;
      uint64_t WDPT:4;
      uint64_t reservedSpace1:4;
      uint64_t SLPOFF:1;
      uint64_t reservedSpace2:14;
      uint64_t ITS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
      uint64_t UDF:1;
      uint64_t REF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR;

};

#define SWDT (*(volatile struct SWDT_tag *) 0x40049400)

struct TMR01_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTA:1;
      uint64_t CAPMDA:1;
      uint64_t INTENA:1;
      uint64_t reservedSpace0:1;
      uint64_t CKDIVA:4;
      uint64_t SYNSA:1;
      uint64_t SYNCLKA:1;
      uint64_t ASYNCLKA:1;
      uint64_t reservedSpace1:1;
      uint64_t HSTAA:1;
      uint64_t HSTPA:1;
      uint64_t HCLEA:1;
      uint64_t HICPA:1;
      uint64_t CSTB:1;
      uint64_t CAPMDB:1;
      uint64_t INTENB:1;
      uint64_t reservedSpace2:1;
      uint64_t CKDIVB:4;
      uint64_t SYNSB:1;
      uint64_t SYNCLKB:1;
      uint64_t ASYNCLKB:1;
      uint64_t reservedSpace3:1;
      uint64_t HSTAB:1;
      uint64_t HSTPB:1;
      uint64_t HCLEB:1;
      uint64_t HICPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMFA:1;
      uint64_t reservedSpace0:15;
      uint64_t CMFB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STFLR;

};

#define TMR01 (*(volatile struct TMR01_tag *) 0x40024000)

struct TMR02_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTA:1;
      uint64_t CAPMDA:1;
      uint64_t INTENA:1;
      uint64_t reservedSpace0:1;
      uint64_t CKDIVA:4;
      uint64_t SYNSA:1;
      uint64_t SYNCLKA:1;
      uint64_t ASYNCLKA:1;
      uint64_t reservedSpace1:1;
      uint64_t HSTAA:1;
      uint64_t HSTPA:1;
      uint64_t HCLEA:1;
      uint64_t HICPA:1;
      uint64_t CSTB:1;
      uint64_t CAPMDB:1;
      uint64_t INTENB:1;
      uint64_t reservedSpace2:1;
      uint64_t CKDIVB:4;
      uint64_t SYNSB:1;
      uint64_t SYNCLKB:1;
      uint64_t ASYNCLKB:1;
      uint64_t reservedSpace3:1;
      uint64_t HSTAB:1;
      uint64_t HSTPB:1;
      uint64_t HCLEB:1;
      uint64_t HICPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMFA:1;
      uint64_t reservedSpace0:15;
      uint64_t CMFB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STFLR;

