iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define TMR02 (*(volatile struct TMR02_tag *) 0x40024400)

struct TMR21_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTA:1;
      uint64_t CAPMDA:1;
      uint64_t reservedSpace0:1;
      uint64_t SYNSA:1;
      uint64_t CKDIVA:4;
      uint64_t SYNCLKA:2;
      uint64_t ASYNCLKA:2;
      uint64_t SYNCLKAT:2;
      uint64_t reservedSpace1:2;
      uint64_t CSTB:1;
      uint64_t CAPMDB:1;
      uint64_t reservedSpace2:1;
      uint64_t SYNSB:1;
      uint64_t CKDIVB:4;
      uint64_t SYNCLKB:2;
      uint64_t ASYNCLKB:2;
      uint64_t SYNCLKBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMENA:1;
      uint64_t OVENA:1;
      uint64_t reservedSpace0:14;
      uint64_t CMENB:1;
      uint64_t OVENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STACA:2;
      uint64_t STPCA:2;
      uint64_t CMPCA:2;
      uint64_t reservedSpace0:2;
      uint64_t OUTENA:1;
      uint64_t reservedSpace1:3;
      uint64_t NOFIENA:1;
      uint64_t NOFICKA:2;
      uint64_t reservedSpace2:1;
      uint64_t STACB:2;
      uint64_t STPCB:2;
      uint64_t CMPCB:2;
      uint64_t reservedSpace3:2;
      uint64_t OUTENB:1;
      uint64_t reservedSpace4:3;
      uint64_t NOFIENB:1;
      uint64_t NOFICKB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSTAA0:1;
      uint64_t HSTAA1:1;
      uint64_t HSTAA2:1;
      uint64_t reservedSpace0:1;
      uint64_t HSTPA0:1;
      uint64_t HSTPA1:1;
      uint64_t HSTPA2:1;
      uint64_t reservedSpace1:1;
      uint64_t HCLEA0:1;
      uint64_t HCLEA1:1;
      uint64_t HCLEA2:1;
      uint64_t reservedSpace2:1;
      uint64_t HICPA0:1;
      uint64_t HICPA1:1;
      uint64_t HICPA2:1;
      uint64_t reservedSpace3:1;
      uint64_t HSTAB0:1;
      uint64_t HSTAB1:1;
      uint64_t HSTAB2:1;
      uint64_t reservedSpace4:1;
      uint64_t HSTPB0:1;
      uint64_t HSTPB1:1;
      uint64_t HSTPB2:1;
      uint64_t reservedSpace5:1;
      uint64_t HCLEB0:1;
      uint64_t HCLEB1:1;
      uint64_t HCLEB2:1;
      uint64_t reservedSpace6:1;
      uint64_t HICPB0:1;
      uint64_t HICPB1:1;
      uint64_t HICPB2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMFA:1;
      uint64_t OVFA:1;
      uint64_t reservedSpace0:14;
      uint64_t CMFB:1;
      uint64_t OVFB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STFLR;

};

#define TMR21 (*(volatile struct TMR21_tag *) 0x40024800)

struct TMR22_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMPBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTA:1;
      uint64_t CAPMDA:1;
      uint64_t reservedSpace0:1;
      uint64_t SYNSA:1;
      uint64_t CKDIVA:4;
      uint64_t SYNCLKA:2;
      uint64_t ASYNCLKA:2;
      uint64_t SYNCLKAT:2;
      uint64_t reservedSpace1:2;
      uint64_t CSTB:1;
      uint64_t CAPMDB:1;
      uint64_t reservedSpace2:1;
      uint64_t SYNSB:1;
      uint64_t CKDIVB:4;
      uint64_t SYNCLKB:2;
      uint64_t ASYNCLKB:2;
      uint64_t SYNCLKBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMENA:1;
      uint64_t OVENA:1;
      uint64_t reservedSpace0:14;
      uint64_t CMENB:1;
      uint64_t OVENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STACA:2;
      uint64_t STPCA:2;
      uint64_t CMPCA:2;
      uint64_t reservedSpace0:2;
      uint64_t OUTENA:1;
      uint64_t reservedSpace1:3;
      uint64_t NOFIENA:1;
      uint64_t NOFICKA:2;
      uint64_t reservedSpace2:1;
      uint64_t STACB:2;
      uint64_t STPCB:2;
      uint64_t CMPCB:2;
      uint64_t reservedSpace3:2;
      uint64_t OUTENB:1;
      uint64_t reservedSpace4:3;
      uint64_t NOFIENB:1;
      uint64_t NOFICKB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSTAA0:1;
      uint64_t HSTAA1:1;
      uint64_t HSTAA2:1;
      uint64_t reservedSpace0:1;
      uint64_t HSTPA0:1;
      uint64_t HSTPA1:1;
      uint64_t HSTPA2:1;
      uint64_t reservedSpace1:1;
      uint64_t HCLEA0:1;
      uint64_t HCLEA1:1;
      uint64_t HCLEA2:1;
      uint64_t reservedSpace2:1;
      uint64_t HICPA0:1;
      uint64_t HICPA1:1;
      uint64_t HICPA2:1;
      uint64_t reservedSpace3:1;
      uint64_t HSTAB0:1;
      uint64_t HSTAB1:1;
      uint64_t HSTAB2:1;
      uint64_t reservedSpace4:1;
      uint64_t HSTPB0:1;
      uint64_t HSTPB1:1;
      uint64_t HSTPB2:1;
      uint64_t reservedSpace5:1;
      uint64_t HCLEB0:1;
      uint64_t HCLEB1:1;
      uint64_t HCLEB2:1;
      uint64_t reservedSpace6:1;
      uint64_t HICPB0:1;
      uint64_t HICPB1:1;
      uint64_t HICPB2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMFA:1;
      uint64_t OVFA:1;
      uint64_t reservedSpace0:14;
      uint64_t CMFB:1;
      uint64_t OVFB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STFLR;

