iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define TMR24 (*(volatile struct TMR24_tag *) 0x40025400)

struct TMR41_tag
{
  uint16_t OCCRUH;
  uint8_t res0[2];

  uint16_t OCCRUL;
  uint8_t res1[2];

  uint16_t OCCRVH;
  uint8_t res2[2];

  uint16_t OCCRVL;
  uint8_t res3[2];

  uint16_t OCCRWH;
  uint8_t res4[2];

  uint16_t OCCRWL;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCEH:1;
      uint64_t OCEL:1;
      uint64_t OCPH:1;
      uint64_t OCPL:1;
      uint64_t OCIEH:1;
      uint64_t OCIEL:1;
      uint64_t OCFH:1;
      uint64_t OCFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCSRU;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHBUFEN:2;
      uint64_t CLBUFEN:2;
      uint64_t MHBUFEN:2;
      uint64_t MLBUFEN:2;
      uint64_t LMCH:1;
      uint64_t LMCL:1;
      uint64_t LMMH:1;
      uint64_t LMML:1;
      uint64_t MCECH:1;
      uint64_t MCECL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCERU;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCEH:1;
      uint64_t OCEL:1;
      uint64_t OCPH:1;
      uint64_t OCPL:1;
      uint64_t OCIEH:1;
      uint64_t OCIEL:1;
      uint64_t OCFH:1;
      uint64_t OCFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCSRV;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHBUFEN:2;
      uint64_t CLBUFEN:2;
      uint64_t MHBUFEN:2;
      uint64_t MLBUFEN:2;
      uint64_t LMCH:1;
      uint64_t LMCL:1;
      uint64_t LMMH:1;
      uint64_t LMML:1;
      uint64_t MCECH:1;
      uint64_t MCECL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCERV;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCEH:1;
      uint64_t OCEL:1;
      uint64_t OCPH:1;
      uint64_t OCPL:1;
      uint64_t OCIEH:1;
      uint64_t OCIEL:1;
      uint64_t OCFH:1;
      uint64_t OCFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCSRW;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHBUFEN:2;
      uint64_t CLBUFEN:2;
      uint64_t MHBUFEN:2;
      uint64_t MLBUFEN:2;
      uint64_t LMCH:1;
      uint64_t LMCL:1;
      uint64_t LMMH:1;
      uint64_t LMML:1;
      uint64_t MCECH:1;
      uint64_t MCECL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCERW;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCFDCH:1;
      uint64_t OCFPKH:1;
      uint64_t OCFUCH:1;
      uint64_t OCFZRH:1;
      uint64_t OPDCH:2;
      uint64_t OPPKH:2;
      uint64_t OPUCH:2;
      uint64_t OPZRH:2;
      uint64_t OPNPKH:2;
      uint64_t OPNZRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCMRHUH;

  uint8_t res5[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCFDCL:1;
      uint64_t OCFPKL:1;
      uint64_t OCFUCL:1;
      uint64_t OCFZRL:1;
      uint64_t OPDCL:2;
      uint64_t OPPKL:2;
      uint64_t OPUCL:2;
      uint64_t OPZRL:2;
      uint64_t OPNPKL:2;
      uint64_t OPNZRL:2;
      uint64_t EOPNDCL:2;
      uint64_t EOPNUCL:2;
      uint64_t EOPDCL:2;
      uint64_t EOPPKL:2;
      uint64_t EOPUCL:2;
      uint64_t EOPZRL:2;
      uint64_t EOPNPKL:2;
      uint64_t EOPNZRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMRLUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCFDCH:1;
      uint64_t OCFPKH:1;
      uint64_t OCFUCH:1;
      uint64_t OCFZRH:1;
      uint64_t OPDCH:2;
      uint64_t OPPKH:2;
      uint64_t OPUCH:2;
      uint64_t OPZRH:2;
      uint64_t OPNPKH:2;
      uint64_t OPNZRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCMRHVH;

  uint8_t res6[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCFDCL:1;
      uint64_t OCFPKL:1;
      uint64_t OCFUCL:1;
      uint64_t OCFZRL:1;
      uint64_t OPDCL:2;
      uint64_t OPPKL:2;
      uint64_t OPUCL:2;
      uint64_t OPZRL:2;
      uint64_t OPNPKL:2;
      uint64_t OPNZRL:2;
      uint64_t EOPNDCL:2;
      uint64_t EOPNUCL:2;
      uint64_t EOPDCL:2;
      uint64_t EOPPKL:2;
      uint64_t EOPUCL:2;
      uint64_t EOPZRL:2;
      uint64_t EOPNPKL:2;
      uint64_t EOPNZRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMRLVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCFDCH:1;
      uint64_t OCFPKH:1;
      uint64_t OCFUCH:1;
      uint64_t OCFZRH:1;
      uint64_t OPDCH:2;
      uint64_t OPPKH:2;
      uint64_t OPUCH:2;
      uint64_t OPZRH:2;
      uint64_t OPNPKH:2;
      uint64_t OPNZRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCMRHWH;

  uint8_t res7[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCFDCL:1;
      uint64_t OCFPKL:1;
      uint64_t OCFUCL:1;
      uint64_t OCFZRL:1;
      uint64_t OPDCL:2;
      uint64_t OPPKL:2;
      uint64_t OPUCL:2;
      uint64_t OPZRL:2;
      uint64_t OPNPKL:2;
      uint64_t OPNZRL:2;
      uint64_t EOPNDCL:2;
      uint64_t EOPNUCL:2;
      uint64_t EOPDCL:2;
      uint64_t EOPPKL:2;
      uint64_t EOPUCL:2;
      uint64_t EOPZRL:2;
      uint64_t EOPNPKL:2;
      uint64_t EOPNZRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMRLWL;

  uint8_t res8[6];

  uint16_t CPSR;
  uint8_t res9[2];

  uint16_t CNTR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CKDIV:4;
      uint64_t CLEAR:1;
      uint64_t MODE:1;
      uint64_t STOP:1;
      uint64_t BUFEN:1;
      uint64_t IRQPEN:1;
      uint64_t IRQPF:1;
      uint64_t reservedSpace0:3;
      uint64_t IRQZEN:1;
      uint64_t IRQZF:1;
      uint64_t ECKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ZIM:4;
      uint64_t PIM:4;
      uint64_t ZIC:4;
      uint64_t PIC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CVPR;

  uint8_t res10[54];

  uint16_t PFSRU;
  uint16_t PDARU;
  uint16_t PDBRU;
  uint8_t res11[2];

  uint16_t PFSRV;
  uint16_t PDARV;
  uint16_t PDBRV;
  uint8_t res12[2];

  uint16_t PFSRW;
  uint16_t PDARW;
  uint16_t PDBRW;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVCK:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMMD:2;
      uint64_t LVLS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POCRU;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVCK:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMMD:2;
      uint64_t LVLS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POCRV;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVCK:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMMD:2;
      uint64_t LVLS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POCRW;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RTIDU:1;
      uint64_t RTIDV:1;
      uint64_t RTIDW:1;
      uint64_t reservedSpace0:1;
      uint64_t RTIFU:1;
      uint64_t RTICU:1;
      uint64_t RTEU:1;
      uint64_t RTSU:1;
      uint64_t RTIFV:1;
      uint64_t RTICV:1;
      uint64_t RTEV:1;
      uint64_t RTSV:1;
      uint64_t RTIFW:1;
      uint64_t RTICW:1;
      uint64_t RTEW:1;
      uint64_t RTSW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RCSR;

  uint8_t res16[12];

  uint16_t SCCRUH;
  uint8_t res17[2];

  uint16_t SCCRUL;
  uint8_t res18[2];

