iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint16_t SCCRVH;
  uint8_t res19[2];

  uint16_t SCCRVL;
  uint8_t res20[2];

  uint16_t SCCRWH;
  uint8_t res21[2];

  uint16_t SCCRWL;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRUH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRUH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRVH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRVH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRWH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRWH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRWL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRWL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OEUH:1;
      uint64_t OEUL:1;
      uint64_t OEVH:1;
      uint64_t OEVL:1;
      uint64_t OEWH:1;
      uint64_t OEWL:1;
      uint64_t ODT:2;
      uint64_t MOE:1;
      uint64_t AOE:1;
      uint64_t reservedSpace0:6;
      uint64_t OSUH:2;
      uint64_t OSUL:2;
      uint64_t OSVH:2;
      uint64_t OSVL:2;
      uint64_t OSWH:2;
      uint64_t OSWL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EVTRS:3;
      uint64_t PCTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCER;

};

#define TMR41 (*(volatile struct TMR41_tag *) 0x40038002)

struct TMR42_tag
{
  uint16_t OCCRUH;
  uint8_t res0[2];

  uint16_t OCCRUL;
  uint8_t res1[2];

  uint16_t OCCRVH;
  uint8_t res2[2];

  uint16_t OCCRVL;
  uint8_t res3[2];

  uint16_t OCCRWH;
  uint8_t res4[2];

  uint16_t OCCRWL;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCEH:1;
      uint64_t OCEL:1;
      uint64_t OCPH:1;
      uint64_t OCPL:1;
      uint64_t OCIEH:1;
      uint64_t OCIEL:1;
      uint64_t OCFH:1;
      uint64_t OCFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCSRU;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHBUFEN:2;
      uint64_t CLBUFEN:2;
      uint64_t MHBUFEN:2;
      uint64_t MLBUFEN:2;
      uint64_t LMCH:1;
      uint64_t LMCL:1;
      uint64_t LMMH:1;
      uint64_t LMML:1;
      uint64_t MCECH:1;
      uint64_t MCECL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCERU;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCEH:1;
      uint64_t OCEL:1;
      uint64_t OCPH:1;
      uint64_t OCPL:1;
      uint64_t OCIEH:1;
      uint64_t OCIEL:1;
      uint64_t OCFH:1;
      uint64_t OCFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCSRV;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHBUFEN:2;
      uint64_t CLBUFEN:2;
      uint64_t MHBUFEN:2;
      uint64_t MLBUFEN:2;
      uint64_t LMCH:1;
      uint64_t LMCL:1;
      uint64_t LMMH:1;
      uint64_t LMML:1;
      uint64_t MCECH:1;
      uint64_t MCECL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCERV;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCEH:1;
      uint64_t OCEL:1;
      uint64_t OCPH:1;
      uint64_t OCPL:1;
      uint64_t OCIEH:1;
      uint64_t OCIEL:1;
      uint64_t OCFH:1;
      uint64_t OCFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCSRW;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHBUFEN:2;
      uint64_t CLBUFEN:2;
      uint64_t MHBUFEN:2;
      uint64_t MLBUFEN:2;
      uint64_t LMCH:1;
      uint64_t LMCL:1;
      uint64_t LMMH:1;
      uint64_t LMML:1;
      uint64_t MCECH:1;
      uint64_t MCECL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCERW;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCFDCH:1;
      uint64_t OCFPKH:1;
      uint64_t OCFUCH:1;
      uint64_t OCFZRH:1;
      uint64_t OPDCH:2;
      uint64_t OPPKH:2;
      uint64_t OPUCH:2;
      uint64_t OPZRH:2;
      uint64_t OPNPKH:2;
      uint64_t OPNZRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCMRHUH;

  uint8_t res5[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCFDCL:1;
      uint64_t OCFPKL:1;
      uint64_t OCFUCL:1;
      uint64_t OCFZRL:1;
      uint64_t OPDCL:2;
      uint64_t OPPKL:2;
      uint64_t OPUCL:2;
      uint64_t OPZRL:2;
      uint64_t OPNPKL:2;
      uint64_t OPNZRL:2;
      uint64_t EOPNDCL:2;
      uint64_t EOPNUCL:2;
      uint64_t EOPDCL:2;
      uint64_t EOPPKL:2;
      uint64_t EOPUCL:2;
      uint64_t EOPZRL:2;
      uint64_t EOPNPKL:2;
      uint64_t EOPNZRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMRLUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCFDCH:1;
      uint64_t OCFPKH:1;
      uint64_t OCFUCH:1;
      uint64_t OCFZRH:1;
      uint64_t OPDCH:2;
      uint64_t OPPKH:2;
      uint64_t OPUCH:2;
      uint64_t OPZRH:2;
      uint64_t OPNPKH:2;
      uint64_t OPNZRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCMRHVH;

  uint8_t res6[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCFDCL:1;
      uint64_t OCFPKL:1;
      uint64_t OCFUCL:1;
      uint64_t OCFZRL:1;
      uint64_t OPDCL:2;
      uint64_t OPPKL:2;
      uint64_t OPUCL:2;
      uint64_t OPZRL:2;
      uint64_t OPNPKL:2;
      uint64_t OPNZRL:2;
      uint64_t EOPNDCL:2;
      uint64_t EOPNUCL:2;
      uint64_t EOPDCL:2;
      uint64_t EOPPKL:2;
      uint64_t EOPUCL:2;
      uint64_t EOPZRL:2;
      uint64_t EOPNPKL:2;
      uint64_t EOPNZRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMRLVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OCFDCH:1;
      uint64_t OCFPKH:1;
      uint64_t OCFUCH:1;
      uint64_t OCFZRH:1;
      uint64_t OPDCH:2;
      uint64_t OPPKH:2;
      uint64_t OPUCH:2;
      uint64_t OPZRH:2;
      uint64_t OPNPKH:2;
      uint64_t OPNZRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OCMRHWH;

  uint8_t res7[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCFDCL:1;
      uint64_t OCFPKL:1;
      uint64_t OCFUCL:1;
      uint64_t OCFZRL:1;
      uint64_t OPDCL:2;
      uint64_t OPPKL:2;
      uint64_t OPUCL:2;
      uint64_t OPZRL:2;
      uint64_t OPNPKL:2;
      uint64_t OPNZRL:2;
      uint64_t EOPNDCL:2;
      uint64_t EOPNUCL:2;
      uint64_t EOPDCL:2;
      uint64_t EOPPKL:2;
      uint64_t EOPUCL:2;
      uint64_t EOPZRL:2;
      uint64_t EOPNPKL:2;
      uint64_t EOPNZRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCMRLWL;

  uint8_t res8[6];

