iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint16_t CPSR;
  uint8_t res9[2];

  uint16_t CNTR;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CKDIV:4;
      uint64_t CLEAR:1;
      uint64_t MODE:1;
      uint64_t STOP:1;
      uint64_t BUFEN:1;
      uint64_t IRQPEN:1;
      uint64_t IRQPF:1;
      uint64_t reservedSpace0:3;
      uint64_t IRQZEN:1;
      uint64_t IRQZF:1;
      uint64_t ECKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCSR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ZIM:4;
      uint64_t PIM:4;
      uint64_t ZIC:4;
      uint64_t PIC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CVPR;

  uint8_t res10[54];

  uint16_t PFSRU;
  uint16_t PDARU;
  uint16_t PDBRU;
  uint8_t res11[2];

  uint16_t PFSRV;
  uint16_t PDARV;
  uint16_t PDBRV;
  uint8_t res12[2];

  uint16_t PFSRW;
  uint16_t PDARW;
  uint16_t PDBRW;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVCK:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMMD:2;
      uint64_t LVLS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POCRU;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVCK:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMMD:2;
      uint64_t LVLS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POCRV;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVCK:3;
      uint64_t reservedSpace0:1;
      uint64_t PWMMD:2;
      uint64_t LVLS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POCRW;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RTIDU:1;
      uint64_t RTIDV:1;
      uint64_t RTIDW:1;
      uint64_t reservedSpace0:1;
      uint64_t RTIFU:1;
      uint64_t RTICU:1;
      uint64_t RTEU:1;
      uint64_t RTSU:1;
      uint64_t RTIFV:1;
      uint64_t RTICV:1;
      uint64_t RTEV:1;
      uint64_t RTSV:1;
      uint64_t RTIFW:1;
      uint64_t RTICW:1;
      uint64_t RTEW:1;
      uint64_t RTSW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RCSR;

  uint8_t res16[12];

  uint16_t SCCRUH;
  uint8_t res17[2];

  uint16_t SCCRUL;
  uint8_t res18[2];

  uint16_t SCCRVH;
  uint8_t res19[2];

  uint16_t SCCRVL;
  uint8_t res20[2];

  uint16_t SCCRWH;
  uint8_t res21[2];

  uint16_t SCCRWL;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRUH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRUH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRVH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRVH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRWH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRWH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRWL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRWL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OEUH:1;
      uint64_t OEUL:1;
      uint64_t OEVH:1;
      uint64_t OEVL:1;
      uint64_t OEWH:1;
      uint64_t OEWL:1;
      uint64_t ODT:2;
      uint64_t MOE:1;
      uint64_t AOE:1;
      uint64_t reservedSpace0:6;
      uint64_t OSUH:2;
      uint64_t OSUL:2;
      uint64_t OSVH:2;
      uint64_t OSVL:2;
      uint64_t OSWH:2;
      uint64_t OSWL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EVTRS:3;
      uint64_t PCTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCER;

