iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint16_t SCCRVH;
  uint8_t res19[2];

  uint16_t SCCRVL;
  uint8_t res20[2];

  uint16_t SCCRWH;
  uint8_t res21[2];

  uint16_t SCCRWL;
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRUH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRUH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRUL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRVH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRVH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRVL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRWH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRWH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUFEN:2;
      uint64_t EVTOS:3;
      uint64_t LMC:1;
      uint64_t reservedSpace0:2;
      uint64_t EVTMS:1;
      uint64_t EVTDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DEN:1;
      uint64_t PEN:1;
      uint64_t UEN:1;
      uint64_t ZEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCSRWL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:4;
      uint64_t reservedSpace0:2;
      uint64_t MZCE:1;
      uint64_t MPCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCMRWL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OEUH:1;
      uint64_t OEUL:1;
      uint64_t OEVH:1;
      uint64_t OEVL:1;
      uint64_t OEWH:1;
      uint64_t OEWL:1;
      uint64_t ODT:2;
      uint64_t MOE:1;
      uint64_t AOE:1;
      uint64_t reservedSpace0:6;
      uint64_t OSUH:2;
      uint64_t OSUL:2;
      uint64_t OSVH:2;
      uint64_t OSVL:2;
      uint64_t OSWH:2;
      uint64_t OSWL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSCR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EVTRS:3;
      uint64_t PCTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SCER;

};

#define TMR43 (*(volatile struct TMR43_tag *) 0x40038802)

struct TMR61_tag
{
  uint32_t CNTER;
  uint32_t UPDAR;
  uint8_t res0[56];

  uint32_t PERAR;
  uint32_t PERBR;
  uint32_t PERCR;
  uint8_t res1[52];

  uint32_t GCMAR;
  uint32_t GCMBR;
  uint32_t GCMCR;
  uint32_t GCMDR;
  uint32_t GCMER;
  uint32_t GCMFR;
  uint8_t res2[40];

  uint32_t SCMAR;
  uint32_t SCMBR;
  uint32_t SCMCR;
  uint32_t SCMDR;
  uint32_t SCMER;
  uint32_t SCMFR;
  uint8_t res3[40];

  uint32_t DTUAR;
  uint32_t DTDAR;
  uint32_t DTUBR;
  uint32_t DTDBR;
  uint8_t res4[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:1;
      uint64_t DIR:1;
      uint64_t MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t CKDIV:4;
      uint64_t OVSTP:1;
      uint64_t reservedSpace1:7;
      uint64_t ZMSKREV:1;
      uint64_t ZMSKPOS:1;
      uint64_t ZMSKVAL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTENA:1;
      uint64_t INTENB:1;
      uint64_t INTENC:1;
      uint64_t INTEND:1;
      uint64_t INTENE:1;
      uint64_t INTENF:1;
      uint64_t INTENOVF:1;
      uint64_t INTENUDF:1;
      uint64_t INTENDTE:1;
      uint64_t reservedSpace0:7;
      uint64_t INTENSAU:1;
      uint64_t INTENSAD:1;
      uint64_t INTENSBU:1;
      uint64_t INTENSBD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BENA:1;
      uint64_t BSEA:1;
      uint64_t BTRUA:1;
      uint64_t BTRDA:1;
      uint64_t BENB:1;
      uint64_t BSEB:1;
      uint64_t BTRUB:1;
      uint64_t BTRDB:1;
      uint64_t BENP:1;
      uint64_t BSEP:1;
      uint64_t BTRUP:1;
      uint64_t BTRDP:1;
      uint64_t reservedSpace0:4;
      uint64_t BENSPA:1;
      uint64_t BSESPA:1;
      uint64_t BTRUSPA:1;
      uint64_t BTRDSPA:1;
      uint64_t BENSPB:1;
      uint64_t BSESPB:1;
      uint64_t BTRUSPB:1;
      uint64_t BTRDSPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCONR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTCEN:1;
      uint64_t SEPA:1;
      uint64_t reservedSpace0:2;
      uint64_t DTBENU:1;
      uint64_t DTBEND:1;
      uint64_t DTBTRU:1;
      uint64_t DTBTRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCONR;

