iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STACA:2;
      uint64_t STPCA:2;
      uint64_t OVFCA:2;
      uint64_t UDFCA:2;
      uint64_t CMAUCA:2;
      uint64_t CMADCA:2;
      uint64_t CMBUCA:2;
      uint64_t CMBDCA:2;
      uint64_t FORCA:2;
      uint64_t reservedSpace0:2;
      uint64_t EMBCA:2;
      uint64_t EMBRA:2;
      uint64_t EMBSA:2;
      uint64_t reservedSpace1:2;
      uint64_t OUTENA:1;
      uint64_t reservedSpace2:2;
      uint64_t CAPMDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCNAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STACB:2;
      uint64_t STPCB:2;
      uint64_t OVFCB:2;
      uint64_t UDFCB:2;
      uint64_t CMAUCB:2;
      uint64_t CMADCB:2;
      uint64_t CMBUCB:2;
      uint64_t CMBDCB:2;
      uint64_t FORCB:2;
      uint64_t reservedSpace0:2;
      uint64_t EMBCB:2;
      uint64_t EMBRB:2;
      uint64_t EMBSB:2;
      uint64_t reservedSpace1:2;
      uint64_t OUTENB:1;
      uint64_t reservedSpace2:2;
      uint64_t CAPMDB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCNBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOFIENGA:1;
      uint64_t NOFICKGA:2;
      uint64_t reservedSpace0:1;
      uint64_t NOFIENGB:1;
      uint64_t NOFICKGB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCNGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SPPERIA:1;
      uint64_t SPPERIB:1;
      uint64_t reservedSpace1:6;
      uint64_t PCNTE:2;
      uint64_t PCNTS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VPERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMAF:1;
      uint64_t CMBF:1;
      uint64_t CMCF:1;
      uint64_t CMDF:1;
      uint64_t CMEF:1;
      uint64_t CMFF:1;
      uint64_t OVFF:1;
      uint64_t UDFF:1;
      uint64_t DTEF:1;
      uint64_t CMSAUF:1;
      uint64_t CMSADF:1;
      uint64_t CMSBUF:1;
      uint64_t CMSBDF:1;
      uint64_t reservedSpace0:8;
      uint64_t VPERNUM:3;
      uint64_t reservedSpace1:7;
      uint64_t DIRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STFLR;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSTA0:1;
      uint64_t HSTA1:1;
      uint64_t HSTA2:1;
      uint64_t HSTA3:1;
      uint64_t reservedSpace0:3;
      uint64_t STAS:1;
      uint64_t HSTA8:1;
      uint64_t HSTA9:1;
      uint64_t HSTA10:1;
      uint64_t HSTA11:1;
      uint64_t reservedSpace1:4;
      uint64_t HSTA16:1;
      uint64_t HSTA17:1;
      uint64_t HSTA18:1;
      uint64_t HSTA19:1;
      uint64_t HSTA20:1;
      uint64_t HSTA21:1;
      uint64_t HSTA22:1;
      uint64_t HSTA23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSTP0:1;
      uint64_t HSTP1:1;
      uint64_t HSTP2:1;
      uint64_t HSTP3:1;
      uint64_t reservedSpace0:3;
      uint64_t STPS:1;
      uint64_t HSTP8:1;
      uint64_t HSTP9:1;
      uint64_t HSTP10:1;
      uint64_t HSTP11:1;
      uint64_t reservedSpace1:4;
      uint64_t HSTP16:1;
      uint64_t HSTP17:1;
      uint64_t HSTP18:1;
      uint64_t HSTP19:1;
      uint64_t HSTP20:1;
      uint64_t HSTP21:1;
      uint64_t HSTP22:1;
      uint64_t HSTP23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSTPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCLE0:1;
      uint64_t HCLE1:1;
      uint64_t HCLE2:1;
      uint64_t HCLE3:1;
      uint64_t reservedSpace0:3;
      uint64_t CLES:1;
      uint64_t HCLE8:1;
      uint64_t HCLE9:1;
      uint64_t HCLE10:1;
      uint64_t HCLE11:1;
      uint64_t reservedSpace1:4;
      uint64_t HCLE16:1;
      uint64_t HCLE17:1;
      uint64_t HCLE18:1;
      uint64_t HCLE19:1;
      uint64_t HCLE20:1;
      uint64_t HCLE21:1;
      uint64_t HCLE22:1;
      uint64_t HCLE23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCLRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HUPD0:1;
      uint64_t HUPD1:1;
      uint64_t HUPD2:1;
      uint64_t HUPD3:1;
      uint64_t reservedSpace0:3;
      uint64_t UPDS:1;
      uint64_t HUPD8:1;
      uint64_t HUPD9:1;
      uint64_t HUPD10:1;
      uint64_t HUPD11:1;
      uint64_t reservedSpace1:4;
      uint64_t HUPD16:1;
      uint64_t HUPD17:1;
      uint64_t HUPD18:1;
      uint64_t HUPD19:1;
      uint64_t HUPD20:1;
      uint64_t HUPD21:1;
      uint64_t HUPD22:1;
      uint64_t HUPD23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HUPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCPA0:1;
      uint64_t HCPA1:1;
      uint64_t HCPA2:1;
      uint64_t HCPA3:1;
      uint64_t reservedSpace0:4;
      uint64_t HCPA8:1;
      uint64_t HCPA9:1;
      uint64_t HCPA10:1;
      uint64_t HCPA11:1;
      uint64_t reservedSpace1:4;
      uint64_t HCPA16:1;
      uint64_t HCPA17:1;
      uint64_t HCPA18:1;
      uint64_t HCPA19:1;
      uint64_t HCPA20:1;
      uint64_t HCPA21:1;
      uint64_t HCPA22:1;
      uint64_t HCPA23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCPB0:1;
      uint64_t HCPB1:1;
      uint64_t HCPB2:1;
      uint64_t HCPB3:1;
      uint64_t reservedSpace0:4;
      uint64_t HCPB8:1;
      uint64_t HCPB9:1;
      uint64_t HCPB10:1;
      uint64_t HCPB11:1;
      uint64_t reservedSpace1:4;
      uint64_t HCPB16:1;
      uint64_t HCPB17:1;
      uint64_t HCPB18:1;
      uint64_t HCPB19:1;
      uint64_t HCPB20:1;
      uint64_t HCPB21:1;
      uint64_t HCPB22:1;
      uint64_t HCPB23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCPBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCUP0:1;
      uint64_t HCUP1:1;
      uint64_t HCUP2:1;
      uint64_t HCUP3:1;
      uint64_t HCUP4:1;
      uint64_t HCUP5:1;
      uint64_t HCUP6:1;
      uint64_t HCUP7:1;
      uint64_t HCUP8:1;
      uint64_t HCUP9:1;
      uint64_t HCUP10:1;
      uint64_t HCUP11:1;
      uint64_t reservedSpace0:4;
      uint64_t HCUP16:1;
      uint64_t HCUP17:1;
      uint64_t HCUP18:1;
      uint64_t HCUP19:1;
      uint64_t HCUP20:1;
      uint64_t HCUP21:1;
      uint64_t HCUP22:1;
      uint64_t HCUP23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCUPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCDO0:1;
      uint64_t HCDO1:1;
      uint64_t HCDO2:1;
      uint64_t HCDO3:1;
      uint64_t HCDO4:1;
      uint64_t HCDO5:1;
      uint64_t HCDO6:1;
      uint64_t HCDO7:1;
      uint64_t HCDO8:1;
      uint64_t HCDO9:1;
      uint64_t HCDO10:1;
      uint64_t HCDO11:1;
      uint64_t reservedSpace0:4;
      uint64_t HCDO16:1;
      uint64_t HCDO17:1;
      uint64_t HCDO18:1;
      uint64_t HCDO19:1;
      uint64_t HCDO20:1;
      uint64_t HCDO21:1;
      uint64_t HCDO22:1;
      uint64_t HCDO23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCDOR;

