iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define TMR68 (*(volatile struct TMR68_tag *) 0x40019c00)

struct TMR6CR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOFIENTA:1;
      uint64_t NOFICKTA:2;
      uint64_t reservedSpace0:1;
      uint64_t NOFIENTB:1;
      uint64_t NOFICKTB:2;
      uint64_t reservedSpace1:1;
      uint64_t NOFIENTC:1;
      uint64_t NOFICKTC:2;
      uint64_t reservedSpace2:1;
      uint64_t NOFIENTD:1;
      uint64_t NOFICKTD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTA1:1;
      uint64_t SSTA2:1;
      uint64_t SSTA3:1;
      uint64_t SSTA4:1;
      uint64_t SSTA5:1;
      uint64_t SSTA6:1;
      uint64_t SSTA7:1;
      uint64_t SSTA8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTP1:1;
      uint64_t SSTP2:1;
      uint64_t SSTP3:1;
      uint64_t SSTP4:1;
      uint64_t SSTP5:1;
      uint64_t SSTP6:1;
      uint64_t SSTP7:1;
      uint64_t SSTP8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLE1:1;
      uint64_t SCLE2:1;
      uint64_t SCLE3:1;
      uint64_t SCLE4:1;
      uint64_t SCLE5:1;
      uint64_t SCLE6:1;
      uint64_t SCLE7:1;
      uint64_t SCLE8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUPD1:1;
      uint64_t SUPD2:1;
      uint64_t SUPD3:1;
      uint64_t SUPD4:1;
      uint64_t SUPD5:1;
      uint64_t SUPD6:1;
      uint64_t SUPD7:1;
      uint64_t SUPD8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUPDR;

};

#define TMR6CR (*(volatile struct TMR6CR_tag *) 0x400183ec)

struct TMRA1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CNTER;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PERAR;

  uint8_t res1[58];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CMPAR1;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CMPAR2;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CMPAR3;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CMPAR4;

  uint8_t res5[50];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START:1;
      uint64_t DIR:1;
      uint64_t MODE:1;
      uint64_t SYNST:1;
      uint64_t CKDIV:4;
      uint64_t OVSTP:1;
      uint64_t reservedSpace0:3;
      uint64_t ITENOVF:1;
      uint64_t ITENUDF:1;
      uint64_t OVFF:1;
      uint64_t UDFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BCSTR;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t HSTA0:1;
      uint64_t HSTA1:1;
      uint64_t HSTA2:1;
      uint64_t reservedSpace0:1;
      uint64_t HSTP0:1;
      uint64_t HSTP1:1;
      uint64_t HSTP2:1;
      uint64_t reservedSpace1:1;
      uint64_t HCLE0:1;
      uint64_t HCLE1:1;
      uint64_t HCLE2:1;
      uint64_t reservedSpace2:1;
      uint64_t HCLE3:1;
      uint64_t HCLE4:1;
      uint64_t HCLE5:1;
      uint64_t HCLE6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HCONR;

  uint8_t res7[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t HCUP0:1;
      uint64_t HCUP1:1;
      uint64_t HCUP2:1;
      uint64_t HCUP3:1;
      uint64_t HCUP4:1;
      uint64_t HCUP5:1;
      uint64_t HCUP6:1;
      uint64_t HCUP7:1;
      uint64_t HCUP8:1;
      uint64_t HCUP9:1;
      uint64_t HCUP10:1;
      uint64_t HCUP11:1;
      uint64_t HCUP12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HCUPR;

  uint8_t res8[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t HCDO0:1;
      uint64_t HCDO1:1;
      uint64_t HCDO2:1;
      uint64_t HCDO3:1;
      uint64_t HCDO4:1;
      uint64_t HCDO5:1;
      uint64_t HCDO6:1;
      uint64_t HCDO7:1;
      uint64_t HCDO8:1;
      uint64_t HCDO9:1;
      uint64_t HCDO10:1;
      uint64_t HCDO11:1;
      uint64_t HCDO12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HCDOR;

  uint8_t res9[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ITEN1:1;
      uint64_t ITEN2:1;
      uint64_t ITEN3:1;
      uint64_t ITEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ICONR;

  uint8_t res10[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ETEN1:1;
      uint64_t ETEN2:1;
      uint64_t ETEN3:1;
      uint64_t ETEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ECONR;

  uint8_t res11[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NOFIENTG:1;
      uint64_t NOFICKTG:2;
      uint64_t reservedSpace0:5;
      uint64_t NOFIENCA:1;
      uint64_t NOFICKCA:2;
      uint64_t reservedSpace1:1;
      uint64_t NOFIENCB:1;
      uint64_t NOFICKCB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FCONR;

  uint8_t res12[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMPF1:1;
      uint64_t CMPF2:1;
      uint64_t CMPF3:1;
      uint64_t CMPF4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) STFLR;

  uint8_t res13[34];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BEN:1;
      uint64_t BSE0:1;
      uint64_t BSE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BCONR1;

  uint8_t res14[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BEN:1;
      uint64_t BSE0:1;
      uint64_t BSE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BCONR2;

  uint8_t res15[54];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPMD:1;
      uint64_t reservedSpace0:3;
      uint64_t HICP0:1;
      uint64_t HICP1:1;
      uint64_t HICP2:1;
      uint64_t reservedSpace1:1;
      uint64_t HICP3:1;
      uint64_t HICP4:1;
      uint64_t reservedSpace2:2;
      uint64_t NOFIENCP:1;
      uint64_t NOFICKCP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCONR1;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPMD:1;
      uint64_t reservedSpace0:3;
      uint64_t HICP0:1;
      uint64_t HICP1:1;
      uint64_t HICP2:1;
      uint64_t reservedSpace1:1;
      uint64_t HICP3:1;
      uint64_t HICP4:1;
      uint64_t reservedSpace2:2;
      uint64_t NOFIENCP:1;
      uint64_t NOFICKCP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCONR2;

  uint8_t res17[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPMD:1;
      uint64_t reservedSpace0:3;
      uint64_t HICP0:1;
      uint64_t HICP1:1;
      uint64_t HICP2:1;
      uint64_t reservedSpace1:1;
      uint64_t HICP3:1;
      uint64_t HICP4:1;
      uint64_t reservedSpace2:2;
      uint64_t NOFIENCP:1;
      uint64_t NOFICKCP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCONR3;

