iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint8_t res18[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPMD:1;
      uint64_t reservedSpace0:3;
      uint64_t HICP0:1;
      uint64_t HICP1:1;
      uint64_t HICP2:1;
      uint64_t reservedSpace1:1;
      uint64_t HICP3:1;
      uint64_t HICP4:1;
      uint64_t reservedSpace2:2;
      uint64_t NOFIENCP:1;
      uint64_t NOFICKCP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CCONR4;

  uint8_t res19[50];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t STAC:2;
      uint64_t STPC:2;
      uint64_t CMPC:2;
      uint64_t PERC:2;
      uint64_t FORC:2;
      uint64_t reservedSpace0:2;
      uint64_t OUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCONR1;

  uint8_t res20[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t STAC:2;
      uint64_t STPC:2;
      uint64_t CMPC:2;
      uint64_t PERC:2;
      uint64_t FORC:2;
      uint64_t reservedSpace0:2;
      uint64_t OUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCONR2;

  uint8_t res21[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t STAC:2;
      uint64_t STPC:2;
      uint64_t CMPC:2;
      uint64_t PERC:2;
      uint64_t FORC:2;
      uint64_t reservedSpace0:2;
      uint64_t OUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCONR3;

  uint8_t res22[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t STAC:2;
      uint64_t STPC:2;
      uint64_t CMPC:2;
      uint64_t PERC:2;
      uint64_t FORC:2;
      uint64_t reservedSpace0:2;
      uint64_t OUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCONR4;

};

#define TMRA9 (*(volatile struct TMRA9_tag *) 0x40027000)

struct TRNG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t RUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOAD:1;
      uint64_t reservedSpace0:1;
      uint64_t CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

  uint8_t res0[4];

  uint32_t DR0;
  uint32_t DR1;
};

#define TRNG (*(volatile struct TRNG_tag *) 0x40042000)

struct USART1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t RTOF:1;
      uint64_t reservedSpace2:7;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FRACTION:7;
      uint64_t reservedSpace0:1;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTOE:1;
      uint64_t RTOIE:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace0:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace1:1;
      uint64_t M:1;
      uint64_t reservedSpace2:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace3:1;
      uint64_t CORE:1;
      uint64_t CRTOF:1;
      uint64_t reservedSpace4:3;
      uint64_t MS:1;
      uint64_t reservedSpace5:3;
      uint64_t ML:1;
      uint64_t FBME:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t reservedSpace0:10;
      uint64_t CLKC:2;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t reservedSpace3:11;
      uint64_t BCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define USART1 (*(volatile struct USART1_tag *) 0x4001cc00)

struct USART10_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t BE:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t reservedSpace1:1;
      uint64_t WKUP:1;
      uint64_t LBD:1;
      uint64_t reservedSpace2:5;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace2:1;
      uint64_t M:1;
      uint64_t reservedSpace3:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace4:1;
      uint64_t CORE:1;
      uint64_t reservedSpace5:1;
      uint64_t CBE:1;
      uint64_t CWKUP:1;
      uint64_t CLBD:1;
      uint64_t MS:1;
      uint64_t reservedSpace6:3;
      uint64_t ML:1;
      uint64_t reservedSpace7:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t WKUPIE:1;
      uint64_t BEIE:1;
      uint64_t BEE:1;
      uint64_t LBDIE:1;
      uint64_t LBDL:1;
      uint64_t SBKL:2;
      uint64_t WKUPE:1;
      uint64_t reservedSpace0:2;
      uint64_t CLKC:2;
      uint64_t STOP:1;
      uint64_t LINEN:1;
      uint64_t reservedSpace1:1;
      uint64_t SBK:1;
      uint64_t SBKM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t LOOP:1;
      uint64_t reservedSpace1:3;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
      uint64_t LBMPSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBMC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBMC;

