iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define USART10 (*(volatile struct USART10_tag *) 0x40021c00)

struct USART2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t RTOF:1;
      uint64_t reservedSpace2:7;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FRACTION:7;
      uint64_t reservedSpace0:1;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTOE:1;
      uint64_t RTOIE:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace0:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace1:1;
      uint64_t M:1;
      uint64_t reservedSpace2:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace3:1;
      uint64_t CORE:1;
      uint64_t CRTOF:1;
      uint64_t reservedSpace4:3;
      uint64_t MS:1;
      uint64_t reservedSpace5:3;
      uint64_t ML:1;
      uint64_t FBME:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t reservedSpace0:10;
      uint64_t CLKC:2;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t reservedSpace3:11;
      uint64_t BCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define USART2 (*(volatile struct USART2_tag *) 0x4001d000)

struct USART3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t reservedSpace2:8;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FRACTION:7;
      uint64_t reservedSpace0:1;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace2:1;
      uint64_t M:1;
      uint64_t reservedSpace3:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace4:1;
      uint64_t CORE:1;
      uint64_t reservedSpace5:4;
      uint64_t MS:1;
      uint64_t reservedSpace6:3;
      uint64_t ML:1;
      uint64_t FBME:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t reservedSpace0:10;
      uint64_t CLKC:2;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t reservedSpace3:11;
      uint64_t BCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define USART3 (*(volatile struct USART3_tag *) 0x4001d400)

struct USART4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t reservedSpace2:8;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FRACTION:7;
      uint64_t reservedSpace0:1;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace2:1;
      uint64_t M:1;
      uint64_t reservedSpace3:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace4:1;
      uint64_t CORE:1;
      uint64_t reservedSpace5:4;
      uint64_t MS:1;
      uint64_t reservedSpace6:3;
      uint64_t ML:1;
      uint64_t FBME:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t reservedSpace0:10;
      uint64_t CLKC:2;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t reservedSpace3:11;
      uint64_t BCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

