iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
};

#define USART7 (*(volatile struct USART7_tag *) 0x40021000)

struct USART8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t reservedSpace2:8;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FRACTION:7;
      uint64_t reservedSpace0:1;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace2:1;
      uint64_t M:1;
      uint64_t reservedSpace3:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace4:1;
      uint64_t CORE:1;
      uint64_t reservedSpace5:4;
      uint64_t MS:1;
      uint64_t reservedSpace6:3;
      uint64_t ML:1;
      uint64_t FBME:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t reservedSpace0:10;
      uint64_t CLKC:2;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t reservedSpace3:11;
      uint64_t BCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define USART8 (*(volatile struct USART8_tag *) 0x40021400)

struct USART9_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t FE:1;
      uint64_t reservedSpace0:1;
      uint64_t ORE:1;
      uint64_t reservedSpace1:1;
      uint64_t RXNE:1;
      uint64_t TC:1;
      uint64_t TXE:1;
      uint64_t reservedSpace2:8;
      uint64_t MPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:9;
      uint64_t MPID:1;
      uint64_t reservedSpace0:6;
      uint64_t RDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_FRACTION:7;
      uint64_t reservedSpace0:1;
      uint64_t DIV_INTEGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t SLME:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TXEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t PS:1;
      uint64_t PCE:1;
      uint64_t reservedSpace2:1;
      uint64_t M:1;
      uint64_t reservedSpace3:2;
      uint64_t OVER8:1;
      uint64_t CPE:1;
      uint64_t CFE:1;
      uint64_t reservedSpace4:1;
      uint64_t CORE:1;
      uint64_t reservedSpace5:4;
      uint64_t MS:1;
      uint64_t reservedSpace6:3;
      uint64_t ML:1;
      uint64_t FBME:1;
      uint64_t NFE:1;
      uint64_t SBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPE:1;
      uint64_t reservedSpace0:10;
      uint64_t CLKC:2;
      uint64_t STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t HDSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t SCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t RTSE:1;
      uint64_t CTSE:1;
      uint64_t reservedSpace3:11;
      uint64_t BCN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

};

#define USART9 (*(volatile struct USART9_tag *) 0x40021800)

struct USBFS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t VBUSOVEN:1;
      uint64_t VBUSVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GVBUSCFG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GINTMSK:1;
      uint64_t HBSTLEN:4;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TXFELVL:1;
      uint64_t PTXFELVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAHBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOCAL:3;
      uint64_t reservedSpace0:3;
      uint64_t PHYSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t TRDT:4;
      uint64_t reservedSpace2:15;
      uint64_t FHMOD:1;
      uint64_t FDMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GUSBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSRST:1;
      uint64_t HSRST:1;
      uint64_t FCRST:1;
      uint64_t reservedSpace0:1;
      uint64_t RXFFLSH:1;
      uint64_t TXFFLSH:1;
      uint64_t TXFNUM:5;
      uint64_t reservedSpace1:19;
      uint64_t DMAREQ:1;
      uint64_t AHBIDL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRSTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMOD:1;
      uint64_t MMIS:1;
      uint64_t reservedSpace0:1;
      uint64_t SOF:1;
      uint64_t RXFNE:1;
      uint64_t NPTXFE:1;
      uint64_t GINAKEFF:1;
      uint64_t GONAKEFF:1;
      uint64_t reservedSpace1:2;
      uint64_t ESUSP:1;
      uint64_t USBSUSP:1;
      uint64_t USBRST:1;
      uint64_t ENUMDNE:1;
      uint64_t ISOODRP:1;
      uint64_t EOPF:1;
      uint64_t reservedSpace2:2;
      uint64_t IEPINT:1;
      uint64_t OEPINT:1;
      uint64_t IISOIXFR:1;
      uint64_t IPXFR_INCOMPISOOUT:1;
      uint64_t DATAFSUSP:1;
      uint64_t reservedSpace3:1;
      uint64_t HPRTINT:1;
      uint64_t HCINT:1;
      uint64_t PTXFE:1;
      uint64_t LPMINT:1;
      uint64_t CIDSCHG:1;
      uint64_t DISCINT:1;
      uint64_t VBUSVINT:1;
      uint64_t WKUINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MMISM:1;
      uint64_t reservedSpace1:1;
      uint64_t SOFM:1;
      uint64_t RXFNEM:1;
      uint64_t NPTXFEM:1;
      uint64_t GINAKEFFM:1;
      uint64_t GONAKEFFM:1;
      uint64_t reservedSpace2:2;
      uint64_t ESUSPM:1;
      uint64_t USBSUSPM:1;
      uint64_t USBRSTM:1;
      uint64_t ENUMDNEM:1;
      uint64_t ISOODRPM:1;
      uint64_t EOPFM:1;
      uint64_t reservedSpace3:2;
      uint64_t IEPIM:1;
      uint64_t OEPIM:1;
      uint64_t IISOIXFRM:1;
      uint64_t IPXFRM_INCOMPISOOUTM:1;
      uint64_t DATAFSUSPM:1;
      uint64_t reservedSpace4:1;
      uint64_t HPRTIM:1;
      uint64_t HCIM:1;
      uint64_t PTXFEM:1;
      uint64_t LPMINTM:1;
      uint64_t CIDSCHGM:1;
      uint64_t DISCIM:1;
      uint64_t VBUSVIM:1;
      uint64_t WKUIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNUM_EPNUM:4;
      uint64_t BCNT:11;
      uint64_t DPID:2;
      uint64_t PKTSTS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNUM_EPNUM:4;
      uint64_t BCNT:11;
      uint64_t DPID:2;
      uint64_t PKTSTS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXSTSP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFD:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPTXFSA:16;
      uint64_t NPTXFD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HNPTXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPTXFSAV:16;
      uint64_t NPTQXSAV:8;
      uint64_t NPTXQTOP:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HNPTXSTS;

  uint8_t res1[12];

  uint32_t CID;
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPMEN:1;
      uint64_t LPMACK:1;
      uint64_t BSEL:4;
      uint64_t REMWAKE:1;
      uint64_t L1SSEN:1;
      uint64_t BESLTHRS:4;
      uint64_t L1DSEN:1;
      uint64_t LPMRSP:2;
      uint64_t SLPSTS:1;
      uint64_t L1RSMOK:1;
      uint64_t LPMCHIDX:4;
      uint64_t LPMRCNT:3;
      uint64_t SENDLPM:1;
      uint64_t LPMRCNTSTS:3;
      uint64_t ENBSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLPMCFG;

