iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint32_t DOEPDMA11;
  uint8_t res126[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:11;
      uint64_t reservedSpace0:4;
      uint64_t USBAEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYP:2;
      uint64_t SNPM:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID:1;
      uint64_t SD1PID:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPCTL12;

  uint8_t res127[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t EPDISD:1;
      uint64_t reservedSpace0:1;
      uint64_t STUP:1;
      uint64_t OTEPDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINT12;

  uint8_t res128[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID_STUPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPTSIZ12;

  uint32_t DOEPDMA12;
  uint8_t res129[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:11;
      uint64_t reservedSpace0:4;
      uint64_t USBAEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYP:2;
      uint64_t SNPM:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID:1;
      uint64_t SD1PID:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPCTL13;

  uint8_t res130[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t EPDISD:1;
      uint64_t reservedSpace0:1;
      uint64_t STUP:1;
      uint64_t OTEPDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINT13;

  uint8_t res131[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID_STUPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPTSIZ13;

  uint32_t DOEPDMA13;
  uint8_t res132[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:11;
      uint64_t reservedSpace0:4;
      uint64_t USBAEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYP:2;
      uint64_t SNPM:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID:1;
      uint64_t SD1PID:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPCTL14;

  uint8_t res133[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t EPDISD:1;
      uint64_t reservedSpace0:1;
      uint64_t STUP:1;
      uint64_t OTEPDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINT14;

  uint8_t res134[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID_STUPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPTSIZ14;

  uint32_t DOEPDMA14;
  uint8_t res135[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:11;
      uint64_t reservedSpace0:4;
      uint64_t USBAEP:1;
      uint64_t DPID:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYP:2;
      uint64_t SNPM:1;
      uint64_t STALL:1;
      uint64_t reservedSpace1:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t SD0PID:1;
      uint64_t SD1PID:1;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPCTL15;

  uint8_t res136[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t EPDISD:1;
      uint64_t reservedSpace0:1;
      uint64_t STUP:1;
      uint64_t OTEPDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINT15;

  uint8_t res137[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID_STUPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPTSIZ15;

  uint32_t DOEPDMA15;
  uint8_t res138[264];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STPPCLK:1;
      uint64_t GATEHCLK:1;
      uint64_t reservedSpace0:3;
      uint64_t ENL1GTG:1;
      uint64_t PHYSLEEP:1;
      uint64_t SUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCCTL;

};

#define USBFS (*(volatile struct USBFS_tag *) 0x40080000)

struct USBHS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t VBUSOVEN:1;
      uint64_t VBUSVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GVBUSCFG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GINTMSK:1;
      uint64_t HBSTLEN:4;
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TXFELVL:1;
      uint64_t PTXFELVL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAHBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOCAL:3;
      uint64_t reservedSpace0:3;
      uint64_t PHYSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t TRDT:4;
      uint64_t reservedSpace2:1;
      uint64_t PHYLPCS:1;
      uint64_t reservedSpace3:1;
      uint64_t ULFSLS:1;
      uint64_t ULPIAR:1;
      uint64_t ULPICSM:1;
      uint64_t ULPIEVBUSD:1;
      uint64_t ULPIEVBUSI:1;
      uint64_t reservedSpace4:1;
      uint64_t PCCI:1;
      uint64_t PTCI:1;
      uint64_t ULPIPD:1;
      uint64_t reservedSpace5:3;
      uint64_t FHMOD:1;
      uint64_t FDMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GUSBCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSRST:1;
      uint64_t HSRST:1;
      uint64_t FCRST:1;
      uint64_t reservedSpace0:1;
      uint64_t RXFFLSH:1;
      uint64_t TXFFLSH:1;
      uint64_t TXFNUM:5;
      uint64_t reservedSpace1:19;
      uint64_t DMAREQ:1;
      uint64_t AHBIDL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRSTCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMOD:1;
      uint64_t MMIS:1;
      uint64_t reservedSpace0:1;
      uint64_t SOF:1;
      uint64_t RXFNE:1;
      uint64_t NPTXFE:1;
      uint64_t GINAKEFF:1;
      uint64_t GONAKEFF:1;
      uint64_t reservedSpace1:2;
      uint64_t ESUSP:1;
      uint64_t USBSUSP:1;
      uint64_t USBRST:1;
      uint64_t ENUMDNE:1;
      uint64_t ISOODRP:1;
      uint64_t EOPF:1;
      uint64_t reservedSpace2:2;
      uint64_t IEPINT:1;
      uint64_t OEPINT:1;
      uint64_t IISOIXFR:1;
      uint64_t IPXFR_INCOMPISOOUT:1;
      uint64_t DATAFSUSP:1;
      uint64_t reservedSpace3:1;
      uint64_t HPRTINT:1;
      uint64_t HCINT:1;
      uint64_t PTXFE:1;
      uint64_t LPMINT:1;
      uint64_t CIDSCHG:1;
      uint64_t DISCINT:1;
      uint64_t VBUSVINT:1;
      uint64_t WKUINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MMISM:1;
      uint64_t reservedSpace1:1;
      uint64_t SOFM:1;
      uint64_t RXFNEM:1;
      uint64_t NPTXFEM:1;
      uint64_t GINAKEFFM:1;
      uint64_t GONAKEFFM:1;
      uint64_t reservedSpace2:2;
      uint64_t ESUSPM:1;
      uint64_t USBSUSPM:1;
      uint64_t USBRSTM:1;
      uint64_t ENUMDNEM:1;
      uint64_t ISOODRPM:1;
      uint64_t EOPFM:1;
      uint64_t reservedSpace3:2;
      uint64_t IEPIM:1;
      uint64_t OEPIM:1;
      uint64_t IISOIXFRM:1;
      uint64_t IPXFRM_INCOMPISOOUTM:1;
      uint64_t DATAFSUSPM:1;
      uint64_t reservedSpace4:1;
      uint64_t HPRTIM:1;
      uint64_t HCIM:1;
      uint64_t PTXFEM:1;
      uint64_t LPMINTM:1;
      uint64_t CIDSCHGM:1;
      uint64_t DISCIM:1;
      uint64_t VBUSVIM:1;
      uint64_t WKUIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNUM_EPNUM:4;
      uint64_t BCNT:11;
      uint64_t DPID:2;
      uint64_t PKTSTS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXSTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNUM_EPNUM:4;
      uint64_t BCNT:11;
      uint64_t DPID:2;
      uint64_t PKTSTS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXSTSP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPTXFSA:16;
      uint64_t NPTXFD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HNPTXFSIZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NPTXFSAV:16;
      uint64_t NPTQXSAV:8;
      uint64_t NPTXQTOP:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HNPTXSTS;

  uint8_t res1[12];

  uint32_t CID;
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPMEN:1;
      uint64_t LPMACK:1;
      uint64_t BSEL:4;
      uint64_t REMWAKE:1;
      uint64_t L1SSEN:1;
      uint64_t BESLTHRS:4;
      uint64_t L1DSEN:1;
      uint64_t LPMRSP:2;
      uint64_t SLPSTS:1;
      uint64_t L1RSMOK:1;
      uint64_t LPMCHIDX:4;
      uint64_t LPMRCNT:3;
      uint64_t SENDLPM:1;
      uint64_t LPMRCNTSTS:3;
      uint64_t ENBSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLPMCFG;

