iSYSTEMLabs/winIDEAExampleWorkspaces/HDSC/HC32F4A0_FLASH_GCC/targetInit/hc32f4a0_sfr.h
  uint32_t HCDMA14;
  uint8_t res22[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:11;
      uint64_t EPNUM:4;
      uint64_t EPDIR:1;
      uint64_t reservedSpace0:1;
      uint64_t LSDEV:1;
      uint64_t EPTYP:2;
      uint64_t MC:2;
      uint64_t DAD:7;
      uint64_t ODDFRM:1;
      uint64_t CHDIS:1;
      uint64_t CHENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCCHAR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRTADDR:7;
      uint64_t HUBADDR:7;
      uint64_t XACTPOS:2;
      uint64_t COMPLSPLT:1;
      uint64_t reservedSpace0:14;
      uint64_t SPLITEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCSPLT15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t CHH:1;
      uint64_t AHBERR:1;
      uint64_t STALL:1;
      uint64_t NAK:1;
      uint64_t ACK:1;
      uint64_t NYET:1;
      uint64_t TXERR:1;
      uint64_t BBERR:1;
      uint64_t FRMOR:1;
      uint64_t DTERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCINT15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRCM:1;
      uint64_t CHHM:1;
      uint64_t AHBERRM:1;
      uint64_t STALLM:1;
      uint64_t NAKM:1;
      uint64_t ACKM:1;
      uint64_t NYETM:1;
      uint64_t TXERRM:1;
      uint64_t BBERRM:1;
      uint64_t FRMORM:1;
      uint64_t DTERRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCINTMSK15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t DPID:2;
      uint64_t DOPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HCTSIZ15;

  uint32_t HCDMA15;
  uint8_t res23[264];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSPD:2;
      uint64_t NZLSOHSK:1;
      uint64_t reservedSpace0:1;
      uint64_t DAD:7;
      uint64_t PFIVL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWUSIG:1;
      uint64_t SDIS:1;
      uint64_t GINSTS:1;
      uint64_t GONSTS:1;
      uint64_t TCTL:3;
      uint64_t SGINAK:1;
      uint64_t CGINAK:1;
      uint64_t SGONAK:1;
      uint64_t CGONAK:1;
      uint64_t POPRGDNE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPSTS:1;
      uint64_t ENUMSPD:2;
      uint64_t EERR:1;
      uint64_t reservedSpace0:4;
      uint64_t FNSOF:14;
      uint64_t LNSTS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTS;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRCM:1;
      uint64_t EPDM:1;
      uint64_t reservedSpace0:1;
      uint64_t TOM:1;
      uint64_t TTXFEMSK:1;
      uint64_t INEPNMM:1;
      uint64_t INEPNEM:1;
      uint64_t reservedSpace1:1;
      uint64_t TXFURM:1;
      uint64_t reservedSpace2:4;
      uint64_t NAKM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRCM:1;
      uint64_t EPDM:1;
      uint64_t reservedSpace0:1;
      uint64_t STUPM:1;
      uint64_t OTEPDM:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
      uint64_t reservedSpace2:1;
      uint64_t OPEM:1;
      uint64_t reservedSpace3:5;
      uint64_t NYETM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPINT:16;
      uint64_t OEPINT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEPINTM:16;
      uint64_t OEPINTM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAINTMSK;

  uint8_t res25[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NONISOTHREN:1;
      uint64_t ISOTHREN:1;
      uint64_t TXTHRLEN:9;
      uint64_t reservedSpace0:5;
      uint64_t RXTHREN:1;
      uint64_t RXTHRLEN:9;
      uint64_t reservedSpace1:1;
      uint64_t ARPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTHRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPTXFEM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPEMPMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t IEP1INT:1;
      uint64_t reservedSpace1:15;
      uint64_t OEP1INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEACHINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t IEP1INTM:1;
      uint64_t reservedSpace1:15;
      uint64_t OEP1INTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEACHINTMSK;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRCM:1;
      uint64_t EPDM:1;
      uint64_t reservedSpace0:1;
      uint64_t TOM:1;
      uint64_t TTXFEMSK:1;
      uint64_t INEPNMM:1;
      uint64_t INEPNEM:1;
      uint64_t reservedSpace1:1;
      uint64_t TXFURM:1;
      uint64_t reservedSpace2:4;
      uint64_t NAKM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPEACHMSK1;

  uint8_t res27[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRCM:1;
      uint64_t EPDM:1;
      uint64_t reservedSpace0:1;
      uint64_t STUPM:1;
      uint64_t OTEPDM:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
      uint64_t reservedSpace2:1;
      uint64_t OPEM:1;
      uint64_t reservedSpace3:5;
      uint64_t NYETM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPEACHMSK1;

  uint8_t res28[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSIZ:2;
      uint64_t reservedSpace0:13;
      uint64_t USBAEP:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKSTS:1;
      uint64_t EPTYP:2;
      uint64_t reservedSpace2:1;
      uint64_t STALL:1;
      uint64_t TXFNUM:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPDIS:1;
      uint64_t EPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPCTL0;

